{
	"id": 235618704,
	"body": "@ianlancetaylor \r\n\u003e I'm not crazy about adding a config file to the build system ... Adding a config file known to the build system requires extending all tools that need to use the go/types packages to understand that config file as well\r\n\r\nIn most cases I agree. However, I don't think anyone has given a crisp reason _why_ tools (other than the build tool) need to understand aliases.\r\n\r\nThe primary motivation for this proposal is large scale refactorings: You want to rename a type. Ideally you'd rename the type and update all uses of that type in a single, atomic change, but in large codebases, that atomic change can become so massive that you get stuck in a merge/conflict loop and can never submit the change. So, you need to be in a temporary state where you have two names for the same type while you incrementally move uses of the old type to the new type. Eventually, a few hours or days later, you've updated all uses of the old type and can finally remove it.\r\n\r\nThe key observation is that this process is temporary. You are (hopefully!) not going to be in a state of constantly refactoring the same core library. Tools like guru may be partially broken for a few hours or days while the refactoring moves forward. If some subset of your codebase can't survive a few days with a partially-broken analysis tool, there's a simple fix -- update that subset of your codebase to use the new types.\r\n\r\nMaybe there are good reasons why aliases need to be kept around for a long time? @griesemer's original proposal does not say. @bcmills might be proposing long-lived aliases (I'm not sure). If aliases are long-lived, then I agree, tools like guru need to understand aliases, and we definitely need a language change. But, if aliases are intended to be short-lived in all cases, I think that opens the door to build system changes that are: (1) uglier and messier than language changes, in some ways, but (2) good enough to solve the problem, and (3) less objectionable to the subset of the community that doesn't like the proposed language changes.",
	"user": {
		"login": "tombergan",
		"id": 13954200,
		"type": "User",
		"site_admin": false
	},
	"reactions": {
		"total_count": 1,
		"+1": 1
	},
	"created_at": "2016-07-27T15:17:06Z",
	"updated_at": "2016-07-27T15:20:29Z"
}
