{
	"id": 247536289,
	"body": "_A META post, about the whole discussion, not sure whether this is the appropriate place._\r\n\r\n@rsc I don't think most of the disappointment here isn't because that their \"viewpoint\" wasn't accepted; I can safely assume that all people here know that sometimes a decision has to be made and some people are going to be unhappy about the decision. _Although I might be speaking only for myself here._\r\n\r\nI think the main issue is that this is a very long discussion with a lot of noise between bits and pieces of information, statements, counter-proposals and arguments. _You probably know the amount of effort required to read the whole thing._ Noisy long threads cause people to produce even more noise, because they are uncertain whether their \"arguments got heard\"; alternatively, because people skim the long discussion and didn't notice an argument, and end up repeating it, which in turn causes people to repeat the same counter-argument.\r\n\r\nSo, when adding a \"proposal-accepted\", \"proposal-rejected\" in such a situation -- it's really hard to see why such conclusion was reached. I'm confident the team discussed these in depth... Maybe there were important deciding factors somewhere inside one of the 300 comments. Or the discussion wasn't leading anywhere useful and too many pros/cons were hypothetical and a \"trial run\" would clarify them... etc. I don't doubt the effort that went into making that decision, but the reasoning for all of the points isn't visible. i.e. which points had merit, which didn't. Leaving these \"points\" without an \"official answer\" leaves people in an confused state -\u003e hence the disappointment and the feeling of biased decision making. _Yes, there are answers inside the thread -- but these get lost inside the noise._\r\n\r\nSome thoughts for future improvements to similarly difficult proposals:\r\n\r\n* While doing the final evaluation create a summarizing document outlining major points, with personal notes (from anyone who is doing the evaluation). It doesn't have to be long, just enough. _Maybe, also include this final evaluation summary in the proposal as well._\r\n* To reduce noise during discussion, there needs to be some sort of summary/overview with links to comments at the top of the issue. There were some efforts to summarize in this discussion, but these eventually got buried between other comments. Some sort of collaborative [argument mapping](https://en.wikipedia.org/wiki/Argument_map) software could be useful; alternatively a editable google doc with a moderator can work just as well.",
	"user": {
		"login": "egonelbre",
		"id": 192964,
		"type": "User",
		"site_admin": false
	},
	"reactions": {
		"total_count": 10,
		"+1": 10
	},
	"created_at": "2016-09-16T07:29:28Z",
	"updated_at": "2016-09-16T07:38:49Z"
}
