{
	"id": 233759255,
	"body": "@davecheney Thanks for your feedback. @ianlancetaylor has already provided better responses than I could have given.\r\n\r\nI like to bring in a historical perspective: The notion of an alias for types existed from day one in the design of Go. I was a strong proponent of the idea that a type declaration of the form\r\n```\r\ntype T \u003csome type specification\u003e\r\n```\r\ndoes not introduce a new type but simply gives the type specification on the RHS a name. Specifically, if the RHS were just a type name, T would simply be an alternate name for it. This is not far-fetched, given that this is how type declarations work in the Pascal family of languages, from which Go borrows heavily for declarations. In turn, I was suggesting that to \"make a new type\" one would have to say something along the lines\r\n```\r\ntype T new \u003csome type specification\u003e\r\n```\r\nwhich would have created a new type T. Things worked out differently. For one, in most cases we do want to create a new type so that we can attach methods to the named type. Go also uses a mix of structural and named type equivalence, in contrast to Pascal family languages where two types are only the same if they originated in the same declaration. Not introducing a new type would cause all kinds of other issues.\r\n\r\nTo make a long story short, the desire to create alias types existed early on, and the notation\r\n```\r\ntype T = \u003csome type specification\u003e\r\n```\r\nto denote an alias type is many years old (I may remember incorrectly, but it may even be pre-Go 1). We didn't act on it earlier because there was no sufficiently strong use case at that time. With larger and larger Go applications being written and with much more experience in using Go, I believe we see now more and more situations where alias types would be beneficial.\r\n\r\nThe alias proposal is simply a generalization of that original idea. I agree with @ianlancetaylor  that a minimal approach would be to just introduce type aliases.",
	"user": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"reactions": {
		"total_count": 5,
		"+1": 5
	},
	"created_at": "2016-07-19T20:42:43Z",
	"updated_at": "2016-07-19T20:42:43Z"
}
