{
	"id": 196405772,
	"body": "Sure.  `Terminated()` and `TimeRemaining()` are mostly synonymous with the existing `Done()` and `Deadline()`.  In terms of the changes there, I think `Terminated()` better conveys that the context was actually canceled.  I believe a x/net/context could finish it's work and be \"done\" but the `Done()` channel wouldn't close unless an expiration or CancelFunc were fired.\r\n\r\nFor TimeRemaining() vs Deadline(), there's more value (for me anyway) in knowing how much time is left vs an expiration date.  I can't personally think of a case where I'd want the `Deadline()` date vs simply knowing how much time (if any) is left.  This isn't a major concern, but just something to discuss.\r\n\r\nAdding the `WithValue` and `WithTimeout` methods to the interface, like I've done, definitely makes it \"fatter\", so that could be a downside.  I believe it makes the parent/child relationships clearer and makes the context cleaner to construct/work with than all of the different x/net/context.With* functions, but that might just be me.\r\n\r\nI think my biggest concern with the current x/net/context is the CancelFunc stuff and the Background() and TODO() funcs.  I \"get it\" now, but those were the biggest barrier to my understanding of the package.  It's far easier for me to comprehend `Context.Cancel()` and implicit cancelation via timeout with the implementation I provided than all of the `CancelFunc` return values from x/net/context.  Similarly, it's easier for me to comprehend creating new contexts via `New()`, `Context.WithTimeout()`, and `Context.WithValue()` than using `TODO()`, `Background()` and the different `WithValue()`, `WithDeadline()`, `WithTimeout()`, and `WithCancel()` constructor funcs from x/net/context.  On the one hand, I get that using those keeps the interface slimmer, but on the other hand, it makes x/net/context far more confusing (to me).\r\n\r\nI'm not necessarily putting forth this alternative implementation as _the_ alternative, but rather _an_ alternative to hopefully spark some discussion around the current x/net/context API.",
	"user": {
		"login": "bobziuchkovski",
		"id": 675443,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-03-14T16:46:14Z",
	"updated_at": "2016-03-14T17:39:37Z"
}
