{
	"id": 76379583,
	"body": "You might want to check out gokit.io. It's scope is a bit wider than just\nweb development. Several Go team members are involved with that effort.\n\nOn 27 February 2015 at 21:40, Tung Nguyen \u003cnotifications@github.com\u003e wrote:\n\n\u003e Coming from the land of PHP, I have seen a lot of efforts from the\n\u003e community to fix / improve / push the development of its. Those efforts\n\u003e also lead to the tightly collaboration between language's designers /\n\u003e maintainers and lib / framework authors for future releases.\n\u003e\n\u003e Some PHP community's \"notable efforts\":\n\u003e http://www.php-fig.org/\n\u003e http://www.phptherightway.com/\n\u003e https://packagist.org/\n\u003e https://getcomposer.org/\n\u003e https://thephpleague.com/\n\u003e\n\u003e Fortunately, Golang was started as a very modern and\n\u003e well-[designed/backed/advocated] programming language. But after trying a\n\u003e lot of web frameworks (last month), it seems that we are lacking\n\u003e well-defined standard or the \"right\" way to solve some common problems (web\n\u003e development? deployment?). Day by day, I have to seek for the \"fragmented\"\n\u003e knowledges which are shared by a lot of Gophers (thanks to their efforts).\n\u003e It's very time consuming and painful for those who aren't living near any\n\u003e Golang's \"hotspot\" communities like me.\n\u003e\n\u003e *I wonder is there any collaboration between Go's offficial maintainers\n\u003e and the library/framework authors?*\n\u003e\n\u003e As an advocate of Go, I hope for a future that I could do anything with it\n\u003e on the server-side without considering about other languages and it's\n\u003e easier for those who don't have a solid Computer Science background to\n\u003e entry. In my point of view, there are many tasks/problems that beginners\n\u003e shouldn't try to solve themself, or there are many problems that we can\n\u003e solve without the overhead of understanding \"how's the very complex things\n\u003e at the low-level works\".\n\u003e\n\u003e *Anyway, if you don't see this as an issue of Go, just ignores it. Maybe,\n\u003e it's just my own problems :D*\n\u003e\n\u003e —\n\u003e Reply to this email directly or view it on GitHub\n\u003e \u003chttps://github.com/golang/go/issues/10021\u003e.\n\u003e\n",
	"user": {
		"login": "adg",
		"id": 8446613,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-02-27T11:16:28Z",
	"updated_at": "2015-02-27T11:16:28Z"
}
