{
	"id": 66049605,
	"body": "\u003ca id=\"c6\"\u003e\u003c/a\u003eComment 6:\n\n\u003cpre\u003eThis is very strange.  You've run into at least three seemingly\nunrelated problems.\n\n1. It looks like maybe the first attempt at building\nopnames.h failed, and because make clean doesn't\ndelete it (I'll fix that), all.bash doesn't try to recreate it.\n\nOpen $GOROOT/src/cmd/gc/opnames.h.\nIt should look like the output you pasted in earlier.\nIf it doesn't, try doing\n\ncd $GOROOT/src/cmd/gc\nrm opnames.h\nmake opnames.h\n\nand see if that makes it look better.\n\n2. I don't see this in the log.txt you uploaded, but your message\nsaid that you had this error:\n\n/bin/sh: ./mkbuiltin: Permission denied\n\nThis makes it look like either you don't have an executable\n/bin/sh (pretty unlikely) or /bin/sh cannot open ./mkbuiltin\n(also unlikely).  Try to run \n\ncd $GOROOT/src/cmd/gc\n./mkbuiltin\n\nby hand and see if it runs ok.  If not, that's another thing\nto debug.  But your log.txt makes it look like mkbuiltin ran\nokay.\n\n3. Bison seems to be misbehaving on the input grammar.\n\nconflicts: 3 shift/reduce\ngo.y:977.9-980.9: warning: rule useless in parser due to conflicts: non_expr_type: \n'(' non_expr_type ')'\n\nThis shouldn't happen - there should be no shift/reduce conflicts\nreported by bison.  What version of bison do you have\n(bison --version)?  My Ubuntu system says Bison 2.3.\nAnother user had a problem where there was another program\ncalled Bison++ installed instead of Bison, and that program \nwasn't quite implementing the right parsing algorithms.\nIn that case, though, it compiled and just produced different\nsyntax errors.\n\n#1 and #2 might both be explained by your Mercurial checkout\nfor some reason dropping the executable bits on the scripts\nand then you having to fix them up by hand.  Did something \nlike that happen?\u003c/pre\u003e",
	"user": {
		"login": "rsc",
		"id": 104030,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2009-12-16T03:34:51Z",
	"updated_at": "2014-12-08T10:04:29Z"
}
