{
	"id": 245082122,
	"body": "Please accept my apologies for the mail spam created by replying to this thread; I have some interest / experience in this area having developed and used a formatting markup of my own devising for 8 years now.\r\n\r\nBefore I even talk about possible syntax to use; a policy you could adopt is to introduce formatting syntax only one, complete instance at a time (each Go release for example) -- allowing time for discussion and seeing what happens to it out in the wild.\r\n\r\n---\r\n\r\nMy own markup system was developed specifically to look best as raw text as I would primarily be editing it in a text editor. I won't recommend my own syntax as-is, but I can provide some lessons learnt.\r\n\r\n```\r\nThe use of \u003cangle brackets (/url)\u003e for URLs flows more naturally than [those of Markdown](/url)\r\nand actually has more precedence in programmers' comments, e.g. \u003cgoogle.com\u003e, than\r\nMarkdown's arbitrary syntax.\r\n\r\nThough I would improve my original syntax to \u003cuse a colon or bar for URL separation : /url\u003e.\r\nRelative URLs I abbreviated like \u003cthis\u003e, where \"this\" implies a URL of \"./this\", and could be\r\nused for interlinking; though [square brackets] are a more common syntax for that. \r\n```\r\n\r\nA markup syntax should communicate the programmer's voice rather than force them to micro-manage semantics; such as being forced to apply markup for all Proper Names they desire to be interlinked. Where possible of course, `go doc` could automatically hyperlink words it can recognise as Proper Names, but given go's naming conventions this is never 100% possible and is probably a chimera that should not be chased. \r\n\r\nIf I _had_ to provide a solution with the noted concern of burdening documentation writers the world over, then these are the two solutions I propose:\r\n\r\n1. An acute at the end of a word signals the word as a Proper Name to be linked.\r\n e.g. `returns a lexer^ struct`\r\n\r\n2. Prefixing Proper Names with a dot; this implies that we are abbreviating the fully-qualified dotted notation of something. e.g. `returns a .lexer struct` implies that `.lexer` is this package's `lexer`. This is my preferred syntax as it's light on the eyes, easy to type and doesn't introduce punctuation that has alternate meaning in Go code proper\r\n\r\n---\r\n\r\nMost all markup syntaxes don't include Definition Lists, and this is very sad! :(\r\nDefinition lists are awesome. The syntax I arrived at is visually pleasing and very easy to type\r\n\r\n```\r\n:: Aardvark\r\n    A large, nocturnal, burrowing mammal, Orycteropus afer, of central and southern\r\n    Africa, feeding on ants and termites and having a long, extensile tongue,\r\n    strong claws, and long ears.\r\n\r\n:: Abacus\r\n    A device for making arithmetic calculations, consisting of a frame set\r\n    with rods on which balls or beads are moved.\r\n```\r\n\r\nI provide this as an alternative to consider too:\r\n(line ending in colon with indented area immediately following, no blank line between)\r\n\r\n```\r\nAardvark:\r\n    A large, nocturnal, burrowing mammal, Orycteropus afer, of central and southern\r\n    Africa, feeding on ants and termites and having a long, extensile tongue,\r\n    strong claws, and long ears.\r\n\r\nAbacus:\r\n    A device for making arithmetic calculations, consisting of a frame set\r\n    with rods on which balls or beads are moved.\r\n```\r\n\r\n---\r\n\r\nI have spent a long time sweating details over plain-text presentation of markup syntax as I was not content to accept existing systems that lean to heavy on being languages of their own; I can understand very much why Google wanted to keep documentation comments as natural as possible.\r\n\r\nMy ideas on this issue are forever evolving. If you're interested in seeing more of my markup syntax, please browse over the following two guides:\r\n\r\n* http://forum.camendesign.com/markup.php\r\n* http://camendesign.com/remarkable\r\n\r\nAgain, sorry if this comes across as spam, but I feel like this is an area of design that I can really contribute to.\r\n\r\nKind regards,\r\nKroc Camen.",
	"user": {
		"login": "Kroc",
		"id": 142650,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-06T20:35:24Z",
	"updated_at": "2016-09-06T20:35:24Z"
}
