{
	"id": 66070218,
	"body": "\u003ca id=\"c1\"\u003e\u003c/a\u003eComment 1:\n\n\u003cpre\u003eI can see your problem (gcc is not in your PATH), but I am not clear with your proposal.\nYou are proposing to change all.bat to:\n\n1) check that c:\\mingw\\bin is not in the PATH\n2) check that c:\\mingw\\bin\\gcc.exe exists\n3) then change PATH=c:\\mingw\\bin;%PATH% for the time of all.bat run\n\nThis can be confusing and difficult to do.\n\nConfusing: I have 2 mingw installations in c:\\mingw and c:\\mingw64. Sometimes I want to\nuse one, other time I use the other. If I go with c:\\mingw64, I do not want all.bat\nmagically ignore my choice and go for the alternative.\n\nDifficult to do: I do not know how to achieve 1) or 2) in batch. I am certain it can be\ndone, but why bother with complexity.\n\nA) I think you should do what I do instead. I have created batch file on my desktop\n(called a.bat or something) that has this:\n\nset GOROOT=c:\\go\\root\nset GOPATH=c:\\go\\path\\others;c:\\go\\path\\mine\nset GITDIR=c:\\bin\\git\nset PATH=%PATH%;c:\\go\\mingw\\bin;%GOROOT%\\bin;%GITDIR%\\cmd\ncd %GOROOT%\\src\nCMD\n\nI double click on that file and it opens new command window with all my environment set\nand proper directory current - all ready to go. Super easy. You could remove GOPATH and\nGITDIR, if you only going to develop inside GOROOT.\n\nB) Alternatively, you could change global PATH environment variable to include\nc:\\mingw\\bin there. Then every command window will have gcc. If you need help with that,\nI will tell you how.\n\nC) If you dead against A) or B), then we could just do 3), but that still makes it\nconfusing and surprising for some users.\n\n\u003e Russ says: \"if you're writing the CL, sure\"\nRuss is a smart man. You should always think twice before you follow his advise. :0)\n\n\u003e Help wanted, or I can learn bat files one day.\nWe are in the same boat. I would have to learn how to do it myself. I prefer, you just\ngo with my proposal A) instead.\n\nAlex\u003c/pre\u003e",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2012-09-14T00:34:20Z",
	"updated_at": "2014-12-08T10:21:41Z"
}
