{
	"id": 66047310,
	"body": "\u003ca id=\"c933\"\u003e\u003c/a\u003eComment 933 by **jordanrastrick**:\n\n\u003cpre\u003eWow... \n\nA comparison of this \"mistake\" to the corporate dysfunction that brought down Lehman \nBrothers.\n\nSomeone claiming to be an IP lawyer who doesn't know the difference between \ntrademarks and copyright.\n\nPeople accusing Google of hubris on the scale of equating themselves with God - \nbecause they didn't notice an incredibly obscure existing language had a similar (not \nidentical) name to theirs. Which, incidentally, is not merely free and open source, \nbut is pretty much just an outright gift to the global development community, because \nthere's no real commercial market share considerations involved in a programming \nlanguage, unlike many of Google's other free offerings which are clearly of strategic \nvalue.\n\nThis thread is surely subject to xkcd's law of youtube - you couldn't post a comment \nhere dumb enough that people would know it was satirical.\n\nI think for the sake of Google's long term prospects as a company, they really need \nto nip this kinda crap in the bud, and definitively come out and reject the notion \nthat \"don't be evil\" means \"spend inordinate time, money and energy ensuring you \ndon't ever mildly inconvenience any other person on the face of the earth.\"\n\nWhile issue9 would have a cool \"memetic\" factor as a name, I'm starting to think it \nwould be an eternal reminder of the day one Google allowed a bunch of whining \ninternet idiots bully them into changing an inconsequential decision for no real \njustifiable reason.\n\nGive people an inch, and its often the case that they'll take a mile. Any company \nwould be better off without the kind of customers who threaten to boycott it over \nsomething like this. And this isn't just my prejudices as a customer service worker \ncoming to the fore - its empirically well founded, and established in business best \npractice circles. The average business wants to lose its worst 10% or so of customers  \n- it frees up a huge amount of essentially wasted resources that can be much better \nspent making the normal people a great deal more happy.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2009-11-17T03:29:42Z",
	"updated_at": "2014-12-08T10:02:46Z"
}
