{
	"id": 191970451,
	"body": "Heh heh. I can't really see any reason why the loop in symtab couldn't be\ndone when the symbol is read from the file, although I wouldn't be\nsurprised if a hundred fiddly things depend on the current ordering (symtab\nis called quite late in the process). Maybe I could just try it.\n\ndodata is a horrifying mess of its own. Would be nice to rewrite it but I\nthink I'm definitely too scared.\n\nOn 4 March 2016 at 09:03, Josh Bleecher Snyder \u003cnotifications@github.com\u003e\nwrote:\n\n\u003e @ianlancetaylor \u003chttps://github.com/ianlancetaylor\u003e commented in CL 20165:\n\u003e\n\u003e The single slowest operation a linker can do is traverse the symbol table\n\u003e and look at every symbol. The single biggest improvement in link time in\n\u003e the gold linker was changing the number of symbol table traversals from\n\u003e about 25 to about 3. Yet cmd/link traverses the entire symbol table all the\n\u003e time. It's not good.\n\u003e\n\u003e @crawshaw \u003chttps://github.com/crawshaw\u003e replied:\n\u003e\n\u003e Agreed. There are a couple of other not good features:\n\u003e\n\u003e    - LSym has a Type word, but it's not filled out until some nebulous\n\u003e    intermediate pass, so lots of code (like this) ends up string matching on\n\u003e    the symbol name prefix.\n\u003e    - dodata does some odd build-a-linked-list, then\n\u003e    sort-the-linked-list-into-segments game.\n\u003e\n\u003e I think these problems and the many traversals could be fixed by the\n\u003e object file reader assigning Type and building useful link-wide slices when\n\u003e a symbol is read in. But it is pretty major surgery I'm not ready to\n\u003e perform.\n\u003e\n\u003e I've moved this to an issue, since folks look for work and ideas in issues.\n\u003e\n\u003e cc @mwhudson \u003chttps://github.com/mwhudson\u003e who likes object files. :)\n\u003e\n\u003e —\n\u003e Reply to this email directly or view it on GitHub\n\u003e \u003chttps://github.com/golang/go/issues/14624\u003e.\n\u003e\n",
	"user": {
		"login": "mwhudson",
		"id": 672022,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-03-03T21:24:44Z",
	"updated_at": "2016-03-03T21:24:44Z"
}
