{
	"id": 88140552,
	"body": "\u003e What we have right now for Mac and Linux lets you download the stock Go build, write a 15-line app and type go build. Compile+test cycles are dramatically faster than working on the real device, and the whole experience is a lot more fun. I'd like to bring that to windows users. I'm sure we can, there's just work to do.\r\n\r\n---\r\n\r\n\u003e \u003e Does x/mobile/gl support windows yet? (I can't remember if either Hana or I added it.) I hope it's not to hard to add, but I wouldn't want to break any gxui users on windows.\r\n\u003e \r\n\u003e So AFAICT, no it doesn't. It doesn't seem trivial to add either. The problem is windows doesn't really have an OpenGL header that's worth using (the system one is OpenGL 1.1, which is pretty worthless). Typically, the drivers support more up to date versions of GL - GXUI has shown that most windows users have a driver that supports at least OpenGL 2.1, but the function pointers need to be obtained using something like [`wglGetProcAddress`](https://msdn.microsoft.com/en-us/library/windows/desktop/dd374386%28v=vs.85%29.aspx).\r\n\u003e \r\n\u003e I'm not sure what the best course of action is for adding Windows support into `x/mobile/gl`. Really all you're going to end up with is something using GLEW or something that looks very similar to [GLOW](https://github.com/go-gl/gl/blob/master/v2.1/gl/procaddr.go).\r\n\r\n/cc @crawshaw @ben-clayton\r\n\r\nIt seems the end goal is to make it work very seamless on Windows, but it sounds hard to do right away.\r\n\r\nWhat do you think about taking a smaller step first, getting it to work at least as well as `github.com/go-gl/gl/v2.1/gl` works on Windows, and then creating a new issue to improve the experience?\r\n\r\nDoing that can be done very quickly and allow google/gxui#86 to proceed.\r\n\r\nThere are a few ways to make it happen:\r\n\r\n- Import and use `github.com/go-gl/gl/v2.1/gl` to implement the GL interface using windows build constraint.\r\n\r\n- Use [glow](https://github.com/go-gl/glow) (the GL bindings generator that is used to generate all go-gl/gl/... packages) to generate the implementation of GL needed for windows build constraint.\r\n    - E.g., see https://github.com/go-gl/gl/blob/master/generate.go.\r\n\r\n- Similar to above, but outright copy the code of `github.com/go-gl/gl/v2.1/gl` to implement the GL interface using windows build constraint.\r\n\r\n- Other ways?",
	"user": {
		"login": "shurcooL",
		"id": 1924134,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-03-31T15:52:14Z",
	"updated_at": "2015-03-31T16:00:11Z"
}
