{
	"id": 130750812,
	"body": "I also miss a decimal floating point data type.\r\n\r\nThe reasons why decimal floating numbers are important can be found here:\r\nhttp://speleotrove.com/decimal/decifaq.html\r\n\r\nIn my projects, I use the C library __decNumber__, written by Mike Cowlishaw.\r\nhttp://speleotrove.com/decimal/\r\n\r\n\u003e The decNumber package, an implementation of the specifications in ANSI C, provides a reference implementation for both the arithmetic and the encodings.\r\n\u003e It includes both an arbitrary-precision implementation and a (much faster) decFloats implementation that uses the IEEE 754 decimal encodings directly to implement decSingle, decDouble, and decQuad datatypes.\r\n\r\nTo download the source files, go to \"International Components for Unicode (ICU)\" and click \"decNumber package\".\r\n\r\nThe decQuad type is 128 bits long, and stores a decimal floating point number.\r\ndecDouble type is 64 bits long, and decSingle type is 32 bits long.\r\n\r\nPersonnally, I just put the .c and .h files in my project tree, and call the library functions using cgo.\r\nI just use the __decQuad__ type, which has the largest precision and stores numbers in 128 bits.\r\nBy experience, I really think it is an excellent library.\r\n\r\nExample of use:\r\nhttp://speleotrove.com/decimal/dnusers.html#example7\r\n\r\nIt would be great if a Go package wrapping this C library could be integrated in Go standard library, before being replaced by a pure Go solution with the same API.\r\nIn this case, it should perhaps be called \"decnumber\".\r\n\r\nNote that this library is already integrated in __gcc compiler__.\r\nBut the type name have changed, e.g. decQuad became __Decimal128 in gcc.\r\nhttps://gcc.gnu.org/onlinedocs/gcc/Decimal-Float.html\r\n\r\n\u003e As an extension, GNU C supports decimal floating types as defined in the N1312 draft of ISO/IEC WDTR24732.\r\n\u003e Support for decimal floating types in GCC will evolve as the draft technical report changes.\r\n\u003e Calling conventions for any target might also change. Not all targets support decimal floating types.\r\n\u003e \r\n\u003e The decimal floating types are _Decimal32, _Decimal64, and _Decimal128. \r\n\r\n",
	"user": {
		"login": "rin01",
		"id": 9582469,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-08-13T16:27:09Z",
	"updated_at": "2015-08-13T16:27:49Z"
}
