{
	"id": 181802279,
	"number": 17383,
	"state": "open",
	"title": "x/text/secure/precis: Bidi rule is applied incorrectly",
	"body": "Currently in PRECIS profiles that use the bidi rule ([RFC 5893 ยง2](https://tools.ietf.org/html/rfc5893#section-2)) such as the username profiles, the bidi rule is always applied regardless of whether RTL characters exist in the input string. However, [RFC 7613 ยง3.3.2](https://tools.ietf.org/html/rfc7613#section-3.3.2) seems to state that the bidi rule should not be applied unless it would succeed (strings that fail the bidi rule don't fail the enforcement operation, the bidi rule just isn't applied):\r\n\r\n\u003e Directionality Rule: Applications MUST apply the \"Bidi Rule\"\r\n\u003e defined in [RFC5893] **to strings that contain right-to-left\r\n\u003e characters** (i.e., each of the six conditions of the Bidi Rule\r\n\u003e must be satisfied).\r\n\r\nThis wording is a bit confusing (I started looking into this when someone asked on the IETF list for clarification of the above paragraph), but the recent [draft-ietf-precis-7613bis-03](https://tools.ietf.org/html/draft-ietf-precis-7613bis-03#section-3.2.1) clarifies the language:\r\n\r\n\u003e Directionality Rule: Apply the \"Bidi Rule\" defined in [RFC5893]\r\n\u003e to strings that contain right-to-left characters (i.e., each of\r\n\u003e the six conditions of the Bidi Rule must be satisfied); for\r\n\u003e strings that do not contain right-to-left characters, there is no\r\n\u003e special processing for directionality.\r\n\r\nHowever, I think we may be doing it right and changing it to match the RFC is not entirely advisable because it means usernames that include RTL characters are not consistent with usernames that do not (eg. \"!Username\" is valid, but \"!User\u0026lt;RTLChar\u0026gt;name\" is not valid because the bidi rule does not allow punctuation [category NO] at the beginning of a label). I've written to the working group to see if this should be changed in the draft to match our implementation. I'm not sure if it would be better to go ahead and update to be compliant with the current RFC, or if it would be better to wait and see if the rule changes (or if I'm just completely wrong; someone with more knowledge about this than me will likely reply on the list and explain why it doesn't make sense to apply the bidi rule all the time).\r\n\r\n/cc @mpvl @nigeltao",
	"user": {
		"login": "SamWhited",
		"id": 512573,
		"type": "User",
		"site_admin": false
	},
	"comments": 0,
	"created_at": "2016-10-08T03:48:03Z",
	"updated_at": "2016-10-08T15:11:04Z"
}
