{
	"id": 157824065,
	"body": "I'm not sure this is the right venue for the discussion, but I'm not sure what is.  mersenneforum would have knowledgeable people interested in the subject, but the wrong wording can lead to non-constructive input.\r\n\r\n(1) doing anything other than base 2 means you're deviating from the method that's been tested for 35 years.  It's still a really interesting question though.\r\n\r\n(2) For 64-bit input, using any other base is pointless.  We already know 2+lucas has no counterexamples, and using another base has no speed advantage.  Worse, using another base means we have no verification that there aren't counterexamples.  There are a metric crapton of 64-bit composites, so testing any other base to that depth is unthinkable with current computing resources.\r\n\r\n(3) More than just the number of pseudoprimes, the residue classes are important.  This is what gives the test such strength -- numbers that pass MR(2) fall in classes that rarely pass the Lucas test, and vice-versa.  I suspect your (base | n)=-1 idea will have the same result, but it should be checked.\r\n\r\nI get the same numbers you do for \u003c2^25.  At 2^26 it is 272 for P*P-4, 409 for base 2.  At 2^27 it is 360 for P*P-4, 552 for base 2.  So about 2/3 the number of pseudoprimes.  The intersection of base 2 and base P*P-4 below 2^64 is also 65% vs. base 2 and base 3.\r\n\r\nAddendum: Vastly smaller than 2^64, but still..  I checked the Lucas and ES Lucas pseudoprimes below 10^14, and as expected, no overlap with the base P*P-4 strong pseudoprimes.\r\n\r\n\r\nDepending on your performance/correctness tradeoff, you may want to consider instead leaving the base alone (so any counterexample *must* be a strong BPSW counterexample) and add an additional test:\r\n  - Frobenius on top of the Lucas test (see Crandall and Pomerance), cost 1 M-R.\r\n  - Frobenius-Underwood, cost ~2.5 M-R, basically an efficient way to do a Fermat+Lucas test with differing bases from BPSW.\r\n  - Frobenius-Khashin, cost ~3 M-R (I think).  Simple, not much used.\r\n  - One more M-R base using your method, giving a deterministic test that's at least as strong as Mathematica (quite likely stronger), while only costing one extra M-R.  The total computational cost should be about the same as 4 M-R tests, and if you do both M-R tests first, you're only running the Lucas test on primes and a quite small set of composites.\r\n  - Additional M-R tests.  However you feel makes you happy while keeping performance high.  This is basically what FIPS 186-4 discusses for crypto: running a Lucas test is worth a lot of additional M-R tests.  But this isn't crypto (which brings in additional requirements as well as relaxations).",
	"user": {
		"login": "danaj",
		"id": 125502,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-11-18T19:04:35Z",
	"updated_at": "2015-11-18T19:13:32Z"
}
