{
	"id": 102112981,
	"number": 12228,
	"state": "closed",
	"title": "runtime: performance degradation with Go 1.5",
	"body": "Hello,\r\n\r\nI wrote a program in Go which is a converter program. It parses quiet large HTML files (approx. 1.5MB each) and finds specific sections with the help of the [goquery](https://github.com/PuerkitoBio/goquery) library. Then it saves the individual sections to separate files. Everything is parallelized as much as possible using several worker pools (go routines).\r\nA lot of going on in the program (e.g. some fuzzy searching with the help of [fuzzy](https://github.com/sajari/fuzzy)) and unfortunately I cannot provide the source code because it is not a public project.\r\n\r\nNote: The first line of func main() is:\r\n```go\r\n  runtime.GOMAXPROCS(runtime.NumCPU())\r\n```\r\nso the program utilizes all CPU cores even when compiled with Go 1.4.2\r\n\r\nWhen I run the above described program compiled by Go 1.4.2 then it completes a conversion task (converting several large HTML files) in about 32 seconds. Always.\r\n\r\nWhen I run the exact same program absolutely unmodified but compiled with Go 1.5 it completes the exact same conversion task in about 50 seconds. Always.\r\n\r\nI would call this a severe performance degradation. I can reproduce this every single time I run the converter program.\r\n\r\nPlatform: Windows 7 SP1 (x64)\r\nCPU: Intel Core i7 4770k\r\nRAM: 16GB DDR3\r\n\r\nWhile I cannot provide the source code of my program (it is not public), I did some profiling:\r\n\r\nGo 1.4.2 CPU profile:\r\n![go1.4.2_cpu_profile.png](http://www.tssajo.com/github/go1.4.2_cpu_profile.png)\r\n\r\nGo 1.5 CPU profile:\r\n![go1.5_cpu_profile.png](http://www.tssajo.com/github/go1.5_cpu_profile.png)\r\n\r\nGo 1.4.2 memory profile:\r\n![go1.4.2_mem_profile.png](http://www.tssajo.com/github/go1.4.2_mem_profile.png)\r\n\r\nGo 1.5 memory profile:\r\n![go1.5_mem_profile.png](http://www.tssajo.com/github/go1.5_mem_profile.png)\r\n\r\n(Sorry for providing only screenshots, but I do not know how to redirect output from `go tool pprof` to a file under Windows.)",
	"user": {
		"login": "tssajo",
		"id": 2164104,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 15,
	"closed_at": "2015-08-20T13:29:23Z",
	"created_at": "2015-08-20T10:48:58Z",
	"updated_at": "2016-08-22T18:42:42Z"
}
