{
	"id": 64375857,
	"number": 10248,
	"state": "closed",
	"title": "spec: clarify that \"\"\" is an invalid token",
	"body": "It seems that the Go spec (as of March 20, 2015) allow `\"\"\"` as a string literal, but gc and go/scanner (and I would imagine gccgo) do not treat is as such.\r\n\r\nThe relevant production rules are:\r\n\r\n    interpreted_string_lit = `\"` { unicode_value | byte_value } `\"` .\r\n    unicode_value    = unicode_char | little_u_value | big_u_value | escaped_char .\r\n    unicode_char   = /* an arbitrary Unicode code point except newline */ .\r\n\r\nSo since unicode_char can match `\"` and tokens are \"the longest sequence of characters that form a valid token\", it seems that `\"\"\"` is a potential match.  However, there's also descriptive text to consider.\r\n\r\nRune literals mention \"Within the quotes, any character may appear except single quote and newline.\" so `'''` is invalid.\r\n\r\nRaw string literals mention \"Raw string literals are character sequences between back quotes ``` `` ```. Within the quotes, any character is legal except back quote.\" so ```` ``` ```` is invalid.\r\n\r\nBut interpreted string literals only mention \"The text between the quotes, which may not contain newlines, forms the value of the literal, with backslash escapes interpreted as they are in rune literals (except that `\\'` is illegal and `\\\"` is legal), with the same restrictions.\" which as far as I can tell does *not* forbid unescaped double quotes.\r\n\r\nIt seems like the text should be modified to say something like \"which may not contain newlines *or unescaped double quotes*\".\r\n\r\n\r\nArguably the rule literal text quoted above should also be amended to clarify that single quotes are allowed in escape sequences, otherwise it seems to forbid `'\\''`.  I can sorta see how the wording is meant to suggest that any single character can appear except for those two restrictions, but I think that could be worded more clearly.",
	"user": {
		"login": "mdempsky",
		"id": 38349,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 3,
	"closed_at": "2015-07-23T17:34:47Z",
	"created_at": "2015-03-25T21:21:54Z",
	"updated_at": "2016-08-05T16:09:20Z",
	"milestone": {
		"id": 905105,
		"number": 1,
		"title": "Go1.5"
	}
}
