{
	"id": 51286577,
	"number": 7349,
	"state": "open",
	"title": "go/doc: ToHTML should support headings in non-roman scripts",
	"body": "by **hiroki.ingk**:\n\n\u003cpre\u003eI would like to get support for GoDoc to generate headings for non-alphabetic languages.\n\nI tried generating GoDoc with comments in Japanese language. However, as go/doc.ToHTML()\ntreats only a line beginning with a capital alphabetic letter without punctuation as a\nheading, any Japanese lines are treated as normal paragraphs. So I would like to make\ncomments in Japanese and other non-alphabetic languages available to be judged as\nheadings properly.\n\n\u003ca href=\"http://golang.org/src/pkg/go/doc/comment.go?s=6479:6541#L248\"\u003ehttp://golang.org/src/pkg/go/doc/comment.go?s=6479:6541#L248\u003c/a\u003e\n\nIt is possible to think about some ways to solve it as follows:\n\n  1. Include a language information tag somewhere in the comment and let ToHTML() judge for the corresponding language.\n\n    For example, a GoDoc comment begins like:\n\n    /*\n    \t{\u0026quot;language\u0026quot;, \u0026quot;ja\u0026quot;}\n    \tfmtパッケージは、C言語のprintfおよびscanfに似た機能を持つ、\n    \tフォーマットのためのI/Oを実装します。フォーマットに用いる「動詞」は\n    \tC言語から派生されていますが、より簡素なものになっています。\n\n    While we need to decide a rule for the language tag, heading judgment process will be simple.\n\n  2. Make ToHTML() judge for all supported languages universally\n\n    For example, if we support Japanese, Chinese, and Korean as non-alphabetical languages, all the checks for 3 languages and the current alphabetic script will run.\n \n    While we do not have to make any changes for the current comment format, the performance will be deteriorated as the number of supported languages increases.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "HelpWanted"
		}
	],
	"comments": 13,
	"created_at": "2014-02-18T15:34:15Z",
	"updated_at": "2015-04-14T19:45:22Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	}
}
