{
	"id": 172333156,
	"number": 16819,
	"state": "open",
	"title": "crypto/ecdsa: Source comment contradicts code",
	"body": "1. What did you expect to see?\r\n    A match between comments and code in https://github.com/golang/go/blob/master/src/crypto/ecdsa/ecdsa.go#L152.\r\n\r\n2. What did you see instead?\r\n    https://github.com/golang/go/blob/master/src/crypto/ecdsa/ecdsa.go#L152: \"// Get \u003cb\u003emax\u003c/b\u003e(log2(q) / 2, 256) bits of entropy from rand.\"\r\n\r\n    https://github.com/golang/go/blob/master/src/crypto/ecdsa/ecdsa.go#L154 proceeds to calculate an entropylen of approximately the number of bytes in \u003cb\u003emin\u003c/b\u003e(log2(q) / 2, 256), which differs from the comment describing the intention by selecting the minimum, not the maximum.\r\n\r\nWhich one is the correct amount of entropy? The code seems suspicious by limiting the entropy and hence security level to 256 bits maximum even if a curve with larger potential is used, but it could be motivated by the hash used, SHA512 chopped to 256 bits, which does already impose a limit to the maximum security level.\r\n\r\nIs the comment correct? Since I don't understand the division by two (q is the size of the underlying field in bits and hence the amount of entropy I would expect to want to use), I cannot answer this question and hence cannot propose a fix such as simply changing the code to match the comment or vice versa.\r\n\r\nIt is possible that the motivating idea is that the security level is half the size of the curve's underlying field in bits, and that no more entropy than that makes sense. If correct, then the code makes sense and the comment should be changed to reflect what the code does.",
	"user": {
		"login": "pyramids",
		"id": 4458721,
		"type": "User",
		"site_admin": false
	},
	"assignee": {
		"login": "agl",
		"id": 21203,
		"type": "User",
		"site_admin": false
	},
	"comments": 1,
	"created_at": "2016-08-21T18:13:01Z",
	"updated_at": "2016-08-23T00:05:37Z",
	"milestone": {
		"id": 1748849,
		"number": 42,
		"title": "Go1.8Maybe"
	}
}
