{
	"id": 99714128,
	"number": 12071,
	"state": "closed",
	"title": "cmd/compile: make SSA output more readable",
	"body": "@alandonovan said during GopherCon that we should make our SSA printer amazing, since we're going to spend a lot of time poring over the output. I see more and more how right he was.\r\n\r\nThis issue is to discuss ideas for making the output more readable.\r\n\r\nA few thoughts:\r\n\r\n* I wonder whether we should steal any SSA formatting techniques from Alan's SSA work.\r\n\r\n* A couple of weeks ago I hacked together a dot printer for functions, so you could use graphviz to see the control flow structure, but for all but the simplest functions, it was overwhelming.\r\n\r\n* The main things I have wanted recently are:\r\n\r\n  - the ability to easily see how a function changes over time\r\n  - easy navigation within a function--from a value to its uses, from a block/value mention to its definition, etc.\r\n  - the ability to annotate values/blocks/etc with what I know about them\r\n\r\nPerhaps generating HTML might be a good way to achieve this second goal--javascript and links could maybe help with the navigation challenges. It might also help with the first. For example, if every pass was laid out in a new column, and clicking a value highlighted its definition and uses across all passes, then it might be easier to navigate across time. There is an implementation question here: We'd need to have a notion of value/block identity across passes, which is non-trivial. However, we also need that for other purposes, like generating debug info. As for annotation, ideally all relevant annotation would eventually be automatically inserted, once we know what kinds of things we need to know.\r\n\r\nWhat do you want from an SSA printer? Got ideas?\r\n\r\ncc @randall77 @tzneal @dr2chase @alandonovan \r\n",
	"user": {
		"login": "josharian",
		"id": 67496,
		"type": "User",
		"site_admin": false
	},
	"comments": 6,
	"closed_at": "2016-03-01T21:37:09Z",
	"created_at": "2015-08-07T19:35:09Z",
	"updated_at": "2016-03-01T21:37:09Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	}
}
