{
	"id": 92976665,
	"number": 11586,
	"state": "closed",
	"title": "cmd/compile: transparent, arbitrary, and self-referencing source code filtering",
	"body": "I'm interested in exploring (and maybe coding/contributing) an addition that would allow individual source files to identify their own chain of interpreters (somewhat akin to the sha-bang line of shell scripts).\r\n\r\n```\r\n//!FILTER github.com/Osndok/golang-braces/cmd/go-fix-braces\r\n//!FILTER github.com/DAddYE/igo/cmd/indention-instead-of-braces arg1 arg2\r\n//!FILTER /usr/bin/cpp -Dkey=value - -\r\n//!FILTER /usr/bin/sed -E 's/oneThing/another/g'\r\n\r\nfunc main()\r\n{\r\n    //the rest of the file is normal (with the above filter chain)\r\n}\r\n```\r\n\r\nAs seen in the first two lines, I was thinking that it would not be too hard to call \"go build\" if needed for the additional ease of go's fetch/build magic.\r\n\r\nThe idea being... if anyone:\r\n* is so terribly bothered by any particular/trivial golang design choice that it might exclude them, and\r\n* is a sufficiently advanced programmer to encode the minor difference in a filter\r\n\r\n...then the community at large is probably better off having them \"in\" the golang corner.\r\n\r\nWhat's more... when combined with github, it would provide an easy mechanism for the owners/moderators of golang to gauge what is important to the community (that which they invest time in, and are using) by scanning go repos for an easy-to-match string, and counting/sorting uniques.\r\n\r\nThere are a few major drawbacks, of course, the biggest of which is probably obvious:\r\n\r\n```\r\n//!FILTER rm -rf /some/important/file\r\n```\r\n...which could wreck havoc in build servers (don't build as root!).\r\n\r\nTherefore, presuming this is not something that is desired in this (the upstream repo), I'd be quite content with this issue being closed for an answer to these questions (to whoever knows):\r\n* at a minimum, what points in the source would need the changes/additional code, and\r\n* if developed, what conditions (if any) might allow such a change in the official repo?\r\n",
	"user": {
		"login": "Osndok",
		"id": 80066,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 2,
	"closed_at": "2015-07-04T16:29:32Z",
	"created_at": "2015-07-04T06:17:02Z",
	"updated_at": "2016-07-11T22:38:25Z"
}
