{
	"id": 240790205,
	"body": "To start I have to tell you i'm not native speaker so please forgive me incase I misspell things.\r\n\r\nWhat is required to move this proposal forward? (My ideas):\r\n- Listing counter-proposals\r\n- Listing proposed amendments to the proposal and pro/cons\r\n- Listing pro/cons/observations(exclude the repetition please from above)\r\n- Listing use cases, and which ones are solvable by the the above counter-proposals and amendments\r\n\r\nOthers:\r\n- Looking at aliases in other languages https://github.com/golang/go/issues/16339#issuecomment-240797599 (atdiar)\r\n\r\nIncase the use cases are listed explicitly where everybody can reference them, it might be easier to check whether the one or the other counter-proposal solves it.\r\n\r\nUntil now a lot of progress was made: think of tooling, syntax options, what might be allowed and what prohibited, more use cases came up of which some are not limited to refactoring(splitting monster packages into smaller defined APIs \u0026 co), ramifications for somebody looking at the documentation and the possibility of misuse(any feature can be misused, you do not have to use that library).\r\n\r\nEven connections to semver \u0026 dependency management came up(which allows the developer to break users as often he wishes, consequences included).\r\n\r\nTo me, most of the counter-proposals do focus on only a small number of  use cases, but ignore alot others.\r\n\r\nThe proposed alias feature is not unique to Go.\r\n\r\nTo sum it up: I would like Go to help solve the use cases in the real world and until now arguments are (to me) in favour of aliases being able to help solve them. Change my mind!\r\n\r\nAnd forgive me, a finishing note to address the github voting system:\r\n```\r\nWhat I like about gerrit today is, that you have people to argue with and every blocker gets documented and must include a text explanation for what one is required to do to get a +(2). \r\n\r\nThe Github - is nothing of the sort, no text included to address, so can be a \"I feel like it\" or \"I know this is a bad idea\", it is not possible to address a minus without text.\r\n```\r\n\r\nUse cases\r\n1) gradual transition(https://github.com/golang/protobuf/issues/218#issuecomment-243226760)\r\n\r\nEdit:\r\n-  Added atdiar's idea to look at aliases in other languages\r\n- Reworded cheeky paragraph(sorry!)\r\n\r\nEdit2:\r\n- Added usecase",
	"user": {
		"login": "Limdi",
		"id": 6695283,
		"type": "User",
		"site_admin": false
	},
	"reactions": {
		"total_count": 4,
		"+1": 3,
		"heart": 1
	},
	"created_at": "2016-08-18T17:07:48Z",
	"updated_at": "2016-09-06T18:58:13Z"
}
