{
	"id": 236368945,
	"body": "@davecheney I'm sorry, I think you are being unfair.  People within Google make just many suggestions for changing the language as people outside Google, and they are rejected just as easily.  This is not one Google team that got into trouble.  Any single event like that could be handled with only minor pain.  This is the Go team observing a pattern that arises when refactoring, a pattern that has occurred many times, a pattern that is trivial to deal with in C++ and many other languages but painful to deal with in Go.\r\n\r\nAs others have pointed out above, this is exactly the situation we are in now that have moved golang.org/x/net/context to context.  Functions that take arguments of type `context.Context` can no longer be passed from a package that imports golang.org/x/net/context to a package that imports context, because the two `context.Context` types are not the same.\r\n\r\nAs others have pointed out above, the Go language already supports const aliases, and provides functionality that is equivalent to aliases for funcs and immutable vars.  What we are really talking about there is type aliases.  The proposal describes use cases.  There are people, non-Googlers, who support the general idea.  What are your technical objections to adding type aliases to the language?  I understand objections to the syntax, and objections to a general aliasing capability.  What about type aliases, if we can agree on a usable syntax?\r\n\r\nI also understand that there is a social objection here: Robert is making a proposal that has benefits within Google, while the Go team is seeming to ignore proposals that do not have benefits within Google.  Would it help if I say that there are also people within Google who want multi-dimensional slices?  I haven't taken the time to look (I'm on vacation) but I understand that Robert has worked with the multi-dimensional slice proposal to add a reshaping capability that may address my concerns about changing strides.  We are struggling with that proposal among others; we are not simply ignoring it.",
	"user": {
		"login": "ianlancetaylor",
		"id": 3194333,
		"type": "User",
		"site_admin": false
	},
	"reactions": {
		"total_count": 9,
		"+1": 6,
		"-1": 1,
		"heart": 2
	},
	"created_at": "2016-07-30T14:45:17Z",
	"updated_at": "2016-07-30T14:45:17Z"
}
