{
	"id": 66072403,
	"body": "\u003ca id=\"c7\"\u003e\u003c/a\u003eComment 7 by **xianrenb**:\n\n\u003cpre\u003eSeveral points:\n1. If people could still argue there may be inconsistent coding styles in codes\ngenerated from \"gofmt\", then \"gofmt\" is still not doing a very good job. \"gofmt\" should\nbe a tool to stop all the arguments. The whole community would benefit from a good tool.\n2. If blank line issue are what you guys commented as a minor details of coding style, I\nwould like to see the removal of the action done by \"gofmt\" as described in comment 5.\nFor instance, code would look ugly if only the \"package\" and \"import\" parts are\nseparated by inserting blank lines while keeping other parts unchanged for codes with no\nblank line. Either total control of blank lines or none would be consistent.\n3. As \"package\" and \"import\" parts would be checked and appended blank lines by the\ncurrent \"gofmt\" if needed, I believe adding blank lines to separate code blocks in a\nprogram is considered to be a good coding style. Most programmers would agree and insert\nblank lines in their programs when needed. But what if they miss some of the blank lines\nsomewhere? Currently, they have to verify their code every time carefully before they\ncommit their code. Would a tool that could help automating this job being feasible?\n4. Code generated by \"gofmt\" is not what individuals write but what allows others to\nread. If you guys really follow the original intention of inventing \"gofmt\", you should\ndevelop \"gofmt\" to generate the most readable code. \"gofmt\" should have nothing to do\nwith individuals' coding style. That means it may hurt somebody's feelings if it does\nnot output in the coding style that is same as them, but most go programmers would be\nable to read others' code in a consistent and readable style. However, \"gofmt\" works as\nin point 2 or comment 5, and different programmers could use blank lines in different\nways. Current go programs are probably not in a consistent and readable style! \"gofmt\"\nshould be improved.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2012-11-23T02:21:34Z",
	"updated_at": "2014-12-08T10:23:31Z"
}
