{
	"id": 51277884,
	"number": 1497,
	"state": "closed",
	"title": "Errors in documentation \"Codelab: Writing Web Applications\"",
	"body": "by **damm@google.com**:\n\n\u003cpre\u003eI found a few issues with \u0026quot;Codelab: Writing Web Applications\u0026quot;:\n\nIn section \u0026quot;Handling non-existant pages,\u0026quot; the function signature includes a\nthird parameter, \u0026quot;title string\u0026quot; which is not introduced until later in the\nlast section.  This may be confusing to some readers.\n\nIn section \u0026quot;Template caching,\u0026quot; the code snippet for the init() function is not\nin blockquote source code formatting.\n\nIn section \u0026quot;Validation,\u0026quot; the code block for constructing the regular\nexpression is empty.  I think it is supposed to read:\n\n\u0026quot;\u0026quot;\u0026quot;\nvar titleValidator regexp.Regexp = regexp.MustCompile(\u0026quot;^[a-zA-Z0-9]+$\u0026quot;)\n\u0026quot;\u0026quot;\u0026quot;\n\nbut there currently is nothing in the \u0026lt;pre\u0026gt; tag for that line.\n\nAlso, this is not an error, but it would be circumspect if you could give an example URL\nthat would be dangerous in the \u0026quot;Validation\u0026quot; section.  When I tried to do\nsomething nasty like \u0026quot;\u003ca href=\"http://localhost:8080/view/\"\u003ehttp://localhost:8080/view/\u003c/a\u003e../../../etc/passwd\u0026quot; or\nsimilar, the URL was automatically rewritten to remove all '../' and preceding\ndirectories.  I suppose this is a part of the URL parsing in the http package?  I was\nable to form an attack only by creating more files underneath my tree (or soft-linking\nmy home directory from the go-wiki directory), and even then only when the extension\nmatched the one used for wiki content (which I had changed to .wiki early on).  Even if\nthis is the extent of that possible attack, I agree that it's a good idea to mention it,\nI just think a more specific example might be worthwhile.\n\nGreat tutorial, thanks for providing it!\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "adg",
		"id": 8446613,
		"type": "User",
		"site_admin": false
	},
	"comments": 2,
	"closed_at": "2014-12-08T10:08:36Z",
	"created_at": "2011-02-11T02:16:18Z",
	"updated_at": "2016-06-24T19:25:06Z"
}
