{
	"id": 66093148,
	"body": "\u003ca id=\"c7\"\u003e\u003c/a\u003eComment 7 by **skinner.david**:\n\n\u003cpre\u003eI really do not blame you for not wanting to install all of the\ndependencies for qml to test this one case.\n\nI really do not think it is possible, well I should say practical, to\nprovide a completely stand alone case other that what is presented, at\nleast for me as the problem is that there is a runtime seg fault on startup\nwith incompatible binary C libraries and I do not know or understand why\nthe libraries are not compatible. The true nature of my complaint is that\nit took me several days with GDB (well it was the first time for me to use\nit) to discover that the runtime seg fault on startup was in fact the\nresult of incompatible binary C libraries. I was rather hoping that that\nyou could:\n\n   - Give a link warning that I am trying to use incompatible binary C\n   libraries\n   - Or give an informative runtime error that lets me know that I may\nhave incompatible\n   binary C libraries that are unable to init.\n\nPlease understand that from my initial perspective, the runtime seg fault\non startup was caused by:\n    go get -u\nI think the only reason I had this problem in the first place is that I\nwould rather use other peoples code than write my own so I import a lot of\npackages and only write what I have to. I always felt that to be a good\nprogrammer, you had to be so lazy that you were willing to work all day to\nautomate a one hour job. At any rate, Go makes it easy to import and the\nnumber of packages is increasing, this particular incident is fixed, the\ncurrent versions of these two libraries are now compatible. I am thinking\nthat it is more probable than not that it will happen again, eventually. I\nsuppose I like for my error messages to tell me what I need to do to fix\nthe problem I have created, I am not used to having problems that I did not\ncreate and it really confused me.\n\nI am sorry I cannot help.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-09-18T20:33:40Z",
	"updated_at": "2014-12-08T10:42:38Z"
}
