{
	"id": 170521008,
	"number": 16666,
	"state": "open",
	"title": "x/tools/cmd/godoc: request for richer formatting",
	"body": "Documenting Go code is not fun. At all. That this benefits bad behaviour (:= no/little docs) is obvious.\r\n\r\n1. It's not clear in which path your documentation will be available when running `godoc -http=:6060`. I had to ask in slack to find out it's `localhost:6060/pkg/github.com/foo/bar`. I tried variations like `localhost:6060/github.com/foo/bar` or `localhost:6060/src/github.com/foo/bar` which obviously didn't work.\r\n2. Not having lists around is a real pain. How am I supposed to do something like this:\r\n\r\n  ```\r\n// Package warden decides if access requests should be allowed or denied. In a scientific taxonomy, the warden\r\n// is classified as a Policy Decision Point. The warden's primary goal is to implement `github.com/ory-am/hydra/firewall.Firewall`.\r\n//\r\n// This package is structured as follows:\r\n// * handler.go: A HTTP handler capable of validating access tokens.\r\n// * warden_http.go: A Go API using HTTP to validate access tokens.\r\n// * warden_local.go: A Go API using storage managers to validate access tokens.\r\n// * warden_test.go: Functional tests all of the above.\r\n```\r\n3. It's not clear (to me) how to link from package a to package b and get that working in both godoc.org and with `godoc`.\r\n4. I can't link text.\r\n5. I can't load images.\r\n6. There is no emphasis, I overread important things all the time because I'm too lazy concentrating on 10 lines of plain text when a simple **Note: Don't do this if XYZ** would most certainly solve that.\r\n7. There is no instruction for inheritance, for example when implementing interfaces.\r\n8. No inline `code`.\r\n9. Probably more stuff (feel free to extend) but it's late and I'm tired and frustrated.\r\n\r\nMy suggestion is to have markdown or simple HTML, it would solve almost all of the problems above and a godoc command that actually does what it says: serving the docs of the cwd (and optionally other GOPATH packages too).\r\n\r\nThe issue number (it's a sign) gives me hope that documenting go code will get better soon.",
	"user": {
		"login": "arekkas",
		"id": 3372410,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Thinking"
		}
	],
	"comments": 21,
	"created_at": "2016-08-10T21:16:56Z",
	"updated_at": "2016-09-07T07:31:03Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	},
	"reactions": {
		"total_count": 3,
		"+1": 1,
		"-1": 2
	}
}
