{
	"id": 133979342,
	"body": "Well, I think this is a pretty obvious one if developer experience matters\n\n\u003e On Aug 23, 2015, at 9:09 PM, Dmitri Shuralyov \u003cnotifications@github.com\u003e wrote:\n\u003e \n\u003e I don't want to add more special cases to cmd/go.\n\u003e \n\u003e I agree. I would prefer changing the newly added (and still experimental) GO15VENDOREXPERIMENT to use the existing rules of go tool, for example by using the folder name /_vendor/.\n\u003e \n\u003e I think between the two, it's only acceptable option, given that GO15VENDOREXPERIMENT is still an experiment and it's meant to be opt-in. Using a folder /vendor/ means it's not opt-in for tools that are unaware it's actually a special folder when GO15VENDOREXPERIMENT=1 is set.\n\u003e \n\u003e Normally when you're working on one package, you don't need to test\n\u003e everything, only the actually affected packages. Using ./... is pretty\n\u003e overkill.\n\u003e \n\u003e Most of my personal repositories contain 1-6~ Go packages. Depending on the exact project, they may be direct subfolders in the git repo root, or they may be a few levels deep. So, when I'm in the repo root of a random project github.com/shurcooL/randomfoo, I really appreciate the ability to do things that affect all Go packages inside that folder (since they're all related to the project I'm working on), rather than having to remember individual Go packages and run commands on them individually (waste of my time, plus risk of forgetting some Go package).\n\u003e \n\u003e In fact, the ... pattern matching is one of my favorite aspects of the go command and I use/rely on it daily, upwards of hundreds of times. I don't think I abuse it, I think I use it to a great benefit. Without it, I would feel like I'm back in C++ land where I have to write Makefiles that explicitly list subfolders in a given project.\n\u003e \n\u003e —\n\u003e Reply to this email directly or view it on GitHub.\n\u003e \n",
	"user": {
		"login": "pkieltyka",
		"id": 18831,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-08-24T01:14:07Z",
	"updated_at": "2015-08-24T01:14:07Z"
}
