{
	"id": 246924871,
	"body": "@mholt \r\n\r\n\u003e What do you mean by this? nginx isn't any more \"frontend-hardened\" than Go is, unless you configure it a bunch. Go is the same way, but it is certainly production-ready.\r\n\r\nWhat exactly is the point in linking to that? If your point is that `dl.google.com` uses it: [Does it, though](https://talks.golang.org/2013/oscon-dl.slide#7)? @bradfitz knows better, this might well be an exception, but from what I know about the Google Architecture (and that slide I linked to kinda confirms it), almost all services there are sitting behind a reverse proxy, which terminates the TLS connection.\r\n\r\n\u003e What official communication?\r\n\r\nFor example [this](https://github.com/golang/go/issues/3930#issuecomment-66069129), by one of the central people in implementing it. There have been similar communications before, on go-nuts, in issues, on reddit…\r\n\r\n\u003e What defines well-vetted?\r\n\r\nI'd say that if the people who wrote the tls stack calls it \"basically unreviewed\", then that's a good indication that, no matter where you draw the line, this doesn't pass it.\r\n(or rather: Didn't pass it in the past. All of this might've changed, but that was one of the points of my question: *has* it changed?)\r\n\r\n\u003e Go's crypto/tls package has had much fewer vulnerabilities than OpenSSL has\r\n\r\nThat is a fallacy. Go's `crypto/tls` package has had much fewer vulnerabilities *disclosed* than OpenSSL has. It also had much fewer people reading and vetting it (it's used by fewer people, so fewer companies have incentive to vet it and academia has less incentive as the impact is lower). If I were to write a TLS implementation, it would have zero vulnerabilities disclosed. Doesn't make it secure.\r\n\r\n---\r\n\r\nAll of this, however, really is a tangent. I am not trying to argue that people *shouldn't* use go's TLS implementation. I'm merely asking whether it is considered secure enough for production use *right now*, i.e. whether the go team now thinks that it should be used.",
	"user": {
		"login": "Merovius",
		"id": 720787,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-14T07:06:42Z",
	"updated_at": "2016-09-14T07:06:42Z"
}
