{
	"id": 51281992,
	"number": 4341,
	"state": "open",
	"title": "image/jpeg: correct for EXIF orientation?",
	"body": "\u003cpre\u003eJPEG files can embed EXIF metadata specifying one of 8 mirroring+rotation options.  Only\n2-3 of these are in common use, from people holding their phones sideways when taking\npictures.\n\nIt would be nice of the image/jpeg package could, perhaps optionally, correct for these.\n\nCamlistore will be doing it on its own, but it seems like something the image/jpeg\npackage is in a good position to do automatically.\n\nIt's probably only safe to do the left-90 and right-90 ones automatically (and only when\nwidth \u0026amp; height change), so users can detect whether the operation has already been\ndone and not apply the transformation again, as orientation-fixing code has to do anyway\n(because you can't trust whether upstream software in the wild fixed the metadata for\nyou when it flipped-and-resaved the image, so you also have to check the before \u0026amp;\nafter dimensions).\n\nIf we want to do this in image/jpeg, I've attached a screenshot of the 8 modes and a\ntarball of 16 JPEG files: 1 for each mode without EXIF, and 1 for each mode with the\nOrientation field set to \u0026quot;fix\u0026quot; the image back to a lowercase eff letter.  The\nf files are written on 8x8 pixel boundaries, so we can do pixel-wise compares in tests\nsafely.\u003c/pre\u003e\n\n\n\n\n\nAttachments:\n\n1. \u003ca href=\"https://storage.googleapis.com/go-attachment/4341/0/exif-orientations.png\"\u003eexif-orientations.png\u003c/a\u003e (22969 bytes)\n1. \u003ca href=\"https://storage.googleapis.com/go-attachment/4341/0/f.tar\"\u003ef.tar\u003c/a\u003e (30720 bytes)",
	"user": {
		"login": "bradfitz",
		"id": 2621,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Thinking"
		}
	],
	"comments": 15,
	"created_at": "2012-11-04T15:00:00Z",
	"updated_at": "2015-04-14T19:45:18Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	},
	"reactions": {
		"total_count": 1,
		"+1": 1
	}
}
