{
	"id": 66094154,
	"body": "\u003ca id=\"c6\"\u003e\u003c/a\u003eComment 6:\n\n\u003cpre\u003eI tried adding 'filetype plugin indent on' before 'filetype off', and it also fixes the\nproblem.\nHowever, that way there's first filetype plugin on, then filetype plugin off, followed\nby filetype plugin on again. Which doesn't feel quite ok.\n\nI tried removing the 'filetype plugin indent off' instead, which also fixes the problem.\nThe documentation on filetype says:\nfiletype off will turn off filetype detection, but leave plugin and indent unchanged\nfiletype plugin indent off will turn off plugin and indent, and leave detection unchanged\nfiletype plugin indent on will turn on plugin, indent and detection\n\nThe documentation also says:\n-- start\nTo disable file type detection, use this command: \u003e\n\t:filetype off\nThis will keep the flags for \"plugin\" and \"indent\", but since no file types\nare being detected, they won't work until the next \":filetype on\".\n-- end\n\nIt even says:\n-- start\nThe file types are also used for syntax highlighting.  If the \":syntax on\"\ncommand is used, the file type detection is installed too.  There is no need\nto do \":filetype on\" after \":syntax on\".\n-- end\n\nSo from this I'm concluding that 'filetype plugin indent off' is really unnecessary, and\nso syntax on is unnecessary as well.\n\nLooking into the vim-pathogen (I really meant vim-pathogen instead of vim-fugitive\nabove..) plugin source, there's this utility function called after loading each plugin:\n  if exists('g:did_load_filetypes')\n    filetype off\n    filetype on\n  endif\n\nWhich leaves me wondering what you're supposed to put in your .vimrc, and what in the\nspecific bundle: syntax on looks like a user preference, rather than what a bundle would\nchoose for you. But anyhow, that's beside the point here.\n\nTL;DR\nfiletype off\n -- change runtimepath\nfiletype on\nshould suffice, but last line could be what is there now (filetype plugin indent on and\nsyntax on), if you really want to make sure filetype detection, plugin and indent are\nall on, and syntax is being highlighted.\u003c/pre\u003e",
	"user": {
		"login": "jagij",
		"id": 869937,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-04-26T19:25:59Z",
	"updated_at": "2014-12-08T10:43:40Z"
}
