{
	"id": 129181134,
	"number": 14117,
	"state": "open",
	"title": "gccgo, doc:  comments on doc/install/gccgo for gcc release 6",
	"body": "I know that it is likely that some changes are planned for golang.org/doc/install/gccgo for the release of gcc 6.  Here are a few comments/suggestions on this page.\r\n\r\nWith the changes to split stack support in gccgo for gcc release 6, it no longer required to use --with-ld on the configure option (and probably better not to? maybe both methods should be described).  In gcc 6, if the gold linker is found in the PATH when gcc is configured, then it will be used as the linker for gccgo, as required for split stack.\r\n\r\nAlso, split stack is now implemented for PowerPC64 big and little endian in addition to x86.\r\n\r\nOn the section describing how to build gccgo, another way to get gcc source is from the weekly snapshots or releases from the various mirrors for GNU GCC found here https://gcc.gnu.org/mirrors.html.  This is much faster than using svn to get the source.\r\n\r\nWhen describing the setting of the LD_LIBRARY_PATH, the paths used are not correct based on the systems I've looked at (ppc64le \u0026 x86).  The shared libraries are found under ${prefix}/lib64 or ${prefix}/lib, so that is the path needed for LD_LIBRARY_PATH or when setting the runpath with the -W option.\r\n\r\nThe example showing -gccgoflags should have the options within quotes.\r\n\r\nIt would be nice to see something that mentions the use of the go tool built for gccgo and how it is preferred over using gccgo directly or the go tool from golang with the -compiler option.  When using the go tool built for gccgo, then using 'go version' displays version information about gccgo.  Also, if 'go build' is used to build an application with build tags then it matches against the tags for gccgo as expected.  When using the go tool from golang with the -compiler option, the build tags are matched against the golang values and not the gccgo values.\r\n\r\n\r\n",
	"user": {
		"login": "laboger",
		"id": 9433228,
		"type": "User",
		"site_admin": false
	},
	"comments": 1,
	"created_at": "2016-01-27T15:43:12Z",
	"updated_at": "2016-01-27T17:26:57Z",
	"milestone": {
		"id": 1069171,
		"number": 23,
		"title": "Gccgo"
	}
}
