{
	"id": 51287276,
	"number": 7834,
	"state": "closed",
	"title": "spec: scope and re-use of loop variables is not fully specified",
	"body": "\u003cpre\u003eFor \u0026quot;for\u0026quot; statements, the spec only partially covers the scope and reuse of\nvariables declared with a short variable declaration, as well as for the use of existing\nvariables.\n\nWhen using the `range` keyword, the spec says that \n\n„The iteration variables may be declared by the \u0026quot;range\u0026quot; clause using a form\nof short variable declaration (:=). [...] and their scope ends at the end of the\n\u0026quot;for\u0026quot; statement; they are re-used in each iteration. If the iteration\nvariables are declared outside the \u0026quot;for\u0026quot; statement, after execution their\nvalues will be those of the last iteration“\n\nAll of these statements are also true for \u0026quot;for\u0026quot; statements that use a\nForClause, that is `for i := 0; i \u0026lt; N; i++`, but the spec does not explicitly mention\nthis. \n\nThe section on \u0026quot;Short variable declarations\u0026quot; does say that \n\n„In some contexts such as the initializers for \u0026quot;if\u0026quot;, \u0026quot;for\u0026quot;, or\n\u0026quot;switch\u0026quot; statements, they can be used to declare local temporary variables“\n\nbut \u0026quot;local temporary variables\u0026quot; is vague and only covers the fact that their\nscope ends at the end of the \u0026quot;for\u0026quot; statement; it does not say anything about\nthe variables' re-use. And obviously it doesn't cover the use of variables that are\ndeclared outside the \u0026quot;for\u0026quot; statement.\n\nI propose to split the first quoted paragraph into two: One that's general to the\n\u0026quot;for\u0026quot; statement itself, and one that only covers the bits that are specific to\nthe use of \u0026quot;range\u0026quot;.\u003c/pre\u003e",
	"user": {
		"login": "dominikh",
		"id": 39825,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Documentation"
		},
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 5,
	"closed_at": "2014-12-08T10:43:26Z",
	"created_at": "2014-04-22T03:02:34Z",
	"updated_at": "2016-06-25T01:32:46Z",
	"milestone": {
		"id": 1067218,
		"number": 21,
		"title": "Go1.4"
	}
}
