{
	"id": 51284737,
	"number": 6141,
	"state": "closed",
	"title": "go.tools/go/types: known issues catch-all",
	"body": "\u003cpre\u003eThis issue serves as a catch-all for the currently known issues with go/types so that\nthey don't get forgotten.\n\nKnown bugs (in addition to already filed bugs):\n- Corner-case legal recursive structs and interface types may not be accepted. The\ntype-checker must not rely on those types' structure before the types are completely\ndefined.\n\nMissing features:\n- Some built-ins don't check parameters fully, yet (e.g. append).\n- Use of labels is only partially checked.\n- Unused variables and imports are not reported.\n- Interface vs non-interface comparisons are not correctly implemented.\n- Switch statements don't check duplicate cases for all types for which it is required.\n- Some built-ins may not be callable if in statement-context.\n- The reported signature for builtin \u0026quot;expressions\u0026quot; should be a *Signature\nspecialized for the given arguments.\n\nAPI:\n- Type and Method factory functions need to revisited and all properly documented. There\nis a balance between external need and desire to protect internal invariants in case of\nAPI misuse.\n- Decide if gcimporter should be in separate package.\n\nOptimizations:\n- Method sets should always compute the sets for both pointer and value receiver types\nand cache them. Will avoid repeated and expensive method set computation.\n- Method sets should be used for some of the assignment checks where\n\u0026quot;implements\u0026quot; functionality is needed.\n\nCleanups:\n- Type-checking of expressions should be cleaned up. There is duplication in the code\nthat can be avoided. See the relevant TODOs.\u003c/pre\u003e",
	"user": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 3,
	"closed_at": "2014-12-08T10:33:48Z",
	"created_at": "2013-08-14T01:05:08Z",
	"updated_at": "2016-06-24T22:55:09Z"
}
