{
	"id": 227047154,
	"body": "Thank you for answer.\r\nStill some comments:\r\n\r\nMe wrote:\r\n\r\n\u003e\u003e The same as declared the class members (inside a class name { }).\r\n\r\nYou answer me:\r\n\r\n\u003e\u003e It's too easy to scroll away from the line func (*foo) and forget that you're looking at a method on *foo, not just a function Bar() bool.\r\n\r\nMy question.\r\nDon't you think that: It's too easy to scroll away from the line `class ClassFoo` and forget that you're looking at a method on `ClassFoo`, not just a function `Bar()` bool ?\r\n\r\nYou answer me:\r\n\r\n\u003e\u003e It's too easy to scroll away from the line func (*foo) and forget that you're looking at a method on *foo, not just a function Bar() bool.\r\n\r\nMy answer.\r\nNo. Because they will have different syntax.\r\nPlease compare (after formatting):\r\n\r\n```go\r\n// Function\r\nfunc Foo() bool {\r\n}\r\n\r\n// Single method\r\nfunc (f *foo) Foo() bool {\r\n}\r\n\r\n// Multiple methods\r\nfunc (f *foo) (\r\n  Foo() bool {\r\n  }\r\n\r\n  Baz() bool {\r\n  }\r\n)\r\n```\r\n\r\nThe big diferrence is in that the \"fun (* receiver)\" are always ommited.\r\n1. That is the judgement `forget that you're looking at a method on *foo, not just a function Bar() bool` is not true because each function starts with \"func\" but here we cannot see it.\r\n2. Also, after formatting, each method start after some indentation because it are inside some `block` of identical declarations, and of course, as I can wrote below, member of parenthesized method declarations ommited redundant and repeated part which is `func *receiver`.\r\n3. I don't propose the `parenthesized function declarations` in addition (because this is unnecessary since they don't have an owner), only methods with their owners can be (and should be for the better readabilty, siimilar to class members declarations) groupped and daclared inside a parenthesized declaration of `methods of the same receiver`.\r\n\r\nP.S.\r\nSorry me, but I never think that inside a class declaration I can to forget abou that the I am inside a (so callled) `class body.` At least an different indentation level (of method, function beginning) says me that I am not inside a static function which always starts at the first column of the line.\r\n\r\nAnd again, thank you very much for your (not always correct) explanations.",
	"user": {
		"login": "mezoni",
		"id": 2311549,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-06-20T04:14:24Z",
	"updated_at": "2016-06-20T04:15:36Z"
}
