{
	"id": 66082261,
	"body": "\u003ca id=\"c1\"\u003e\u003c/a\u003eComment 1 by **ryan@rmarcus.info**:\n\n\u003cpre\u003eWell, I intended to submit a proper patch through the code review system, but I've\ndiscovered that neither the Mercurial extension nor upload.py is capable of using an\nSSL/HTTPS proxy, at least on my Windows system. Seems like a known issue:\n\u003ca href=\"https://groups.google.com/forum/#\"\u003ehttps://groups.google.com/forum/#\u003c/a\u003e!topic/codereview-discuss/jlHrlKML-Ks\n\nAttempting to use the web entry form was a hilarious experience. The complete lack of\ndocumentation, multiple \"golang\" repositories (is the images \"subrepo\" included?), and\nzero explanation of how to create a patch file or specify a base seems to indicate that\nif you can't use the plugin or upload.py, you're SOL. I did, of course, attempt to\nupload a diff created by HG, and got the error: \"Patch set contains no recognizable\npatches.\"\n\nI already had to mess with code outside the scope of my job to get 16-bit TIFF decoding\nworking... I don't think I can muster the willpower to mess with code to get that code\nreviewed. Frustration has overtaken my desire to contribute. Please excuse my\ndisenfranchisement. \n\nSo here's an HG bundle from revision 13 to revision 14, which contains my fix and some\ntests. The reader.go file in the original issue report also works.\n\nI'm also attaching the raw diff file that HG generated, in case someone can't the bundle\nto work.\n\nI wish I could've contributed to the codebase, but hopefully someone looking for 16-bit\ngrayscale TIFF support will find this.\n\nI should also mention my original request and discussion of this on go-lang nuts:\n\u003ca href=\"https://groups.google.com/forum/#\"\u003ehttps://groups.google.com/forum/#\u003c/a\u003e!topic/golang-nuts/AG6lCHLdvFQ\u003c/pre\u003e\n\n\n\n\n\nAttachments:\n\n1. \u003ca href=\"https://storage.googleapis.com/go-attachment/5866/1/16bitpatch.diff\"\u003e16bitpatch.diff\u003c/a\u003e (886187 bytes)\n1. \u003ca href=\"https://storage.googleapis.com/go-attachment/5866/1/16bittiff.bundle\"\u003e16bittiff.bundle\u003c/a\u003e (647200 bytes)",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-07-11T19:35:06Z",
	"updated_at": "2014-12-08T10:32:15Z"
}
