{
	"id": 66065525,
	"body": "\u003ca id=\"c22\"\u003e\u003c/a\u003eComment 22 by **rahul.chaudhry**:\n\n\u003cpre\u003eThanks for your comments.\n\nYour API recommendations make this much simpler. No exported API from package runtime,\nand a linux (and seccomp) specific API in go.sys package. I'll update the doc to reflect\nthese changes.\n\nI also agree that we should start with an implementation that requires SYS_CLONE to be\nwhitelisted. This will make the runtime support for the implementation much simpler as\nwell.\n\nHowever, for the longer term, and from sandboxing point of view, we should still\nconsider the option of working with a strictly limited number of threads in the runtime.\nQuoting from the reporter of this issue above: \"clone(2) will likely be disabled by any\nself-respecting seccomp policy\". Moreover, read() and write() will probably need to be\nwhitelisted by most seccomp policies. If excessive file IO from a sandboxed program may\nresult in the creation of an arbitrarily large number of system threads, it is not a\nvery effective scheme for sandboxing.\n\nI was under the impression that the runtime already supports this mode (simply block on\nblocking system calls if no more threads can be created). Now I see that it causes the\nprogram to crash if the number of threads exceeds the threshold set by\nruntime/debug/SetMaxThreads().\n\nFor my curiosity, is the model of working with a strictly limited number of threads\nfundamentally incompatible with the Go semantics? My understanding is that it is\npossible to have a fully compliant Go compiler and runtime system that does not use any\nmulti-threading capabilities of the operating system it is running on (and does not have\nto resort to interpreting either). In other words, using a different system thread for\nevery blocking system call is an optimization in the runtime, and not a requirement for\na correct Go implementation. Please correct me if I'm wrong.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-09-09T19:20:57Z",
	"updated_at": "2014-12-08T10:17:46Z"
}
