{
	"id": 218567725,
	"body": "\r\nI was running out of connections because they were stuck in time_wait after being closed (which shouldn’t happen with keep-alive). The issue was noticed by our systems guys. A few months ago we had about a huge drop in performance on production servers after upgrading to a new version of our Go-based server. The connections are dropped between the server and haproxy; not by the browser (although haproxy could be eliminated to simplify the testing environment). Connection counts between haproxy and the server are usually very small and static on our other servers.\r\n\r\nThe breakage ended up being a design change to return significantly more 204 codes, which was never suspect. I just spent over a week tackling this problem. Setting content-length to 0 fixed the performance in test environments, but has not been pushed into production yet.\r\n\r\nIn my test environment, using ab for the load, within a few seconds, netstat would be reporting about 64k. Then we’d start seeing errors and performance drop. If I continually refresh from Chrome, I can raise that number as well, just not as high because how many times can you refresh one browser within 60 seconds?\r\n\r\nAfter my “fix”, I was able to throw that ab test at out server, 6x in separate processes, and the netstat command would always report 600 just as I would expect.\r\n\r\nAnyway, I just figured I’d let you guys know so that someone else doesn’t spend another week on the same issue.\r\n\r\nThanks\r\ndw\r\n\r\n\r\n\r\n--\r\nDave White\r\nSenior Software Engineer\r\nRAKUTEN marketing\r\n\r\n6985 S Union Park Center, Suite 300 | Salt Lake City | UT | 84047\r\nDavid.White@rakuten.com | rakutenmarketing.com\r\n\r\nRakuten Marketing\r\n\r\nAFFILIATE NETWORK • ATTRIBUTION • DISPLAY • SEARCH\r\n–––––––––––––––––––––––––––––––––––––––––––––––––––\r\n\r\n!SAVE THE DATE!\r\nSYMPOSIUM SAO PAULO SEPTEMBER 1\r\nSYMPOSIUM SYDNEY SEPTEMBER 24\r\n–––––––––––––––––––––––––––––––––––––––––––––––––––\r\n\r\nConfidential Information (C) Copyright 2015 Rakuten Marketing, LLC. All rights reserved.\r\nThis message is intended only for the use of the Addressee and may contain information that is PRIVILEGED and CONFIDENTIAL.\r\nIf you are not the intended recipient, dissemination of this communication is prohibited. If you have received this communication in error,\r\nplease erase all copies of the message and its attachments and notify us immediately by replying to sender.\r\n\r\nFrom: Brad Fitzpatrick\r\nReply-To: golang/go\r\nDate: Wednesday, May 11, 2016 at 1:25 PM\r\nTo: golang/go\r\nCc: David White, Author\r\nSubject: Re: [golang/go] StatusNoContent closing connections (#15647)\r\n\r\n\r\nI just tested this by hand and don't see a problem.\r\n\r\nI think you're counting the wrong thing if you're counting connections in TIME_WAIT.\r\n\r\n—\r\nYou are receiving this because you authored the thread.\r\nReply to this email directly or view it on GitHub\u003chttps://github.com/golang/go/issues/15647#issuecomment-218562866\u003e\r\n",
	"user": {
		"login": "Dave-White-Rakuten",
		"id": 13006412,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-05-11T19:42:40Z",
	"updated_at": "2016-05-11T19:42:40Z"
}
