{
	"id": 218583629,
	"body": "\r\nThere’s no confusion. One is being used to observe the effects of the other.\r\n\r\nThat TIME_WAIT count can be used to view the number of connections that were recently used and are now in a wait state (where they will generally remain for about 60 seconds before they can be reused).\r\n\r\nKeep-alive is a request to reuse an established connection for subsequent requests. You will see very few TIME_WAIT states under heavy load by few connections if those connections are being properly reused as requested.\r\n\r\nUnder load, if connections are forcibly closed after each response, you will see a rapid rise in the TIME_WAIT count. Soon there will be no connections available to Accept().\r\n\r\nIf you send a request using keep-alive, which receives a 204 response, the connection will be closed UNLESS a content-length is specified. This behavior makes no sense because by definition a 204 response will not contain any content.\r\n\r\n\r\n\r\n\r\n--\r\n\r\nDave White\r\nSenior Software Engineer\r\nRAKUTEN marketing\r\n\r\n6985 S Union Park Center, Suite 300 | Salt Lake City | UT | 84047\r\nDavid.White@rakuten.com | rakutenmarketing.com\r\n\r\nRakuten Marketing\r\n\r\nAFFILIATE NETWORK • ATTRIBUTION • DISPLAY • SEARCH\r\n–––––––––––––––––––––––––––––––––––––––––––––––––––\r\n\r\n!SAVE THE DATE!\r\nSYMPOSIUM SAO PAULO SEPTEMBER 1\r\nSYMPOSIUM SYDNEY SEPTEMBER 24\r\n–––––––––––––––––––––––––––––––––––––––––––––––––––\r\n\r\nConfidential Information (C) Copyright 2015 Rakuten Marketing, LLC. All rights reserved.\r\nThis message is intended only for the use of the Addressee and may contain information that is PRIVILEGED and CONFIDENTIAL.\r\nIf you are not the intended recipient, dissemination of this communication is prohibited. If you have received this communication in error,\r\nplease erase all copies of the message and its attachments and notify us immediately by replying to sender.\r\n\r\nFrom: Brad Fitzpatrick\r\nReply-To: golang/go\r\nDate: Wednesday, May 11, 2016 at 2:02 PM\r\nTo: golang/go\r\nCc: David White, Author\r\nSubject: Re: [golang/go] StatusNoContent closing connections (#15647)\r\n\r\n\r\nI think you're confusing the relationship between TIME_WAIT and HTTP keep-alives.\r\n\r\nWhat exactly do think Go is doing wrong? I see connections in TIME_WAIT regardless of HTTP keep-alive-vs-not and regardless of 204-vs-200.\r\n\r\n—\r\nYou are receiving this because you authored the thread.\r\nReply to this email directly or view it on GitHub\u003chttps://github.com/golang/go/issues/15647#issuecomment-218572734\u003e\r\n",
	"user": {
		"login": "Dave-White-Rakuten",
		"id": 13006412,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-05-11T20:41:26Z",
	"updated_at": "2016-05-11T20:41:26Z"
}
