{
	"id": 146935502,
	"number": 15196,
	"state": "open",
	"title": "crypto/x509: Adding Name Constraints",
	"body": "I would like to request for the adoption of change [3230 ](https://go-review.googlesource.com/#/c/3230/ )which is in code review for a long time.\r\n\r\n\u003e This change extents the Name Constraint properties by adding the Excluded property for DNSDomains and both the permitted and excluded properties for EmailDomains, IPAddresses and DirectoryNames as specified for the GeneralName property in RFC5280.\r\n\u003e \r\n\u003e The selected properties are required to create or validate a fully constrained certificate.\r\n\u003e \r\n\u003e The change also improves the validation of Name Constraints in general and allows the parsing of certificates that have Name Constraints marked as cirtial.\r\n\r\nhttps://go-review.googlesource.com/#/c/3230/ \r\n\r\nChange-Id: Idaa7abafec372d5eb444cad7ee2ea5794aee3424\r\n\r\nTo be able to validate all certificates issued according to the CA / Browser Forum Baseline Requirements the full set of name constraints need to be available in GO.\r\n\r\nA recent version of the CA / Browser Forum Baseline Requirements states that Technical Constraints in Subordinate CA Certificates MUST be applied via Name Constraints. To support strong and strict certificate path validation and to allow users to see the actual constraints it's important that GO supports the required Name Constraints.\r\n\r\nSection 9.7 of the baseline requirements states:\r\n\r\n\u003e \"If the Subordinate CA Certificate includes the id-kp-serverAuth extended key usage, then the Subordinate CA Certificate MUST include the Name Constraints X.509v3 extension with constraints on dNSName, iPAddress and DirectoryName as follows:-\"\r\n\r\nThe full requirements can be found on: https://cabforum.org/baseline-requirements-documents/\r\n\r\nThe DirectoryName is also needed in some Microsoft environments. Forbidding all directory names would enforce domain validated certificates even if all certificates under a specific root are used and issued by the same organisation. Or could enforce all certificates to be issued with the same OV certificate details. Email addresses are not specifically handled by the CABForum because they don't cover client auth or s/mime certificates currently but likely to have the same requirements and make the set of constraints supported complete.\r\n",
	"user": {
		"login": "vanbroup",
		"id": 722070,
		"type": "User",
		"site_admin": false
	},
	"assignee": {
		"login": "agl",
		"id": 21203,
		"type": "User",
		"site_admin": false
	},
	"comments": 2,
	"created_at": "2016-04-08T13:54:02Z",
	"updated_at": "2016-04-11T11:52:38Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	},
	"reactions": {
		"total_count": 3,
		"+1": 3
	}
}
