{
	"id": 166950451,
	"body": "@rthornton128\r\nThank you very much for your comment.\r\n\r\nThe Copy function is not needed at all and should not be used.\r\nI just though that the user would find the information about '=' operator more easily there.\r\nThe comment says that '=' should be used instead.\r\nIf this dummy Copy function was removed, this comment must be put somewhere else and would be more difficult to find.\r\nBut I agree this is debatable, and I will think about removing this dummy Copy.\r\n\r\n\r\nFor all the rest, I absolutely agree with you on everything.\r\n\r\nThe problem is that this package is just a thin wrapper around the C decNumber library.\r\nBut I understand now that this fact is too much visible to the user.\r\n\r\nFor instance, I agree that ToInt32/FromInt32 are unnecessary, but the underlying C decNumber package has functions that convert directly to/from int32, but not to/from int64.\r\nI perform the conversion to/from int64 by making an intermediate conversion to string, which is less efficient.\r\nSo, it is better to use ToInt32/FromInt32 if possible.\r\nI have added some comment to emphatize this.\r\n\r\nDecNumMacros, DecNumVersion, QuadToString are needed for those who want to experiment with the underlying C decNumber library.\r\nIn particular, QuadToString calls directly the C function QuadToString of the original decNumber library, and I wanted to provide this original function.\r\nBut as I don't like it, I have written AppendQuad and String (which just calls AppendQuad and converts the result to string) to have the number formatted like I want, with less use of the exponential notation.\r\n\r\nI wanted to keep access to the API of the original C decNumber library as direct as possible, so that experimenting with it is more easy, and so that reading the original documentation is easier too.\r\nThat's why the functions in this Go package follows the same naming as in the original C decNumber library.\r\n\r\nBut there is really a need for a pure Go implementation, which API should integrate all your recommendation.\r\n",
	"user": {
		"login": "rin01",
		"id": 9582469,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-23T17:29:46Z",
	"updated_at": "2015-12-23T17:29:46Z"
}
