{
	"id": 76592569,
	"number": 10865,
	"state": "closed",
	"title": "cmd/go: go help build incorrectly describes behaviour of flag -o",
	"body": "The help for go build doesn't correctly describe what the effect of `-o` has on the output file (if any). It also seems internally inconsistent.\r\n\r\nFrom experimenting on the command line `-o /tmp/foo` will produce an object file when building non-main packages iff the package is somewhere in goroot or a gopath. Specifically running `go build -o /tmp/foo` at the directory:\r\n\r\n  1. $GOROOT/src/fmt – object file created\r\n  2. $GOPATH/src/golang.org/x/net/context – object file created\r\n  3. /tmp/my_binary (containing `package main` main.go) – binary file created\r\n  4. /tmp/my_pkg (contain `package foo` foo.go) – **no** file created\r\n\r\nFurther, the output of `go help build` seems to contradict itself. It first states that the results will be discarded for anything other than a single package main. The next paragraph then describes what the output file name will be for non-main packages if no other name is specified.\r\n\r\n\u003e When the command line specifies a single main package,\r\nbuild writes the resulting executable to output.\r\nOtherwise build compiles the packages but discards the results,\r\nserving only as a check that the packages can be built.\r\n\r\n\u003e The -o flag specifies the output file name. If not specified, the\r\noutput file name depends on the arguments and derives from the name\r\nof the package, such as p.a for package p, unless p is 'main'. If\r\nthe package is main and file names are provided, the file name\r\nderives from the first file name mentioned, such as f1 for 'go build\r\nf1.go f2.go'; with no files provided ('go build'), the output file\r\nname is the base name of the containing directory.\r\n",
	"user": {
		"login": "okdave",
		"id": 1091335,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "okdave",
		"id": 1091335,
		"type": "User",
		"site_admin": false
	},
	"comments": 4,
	"closed_at": "2015-08-03T20:00:16Z",
	"created_at": "2015-05-15T04:47:22Z",
	"updated_at": "2016-08-05T16:09:38Z",
	"milestone": {
		"id": 905105,
		"number": 1,
		"title": "Go1.5"
	}
}
