{
	"id": 168238452,
	"body": "@kardianos You noted the _\"two design preferences\"_. I think it's important that the design not be a matter of preference but one that solves the needs captured in writing (commonly called requirements, use cases, etc). Requirements should be able to be solved in more than one way (hopefully). What I have not seen is you talk about [the requirements](https://github.com/mattfarina/pkg/tree/master/use_cases) I've collected and how your design can be used to meet those. Or, that a requirement is invalid and a reasoned case why. If I believed the need was clearly defined and met in this design I would not push back and ask do many questions.\r\n\r\nIn this discussion numerous technical questions have been raised that need to be solved in one form or another but gone unanswered. If you have a way to do it utilizing this spec please share. For example, how do you do vulnerability analysis and reporting (e.g., CVEs) without version numbers?\r\n\r\nYou noted things that are not valid in a new paradigm when it comes to requirements. I'm quite familiar with the idea of paradigm shifts and helping people overcome them. What new paradigm is here over the previous ways and how does something here overcome an old problem, old solution, or old need and why?\r\n\r\nTo do this well we need to have a technical design that meets needs. If you're not interested in discussing needs, how to handle situations, and listening to the needs other have how can you craft or advocate for a spec that affects this space?\r\n\r\nI'm giving you every opportunity to answer technical concerns, show me a new concept, share how a requirement is no longer or need, or anything else. If you have something new, innovative, or an insight that no one else has found please teach us. If you can't show us how to solve the issues, fill the needs, and handle cases beyond those you may personally encounter than we have a problem. The group who is here listening is open to new ideas, to having their minds changed, and is often on the forefront of those kinds of things. We're listening.",
	"user": {
		"login": "mattfarina",
		"id": 62991,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-31T19:44:51Z",
	"updated_at": "2015-12-31T19:44:51Z"
}
