{
	"id": 167638400,
	"body": "@rsc, yes, this is effectively the goal of vendor-spec. As you noted, I haven't seen convergence on a single spec for vendor packages. Perhaps another way to phrase this proposal is \"give tentative blessing to a format from the go team and and ask for feedback from tool authors\". I'm completely aware this is putting the cart before the horse.\r\n\r\nI've asked for feedback in the past on why tool authors couldn't adopt it. I've heard:\r\n * silence\r\n * the spec is per package rather than per repo\r\n * it wouldn't work\r\n\r\nTo address the second point, I propose adding the (probably poorly named)  \"tree\" parameter that says, everything under this point is also included. It could be the vendor-spec isn't good enough; I just don't know in which way's it is deficient.\r\n\r\nAt this point I'm not sure if the existing variety is due to a lack of consensus or just lack of caring to change existing and working tools. Thus if it was proposed that command like \"go get\" read and used the vendor-spec file (not 100% a good idea), then I think many more people would care about having and using a common format. As it is, it is a nuisance when exploring or auditing many different go packages, but not a complete show stopper; they are all machine readable and they all contain the same information and many large project have Makefiles that hide which vendor tool they use to some degree.\r\n\r\nRE /x/exp/\u003cTBD\u003e package: You're correct, more detail would be needed. Mainly here to say, this proposal would be of two parts, a spec and a package that handles the spec. What that API looks like would need to be defined. I would love to add this if the fate of this proposal gets to that point.\r\n\r\n---\r\n\r\nI suppose what I could try to find out next is why vendor tool authors not using this:\r\n * Is it not workable for that tool?\r\n * Do they already have a format and don't see a reason to change it?\r\n * Do they just want to do their own thing?\r\n\r\n@freeformz I think is open to using something like this\r\n@mattfarina Has said it won't work, and has promised more detailed info.\r\n\r\nI'll try to ask around.\r\n",
	"user": {
		"login": "kardianos",
		"id": 755121,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-28T19:46:03Z",
	"updated_at": "2015-12-28T19:46:03Z"
}
