{
	"id": 167831998,
	"body": "I have several issues with the original proposal, @kardianos. Two are architectural, and one is polemical.\r\n\r\n1) Why operate at package level instead of repo level? The only reason given is preference:\r\n\r\n```\r\nFrom experience I absolutely love vendoring at the package level\r\n```\r\n\r\nBut not even the experiences are relayed. This seems odd to me for one very clear reason: Versions are not an attribute of packages, they are an attribute of repositories. Therefore, at even the most rudimentary, vendor spec suffers from what is called \"level confusion\" -- the assigning of attributes to the wrong \"level\" of abstraction.\r\n\r\nThis is clearly evidenced by the fact that the proposed file format would allow setting different versions to two co-located packages. Doing so would clearly allow unintended side effects and difficult state resolution.\r\n\r\n2) I also object to vague and misleading statements in your original proposal like this:\r\n\r\n```\r\nFor example current tool file formats can't handle the\r\ncase of vendoring a patched version of a standard library package (this\r\nwould have been useful for crypto/tls forks for detecting the heartbleed\r\nattack and for accessing MS Azure).\r\n```\r\n\r\nGiven that your proposal does nothing to address this case, and that you are conflating \"tool\" and \"file format\", this seems to me to be more FUD than useful commentary. Not to mention that at least one of the tools that you point out in your proposal has handled that situation elegantly since its inception.\r\n\r\n3) As I read your proposal, I see no advantages in using your new solution over existing formats like Glide's lock file. You don't seem to give any reasons. You just seem to assert that we need your spec instead of just standardizing on one of the existing ones. In fact, your comparison to the Glide.lock file points out that the Glide.lock file has some important features that your spec is missing, like dev imports and a hash. (Worthwhile note: Glide.lock also has an `ignore` list. It's just omitted when empty.)",
	"user": {
		"login": "technosophos",
		"id": 89193,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-29T17:07:46Z",
	"updated_at": "2015-12-29T17:07:46Z"
}
