{
	"id": 249456765,
	"body": "I agree with Minux that the scenarios seem contrived. However, it does seem\nlike common courtesy to say, \"hey, your system is obviously borked\"\n\nAlso: I think dropping the dev numbers part of this issue is a good idea.\nBut still maintain checking to see if it's a char device is a good idea.\nOn Sun, Sep 25, 2016 at 5:08 PM Minux Ma \u003cnotifications@github.com\u003e wrote:\n\n\u003e The world is migrating to syscall based entropy gathering, and I think\n\u003e this issue is much less important now. And I still don't think the check\n\u003e is useful. If the attack has gained enough access to tamper /dev/urandom,\n\u003e I imagine he would rather do others much more useful tricks than to\n\u003e tamper with /dev/urandom.\n\u003e\n\u003e Is there any realistic attack scenarios that the attacker would just\n\u003e swap /dev/urandom? The only benefit of switching /dev/urandom is\n\u003e perhaps generating deterministic random numbers, but if the attacker\n\u003e has root, then it's easier to just steal the private key, which leaves\n\u003e no trace and enables the attackers to do basically the same with\n\u003e making CSPRNG deterministic.\n\u003e\n\u003e If it's the user that replaces /dev/urandom, then we shouldn't bother\n\u003e either because this is Unix, and the user with root is supposed to\n\u003e know what they are doing.\n\u003e\n\u003e I don't think OpenSSL does this check (it did do fstat on the fd, but\n\u003e it's to avoid reading entropy multiple times from the same device.)\n\u003e\n\u003e —\n\u003e You are receiving this because you commented.\n\u003e Reply to this email directly, view it on GitHub\n\u003e \u003chttps://github.com/golang/go/issues/15850#issuecomment-249455546\u003e, or mute\n\u003e the thread\n\u003e \u003chttps://github.com/notifications/unsubscribe-auth/AFnwZ2m0oLEgieDnDw5xPDamJUoFI326ks5qtw0WgaJpZM4Inxf2\u003e\n\u003e .\n\u003e\n",
	"user": {
		"login": "EricLagergren",
		"id": 5894247,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-26T00:29:41Z",
	"updated_at": "2016-09-26T00:29:41Z"
}
