{
	"id": 176707493,
	"body": "@bradfitz thanks.\r\n\r\n\u003e gRPC reimplemented http2 because they had to\r\n\r\nMy thought is that eventually, another framework like gRPC should not have to reimplement http2 because the standard (or at least `x/net`) package would support all valid protocol use-cases. I realise gRPC came before your implementation so it was not an option there, but long term it seems bad that anyone else (like me) who wants to use HTTP/2 for inter-service communication (according to spec) has to reinvent the wheel despite \"HTTP/2\" implementation existing in standard lib.\r\n\r\nTo be clear, for my use-case I'm mostly interested in inter-service communication where I assume I control both client and server, so I really want HTTP/2 over TCP with \"prior knowledge\" ([section 3.4](https://http2.github.io/http2-spec/#known-http)) rather than HTTP/1.1 Upgrade.\r\n\r\nBut I think it makes sense that there is at least a somewhat official library (even if it stays in x) that supports the whole spec.\r\n\r\nI looked at the [old PR for upgrade support](https://github.com/bradfitz/http2/pull/48) which seems a little hairy in the way it integrates with http server - I can see it's not a simple request to support.\r\n\r\n\u003e I might accept h2c as a separate package under x/net/http2, but it won't be part of the Go standard library\r\n\r\nFair enough. Can I ask how the two interact? I'm using 1.6rc which uses http2 automatically when serving TLS via net/http (standard library) but the http2 implementation appears to still be this one in `x/net`. Do you consider http2 to be \"standard library\" due to its integration with `net/http` even though the implementation is still in `x/net` and still has TODO items on public interface or did I misunderstand something (like a subset got copied over)?\r\n\r\nI will take a look through the commit you linked and get a better idea what the options are in terms of optional h2c upgrade and/or prior knowledge support with `net/http`.\r\n\r\nThanks again for your help.",
	"user": {
		"login": "banks",
		"id": 120915,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-01-29T11:42:34Z",
	"updated_at": "2016-01-29T11:42:34Z"
}
