{
	"id": 51280248,
	"number": 3199,
	"state": "open",
	"title": "x/tools/cmd/godoc: separate commands from packages in directory listing",
	"body": "\u003cpre\u003eThis is a follow-up to the really nice update from Russ with CL:\n\u003ca href=\"http://golang.org/cl/5711058/\"\u003ehttp://golang.org/cl/5711058/\u003c/a\u003e\n\nIt will be nice to separate user ($GOPATH) commands from packages in directory listing.\nOne way to do this is to show user commands (from $GOPATH/src/cmd/*) in Commands view,\nand not in Packages view.\n\ngodoc currently handles user packages found in $GOPATH nicely, by putting user packages\nalongside built-in packages, so one sees all the packages available to him.\n\nIn the same vein, it will be nice if godoc can handle commands, by putting user commands\nalongside built-in commands. \n\nFor example, suppose you have:\n  $GOPATH/src/{pkg1...n}\n  $GOPATH/src/cmd/{cmd1...n}\n\nIt will be nice if godoc skips showing anything under src/cmd in the\n\u0026quot;Packages\u0026quot; view (ie skip cmd/{cmd1...n}), and show stuff under src/cmd/\n({cmd1...n}) in the \u0026quot;Commands\u0026quot; view. \n\nCurrently, I see my commands in the Packages view, and the import line is wrong, and\nthere's really no extra information it gives, since I can't use the command code in any\nother packages (so it ends up adding clutter).\n\nTo illustrate further, in my codebase, when I run godoc, I see my commands somewhere in\nthe middle of the pack, below my b###.net/* and bytes packages and before\ncode.google.com/* packages. It's very easy to miss (especially with the comfortable\nspacing style), and you wouldn't realize those are not actually packages, but commands.\nI then click the \u0026quot;Commands\u0026quot; link where I'd expect to see them, but see only\nthe standard ones (like go, gofmt, vet, yacc, etc). \n\n(This suggestion is limited to godoc alone; the definition of $GOPATH and its\ninteraction with go command shouldn't be affected)\n\n##################### DETOUR ######################\nIt will also be nice if there's a quick link above Packages/Commands views to:\n  .. (up one directory level) \n  Packages\n  Commands\n\nCurrently, the .. is way at the bottom (along with Sub Directories), and to get to\nPackages or Commands listing, you have to click References at the top and start over.\n\n\nWhich compiler are you using (5g, 6g, 8g, gccgo)?\n6g\n\nWhich operating system are you using?\nLinux\n\nWhich revision are you using?  (hg identify)\nba91b34fe212+ tip\n\nPlease provide any additional information below.\u003c/pre\u003e",
	"user": {
		"login": "ugorji",
		"id": 1222082,
		"type": "User",
		"site_admin": false
	},
	"comments": 13,
	"created_at": "2012-03-05T22:14:37Z",
	"updated_at": "2015-04-14T19:40:00Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	}
}
