{
	"id": 112678633,
	"number": 13016,
	"state": "closed",
	"title": "x/mobile/cmd/gomobile: android resource identifiers are hard-coded without relevant api info",
	"body": "The current minimum target of gomobile for android is api-9. The gomobile cmd has hard coded resource identifiers to avoid requiring the android.jar from the sdk for that platform.\r\n\r\nResource identifiers that can not be extracted from an api-9 android.jar, gomobile's minimum target, should be excluded. Since resource identifiers are hard-coded but contain no information wrt the api level the identifier was introduced, this may lead to invalid manifests containing resource identifiers for an api level higher than the declared target api of a developers manifest. I'm unaware of the defined behavior in such a case, but this would normally lead to a warning or error in a java app.\r\n\r\nIt's unclear if this problem has been made aware. I think an additional comment in binary_xml.go is suitable, but also a test in binary_xml_test.go that actually inspects api-9 android.jar to assure a developer has not added an identifier that should not be supported by gomobile's minimum target.\r\n\r\nBut, excluding resource identifiers higher than gomobile's minimum target is the bare minimum. Does the gomobile cmd need to intentionally exclude other identifiers that simply don't make sense for a pure go app?\r\n\r\nFor example, while deliberating for an api to allow programmatically setting an app full-screen, there's little reason to not allow a developer to declare the full screen resource theme in their android manifest file. At the same time, there's little reason to add identifiers for other various themes that can be found in api-9's android.jar. What other cases may be excluded?\r\n\r\n@crawshaw ",
	"user": {
		"login": "dskinner",
		"id": 92266,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		}
	],
	"comments": 7,
	"closed_at": "2016-03-05T06:50:12Z",
	"created_at": "2015-10-21T21:04:55Z",
	"updated_at": "2016-03-05T06:50:12Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	}
}
