{
	"id": 67529154,
	"body": "\u003e As the code and slides referenced above demonstrate, using a seed with CitiyHash and Murmur3 is completely broken. Pick any seed you want, it doesn't make any difference.\r\n\r\nIt is not a surprise that hashes not designed for DoS resistance have no DoS resistance.  For instance, CityHash does f(g(msg), seed).  Collisions in g cause collisions in CityHash independent of seed.  My conclusion: don't fold in the seed like that if you want DoS resistance.\r\n\r\n\u003e It almost seems as if you are claiming you can thwart \"hash-flooding DoS\" attacks with your new hash code by doing a \"judicious xor or two\" combined with a random seed based on \"some process startup randomness\"? Is that your claim? \r\n\r\nYes, and there is an existence proof.  SipHash does exactly that with 4 xors.\r\n\r\n\u003e My AesHash vs SipHash benchmarks are very different than the numbers you mention.\r\n\r\nThat's something we should figure out one way or another.  I found a performance bug in my implementation (byte instead of word loads for siphash).  After fixing it I get more like 2.6x/6.7x (short/long) compared to the new hash algorithm and 2.9x/12.6x compared to aeshash.\r\n\r\nMy testbed is inside the SMHasher test suite, instructions to grab it and try it yourself are below.\r\nPart of it may be overheads - from your aes numbers it looks like you're getting 40 cycles for a 4-byte key and I'm getting 23 cycles.  The more overhead, the less difference you see between implementations.\r\n\r\nDownload http://keithandkatie.com/downloads/smhasher-gohash.tar.gz\r\ntar xvfz ~/Downloads/smhasher-gohash.tar.gz\r\ncd smhasher-gohash\r\nmkdir build\r\ncd build\r\ncmake ..\r\nmake\r\n./SMHasher SipHash64\r\n./SMHasher GoHash64\r\n./SMHasher AesHash64\r\n\r\n\u003e Look at the headlines today (\"Sony\").\r\n\r\nEquating DoS attacks with attacks like these doesn't help your argument.\r\n\r\nAs Ian said, no one is claiming that DoS attacks aren't worth defending against.  The question is one of cost to every other user of maps.  Also, DoS defenses don't have to be perfect.  A low-cost solution that makes DoS attacks 100x harder may be better than a high-cost solution that eliminates them entirely.\r\n\r\nFinally, note that the new fallback hash that started this whole conversation is 1e9x better than the old fallback hash.  So, progress.",
	"user": {
		"login": "randall77",
		"id": 6889504,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-12-18T18:12:59Z",
	"updated_at": "2014-12-18T18:12:59Z"
}
