{
	"id": 51289059,
	"number": 9074,
	"state": "closed",
	"title": "math/cmplx: Log and Phase are defined on the whole complex plane",
	"body": "by **gunnarthormagnusson**:\n\n\u003cpre\u003eThe Log and Phase functions in the math/cmplx library are too permissive. They should be\ndefined on the standard branch of the complex logarithm, but are in fact defined on the\nwhole punctured complex plane. Details follow.\n\n\u0026gt; What does 'go version' print?\n\ngo version go1.3.3 linux/amd64\n\n\u0026gt; What steps reproduce the problem?\n\u0026gt; If possible, include a link to a program on play.golang.org.\n\nCalculate the complex logarithm of 1, i, -1 and -1. See here:\n\n    \u003ca href=\"http://play.golang.org/p/imVbDZGdMw\"\u003ehttp://play.golang.org/p/imVbDZGdMw\u003c/a\u003e\n\n\n\u0026gt; What happened?\n\nFrom what I understand of the comments in the source, the Phase function (used in Log)\nshould return the arguments of a complex number in the range [-Pi,Pi]. It can not do\nthis for purely mathematical reasons (see the first paragraph of\n\u003ca href=\"http://en.wikipedia.org/wiki/Complex_logarithm#Branches_of_the_complex_logarithm)\"\u003ehttp://en.wikipedia.org/wiki/Complex_logarithm#Branches_of_the_complex_logarithm)\u003c/a\u003e.\n\n\u0026gt; What should have happened instead?\n\nI'm guessing that the authors wanted to define the principal branch of the complex\nlogarithm; the one that excludes the negative real line. Then\n\n    cmplx.Log(complex(-1,0))\n\nshould have returned an error or some kind of 'not a number' type.\n\n\u0026gt; Please provide any additional information below.\n\nThe Wikipedia article on the complex logarithm:\n\u003ca href=\"http://en.wikipedia.org/wiki/Complex_logarithm\"\u003ehttp://en.wikipedia.org/wiki/Complex_logarithm\u003c/a\u003e\n\nAny introductory textbook or course on complex analysis will have all the details.\n\nI'd like to stress that this is really a problem. Since Go has complex numbers and\nfunctions to deal with them built in, users will be inclined to trust and use them. That\nthe logarithm and phase functions do not have explicit branches selected and in fact\naccept all arguments can and will cause very subtle and difficult to find bugs in the\nprograms of people who will want to use Go for calculations with complex numbers. (Julia\nand Mandelbrot fractals are one example of applications of such calculations.) Those\npeople *will* blame Go for these bugs when they arise.\n\nA possible solution is to decide and say explicitly that the library functions for\ncomplex numbers in Go use the principal branch, and then modify the functions to return\nerrors when given purely negative real numbers. Users can then roll their own custom\nbranch logarithms if they want.\n\nThanks,\ngthm\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 4,
	"closed_at": "2015-06-29T04:06:07Z",
	"created_at": "2014-11-08T19:45:34Z",
	"updated_at": "2016-06-28T21:53:24Z",
	"milestone": {
		"id": 905105,
		"number": 1,
		"title": "Go1.5"
	}
}
