{
	"id": 137124713,
	"number": 14558,
	"state": "open",
	"title": "spec: clarification for the language used in the language specifications",
	"body": "Hi,\r\n\r\nI'm not a native English speaker so please bare with me.\r\n\r\nWhile looking at the documentation for https://golang.org/ref/spec#Integer_overflow I've realized that the sentence: ` Loosely speaking, these unsigned integer operations discard high bits upon overflow, and programs may rely on \"wrap around\". ` currently leaves room for interpretation.\r\n\r\nI can read this as: for now one can assume the `wrap around` will happen but it might be changed in the future. Or I can read this as `wrap around` will always be present (in Go 1.x).\r\n\r\nThen based on the discussion I've had on this topic, I've realized that there are other points as well in the language specifications which are ambiguous. For example ` Implementation restriction: For compatibility with other tools, a compiler may disallow the NUL character (U+0000) in the source text. ` sounds awful when you think of a limitation, `Implementation restriction `, and a ` may `, optional, are involved. I've interpreted that as ` [..] must disallow [..] ` only because the sentence starts with ` Implementation restriction ` but someone else said ` may ` is not necessarily equivalent to ` must ` (and I can understand where that version comes from).\r\n\r\nAs there are 144 ` may `s in the document, I think that some better description of what `may` or `must` or `may not`, in the same style that IETF RFCs always define what `must`, `must not`, `may` and so on represent. This would also help people that are used to RFCs but are not necessarily native English speakers. It would also people that write compilers, static analysis tools and end-users.\r\n\r\nThank you for your consideration.",
	"user": {
		"login": "dlsniper",
		"id": 607868,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Documentation"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 5,
	"created_at": "2016-02-29T01:39:38Z",
	"updated_at": "2016-04-21T22:38:52Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
