{
	"id": 124342465,
	"body": "@ngrilly, @egonelbre, \"immediate mode\" is an interesting concept, and worth exploring, but the shiny widget library will take a traditional \"retained mode\" approach. As I said, there are many possible approaches, and I'm more than happy for somebody else to try an \"immediate mode\" substitute for the higher-level, that re-uses the lower-level. Or it could re-use the higher-level. I haven't used React myself, but IIUC, it re-uses the browser's DOM, and that DOM takes a traditional \"retained mode\" approach.\r\n\r\n@anlhord, if you feel that there is nothing to review here, then you are free not to review it. As for your proposed language change, please file a separate proposal for that, and we can discuss it there.\r\n\r\n@anlhord, @andlabs, as for Release, yes, some resources can be explicitly released. Just like the io.Closer interface exists for a reason, and we don't rely on garbage collection to close your database connection, io.Pipe, or gzip.Writer.\r\n\r\n@andlabs, @anlhord's proposal was previously discussed at https://groups.google.com/forum/#!topic/golang-dev/_V7_Be-AA38, but this is off-topic here, and I have asked @anlhord to file a separate proposal.\r\n\r\n@tucnak, by QML I presume you mean a declarative way to specify a widget hierarchy. It's an interesting idea, especially for people wanting to build GUIs visually, in IDEs, but we're a long way from there yet. In any case, it seems like something that could be a separate package that used (high-level) shiny, rather than necessarily being part of shiny.\r\n\r\n@niemeyer, yes, I would like to repeat that shiny does not aim to be 'the official GUI package'. It is an experiment, although it will hopefully influence golang.org/x/mobile/app in the medium term.\r\n\r\n@ianremmler, I would phrase it a potentially transparent widgets, instead of non-rectangular widgets, as I'd still like the concept of a bounding box (a rectangle). Each widget will also have its own relative coordinate system that is a translation of the window coordinate system, but not an arbitrary affine transformation (sorry @ajstarks), at least not in the near term. As for fixed aspect ratios, layout will indeed be an interesting problem.",
	"user": {
		"login": "nigeltao",
		"id": 8565232,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-07-24T06:17:12Z",
	"updated_at": "2015-07-24T06:17:12Z"
}
