{
	"id": 68331861,
	"body": "On Tue, Dec 30, 2014 at 12:18 AM, Dmitri Shuralyov \u003cnotifications@github.com\n\u003e wrote:\n\n\u003e That's not true as far as I can tell, it can be used to document any Go\n\u003e package (command or library). Can you show where it says otherwise, because\n\u003e I don't see that documented and in practice\n\u003e \u003chttps://github.com/golang/go/blob/4b96409aacfb569ac2564240d8aadd668b7c25fa/src/go/build/build.go#L675-L678\u003e,\n\u003e it works on non-main packages too.\n\u003e\nDoes it work for non-commands packages? I highly doubt it.\n(I mean godoc, not go/build, go/build ignores the file for a related but\ndifferent reason)\nhttps://go.googlesource.com/tools/+/master/godoc/server.go#97\n\nYou quoted go/build source code, but that doesn't prove the point, you\nshould look into\nthe source code of the godoc package itself.\n\n\u003e  To what extend should godoc try to verify the package/command? Should it\n\u003e try compiling it to be sure that it's a valid package/command?\n\u003e\n\u003e cmd/godoc currently respects builds tags, right? It looks at the given\n\u003e folder, finds all .go files but only considers ones that are not ignored\n\u003e due to (business logic taken from http://godoc.org/go/build#Context.Import\n\u003e ):\n\u003e\n\u003e    - .go files in package documentation\n\u003e    - files starting with _ or . (likely editor temporary files)\n\u003e    - files with build constraints not satisfied by the context\n\u003e\n\u003e If it finds that there are 0 .go files (either because there are really no\n\u003e .go files, or because the ones that were there were all ignored due to\n\u003e above rules), it should not try to display any docs (what docs can be\n\u003e displayed if there are 0 .go files?).\n\u003e\nRead the comment I quoted and see why package documentation is a special\ncase.\nThis behavior won't go away as long as we still have commands written in C.",
	"user": {
		"login": "minux",
		"id": 135652,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-12-30T05:43:04Z",
	"updated_at": "2014-12-30T05:43:04Z"
}
