{
	"id": 52216624,
	"number": 9365,
	"state": "closed",
	"title": "runtime: Extend Go's map crypto hash guarentee to all platforms in 1.5",
	"body": "I originally wrote this as a response to #9295 but then realized that issue is closed and a patch is pending.\r\nAlso see https://github.com/OneOfOne/xxhash/issues/2\r\n\r\n**It would be much better to extend Go's map crypto hash guarentee to all platforms.**\r\n\r\nWith all due respect I think the proposed new fallback hash function is a mistake. Seriously, I was about to make a \"Merry Christmas\" post on go-nuts thanking the Go Authors for using a crypto quality hash to implement maps on X86-64. As many other languages struggle with their hash functions being hacked with differential crypto, Go is in much better shape.\r\n\r\nMy proposal is SipHash.\r\nhttps://131002.net/siphash/\r\n\r\nOn that page note \"C++ program to find universal (key-independent) multicollisions for CityHash64\"\r\nRun the program and see how trivial it is to generate multi collisions.\r\n\r\nI wonder how many users have Go programs and APIs that accept uncontrolled input over the web and pump that into a map? The Go team has an opportunity here to protect users from themselves starting with 1.5.\r\n\r\nThere is already an X86_64 optimized version of SipHash here and it's in the \"public domain\".\r\nhttps://github.com/dchest/siphash\r\n\r\nI'll try to post some numbers in a few days showing that SipHash could be a viable replacement for the fallback hash.\r\n\r\nFWIW, I am working on Go project to offer a large number of hash functions along with testing and benchmarking under one project here:\r\nhttps://github.com/tildeleb/hashland\r\n\r\nI took SMHasher and aeshash code from the Go  runtime. There is also a proposal for a new, non streaming hash interface, and more. It's still in pretty rough shape, as I've been hacking on it every day. The benchmarking that it does is currently kind of broken and suffers from using an generic adapter function. I am working on that.\r\n\r\n*I really hope Go 1.5 can extend map's crypto guarentee to all platforms.*",
	"user": {
		"login": "tildeleb",
		"id": 834628,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 17,
	"closed_at": "2015-01-01T08:55:55Z",
	"created_at": "2014-12-17T09:12:53Z",
	"updated_at": "2016-06-25T01:56:44Z"
}
