{
	"id": 51281657,
	"number": 4113,
	"state": "closed",
	"title": "os/user: test fails on windows",
	"body": "\u003cpre\u003eHi All,\n\nI am couple of days into go. My working os is windows.\nI wanted to work with a recent developer build of go. Since there were no releases after\ngo1.0.2, I tried building the source.\n\n\u0026gt; hg tip\nchangeset:   14138:979c5e5b1308\n\nThe windows build completed with 3 test failures as below:\n\n    --- FAIL: TestCurrent (21.51 seconds)\n    user_test.go:34:        Current: The RPC server is unavailable.\n    --- FAIL: TestLookup (0.00 seconds)\n    user_test.go:74:        Current: The RPC server is unavailable.\n    --- FAIL: TestLookupId (0.00 seconds)\n    user_test.go:90:        Current: The RPC server is unavailable.\n\n\nMy questions:\n\n1. There were no build logs apart from the messages on stdio. I couldn't find any\noptions in all.bat or make.bat either. Is there anyway to enable build logging?\n2. How to invoke only failed test by name instead of package level ?\n3. How to get more debugging information? (stack-trace or entry-exit logs) The go test\nverbose option doesn't seem to through any more useful information\n\n4. What should I do next with the test failure? Below is my understanding of the cause -\nis this a bug or some environment issue on my system?\n\nFor the above error, I introduced fmt.Println()'s and the impression I get is that the\nfailure is in:\n\n    os/user/lookup_windows.go -\u0026gt; Current() -\u0026gt; newUser() -\u0026gt; lookupFullName()\n\n    newUser() has gets all parameters with exception of name in the below struct.\n    u := \u0026amp;User{\n    Uid:      uid,\n    Gid:      gid,\n    Username: domainAndUser,\n    Name:     name,\n    HomeDir:  dir,\n    }\n    To resolve the OS name to the actual name it calls lookupFullName() to resolve with domain controller and fails.\n\n    My laptop was not connected to the network to which the user belongs. I tried the same after connecting to the network and the test succeeded.\n\n\nWhat is the expected behavior of Current(). Since it already has domainAndUser, why not\nrespond with these details instead of failing.\nIs there any other interface for fetching currently logged OS user?\n\nbest regards\nShivakumar GN\u003c/pre\u003e",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 6,
	"closed_at": "2014-12-08T10:21:52Z",
	"created_at": "2012-09-20T07:47:43Z",
	"updated_at": "2016-06-24T22:25:04Z"
}
