{
	"id": 114886727,
	"body": "Indeed. The main points: 1) There is at least one additional legitimate need for which importing main is strictly the simplest/shortest approach. 2) Preventing import of main isn't a direct solution to #4210 --  it merely makes the cause of #4210 impossible. A _direct_ fix seems plausible (make the go tool aware of the difference between binaries and archives), thus I'd argue that the toolchain transparently could become well equipped to deal with these matters properly.\r\n\r\n(Oddly enough, #4210 has never affected me -- only the commit closing #4210 will affect me).\r\n\r\nIf the toolchain change remains in place or is explicitly re-ordained, it needs to be addressed in the specification. The spec currently doesn't have any \"Implementation restriction:\" notes that allow the toolchain to prohibit imports of main, thus with this change, the toolchain at best supports only a subset of the [current] language.\r\n\r\nThat said, the previously mentioned [CL 4126053](https://codereview.appspot.com/4126053) removed a yet-earlier language-level prohibition of such imports. Since the official toolchain is, clearly, the canonical Go implementation, toolchain changes of this nature are defacto language changes, thus this would be a defacto reversal of the prior consensus reached in the codereview 4126053.\r\n\r\nI would personally be fully satisfied if all the LGTM's from 4126053 also put LGTM's on [CL 10925](https://golang.org/cl/10925), though I can't speak for @kevinwallace, who also has the same use-case as I do, and would also need to reorganize code if Ian's commit sticks through to the 1.5 release.\r\n\r\nAdditionally/alternatively, I will be at GopherCon (including the optional days), and will happily demonstrate my counter-case; if informed consensus occurs in either direction, I will of course graciously yield.",
	"user": {
		"login": "extemporalgenome",
		"id": 536740,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-06-24T14:28:07Z",
	"updated_at": "2015-06-24T14:28:07Z"
}
