{
	"id": 93568784,
	"body": "some issues i encountered while reintroducing the padding with the changes of #10430 in mind:\r\n\r\nif padding is applied on a per element basis precision should likely too:\r\n\r\nHowever there are existing test cases that apply it to the whole slice:\r\n\t{\"%.5x\", []byte(\"abcdefghijklmnopqrstuvwxyz\"), `6162636465`},\r\n\r\nI think there are at least 3 options that can be implemented to format byte slices while correcting the padding:\r\n\r\n1) format byte slices no different than other integer slices and apply all formatting on an element basis:\r\nBut then \"% x\" should be \"[ 1 2 3]\" not \"1 2 3\"\r\nThen the line \" String and slice of bytes: \" in documentation for %x and %X should be only referring to strings. \r\n\r\nAlso should change the doc \"' '\t(space) leave a space for elided sign in numbers (% d);\r\n\tput spaces between bytes printing strings or slices in hex (% x, % X)\" \r\nto not refer to byte slices. Since in an absolute reading of \"For compound operands such as slices and structs, the format applies to the elements of each operand, recursively, not to the operand as a whole.\" \"% x\" would never be applied to the whole byte slice and therefore cant introduce space between elements.\r\n\r\nIf there should still be spaces between elements then specifying \"% x\" would have the (likely unintended) side effect of introducing spaces between elements and adding a space for each byte element in place of sign at the same time.\r\n\r\n2) format byte slices in the old behavior like strings.\r\n\r\n3) format byte slices in the old behavior but apply ' ' only to the slice but #, padding and precision only to each element. Seems to be the version that would be favored by the test cases added in #10430. Then an open question is still if 1 without padding should be \"1\" or \"01\".  In the first case then the documentation \" String and slice of bytes: ... two characters per byte\" needs to be changed.",
	"user": {
		"login": "martisch",
		"id": 184995,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-04-15T21:03:43Z",
	"updated_at": "2015-04-15T21:09:47Z"
}
