{
	"id": 158871167,
	"body": "http://dave.cheney.net/2015/10/16/bootstrapping-go-1-5-on-non-intel-platforms\n\nFeel free to copy this information into the go wiki or send a CL to update\nthe source install documentation.\n\nThanks\n\nDave\n\nOn Mon, 23 Nov 2015, 18:34 Dieter Reuter \u003cnotifications@github.com\u003e wrote:\n\n\u003e @rakyll \u003chttps://github.com/rakyll\u003e Thanks for this request, that's\n\u003e exactly the reason I'm asking for this too. As a user I just like to\n\u003e install a Go compiler to compile my programs from source. I really don't\n\u003e like to bother with bootstrapping and compiling the Go compiler myself. It\n\u003e takes hours and hours and I run constantly into some problems. Right now\n\u003e each and every user has to do this steps, without detailed informations\n\u003e about the official or recommended way (sorry Go team, it's not well\n\u003e documented right now)! That's just cumbersome and boring and leads to\n\u003e errors and frustrated users.\n\u003e\n\u003e For this reason I did created a public repo with all the details. We could\n\u003e use it in the meantime until pre-compiled Go tarballs are available for all\n\u003e ARM versions. How to compile Go on ARM devices for 1.4 and 1.5 is essential\n\u003e to know. The build process is documented and, it just requires gcc and a\n\u003e pure Linux distro. Everything is open and scripted in bash and there is a\n\u003e Dockerfile too as and example.\n\u003e\n\u003e But you don't have to compile Go by your own on a slow ARM device, I just\n\u003e included all pre-compiled tarballs for the recent Go 1.4 and 1.5 releases\n\u003e as a GitHub release. Just download and install it the usual way:\n\u003e\n\u003e    - Go 1.4.3 (ARMv6, ARMv7)\n\u003e    - Go 1.5.1 (ARMv5. ARMv6, ARMv7)\n\u003e    https://github.com/hypriot/golang-armbuilds/releases\n\u003e\n\u003e I feel, it's mandatory to provide 100% transparancy - that's open source\n\u003e for me. With a complete build documentation everybody can bootstrap Go on\n\u003e any Linux device just with gcc. For all the builds we should include all\n\u003e log files for all released builds. And for the users we just need the\n\u003e ready-to-use tarballs to safe time and avoid problems.\n\u003e\n\u003e *Disclamer:* my repo is WIP now and will hopefully superseeded by\n\u003e official downloads soon.\n\u003e\n\u003e —\n\u003e Reply to this email directly or view it on GitHub\n\u003e \u003chttps://github.com/golang/go/issues/13066#issuecomment-158869655\u003e.\n\u003e\n",
	"user": {
		"login": "davecheney",
		"id": 7171,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-11-23T07:45:07Z",
	"updated_at": "2015-11-23T07:45:07Z"
}
