{
	"id": 51288287,
	"number": 8496,
	"state": "closed",
	"title": "spec: term \"variable\" used inconsistently",
	"body": "\u003cpre\u003eThis might be a bit overly pedantic, but the Go spec seems to imply \u0026quot;variable\u0026quot;\nonly means objects declared with \u0026quot;variable declarations\u0026quot; and \u0026quot;short\nvariable declarations\u0026quot; as in\n\n    var x int\n    y := 7\n\nFor example, see the definition of addressable where it's stated:\n\n    \u0026quot;\u0026quot;\u0026quot;The operand must be addressable, that is, either a variable, pointer indirection, or slice indexing operation; or a field selector of an addressable struct operand; or an array indexing operation of an addressable array.\u0026quot;\u0026quot;\u0026quot;\n\nOr how the definitions of array type and struct type avoid the word variable:\n\n    \u0026quot;\u0026quot;\u0026quot;An array is a numbered sequence of elements of a single type, called the element type.\u0026quot;\u0026quot;\u0026quot;\n\n    \u0026quot;\u0026quot;\u0026quot;A struct is a sequence of named elements, called fields, each of which has a name and a type.\u0026quot;\u0026quot;\u0026quot;\n\nIt seems reasonable to infer from that wording then that struct fields and array\nelements are *not* variables.  However, if that were the case, it would cause problems\nwith code like this:\n\n    var x [2]int\n    p, q := \u0026amp;x[0], \u0026amp;x[1]\n    if p == q { ... }\n\nPointer types are defined as \u0026quot;A pointer type denotes the set of all pointers to\n*variables* of a given type\u0026quot;, but x[0] and x[1] are not variables, so we wouldn't\nbe able to take pointers to those array elements.\n\nAlso, equality on pointers is defined as \u0026quot;Two pointer values are equal if they\npoint to the same *variable* or if both have value nil.\u0026quot;  In the above code, p and\nq point *into* the same variable, but to different elements within that variable.\u003c/pre\u003e",
	"user": {
		"login": "mdempsky",
		"id": 38349,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 5,
	"closed_at": "2014-12-08T10:47:14Z",
	"created_at": "2014-08-08T01:00:32Z",
	"updated_at": "2016-06-25T01:39:17Z"
}
