{
	"id": 135260335,
	"body": "@kostya-sh to address your points\r\n\r\n\u003e If the goal of this proposal is to create a document describing best practices for versioning then it should cover topics that I raised including backward compatibility. A document describing best practices for versioning, releasing, using vcs, maintain backward compatibility, etc would be very useful.\r\n\r\nThese are good points, if this proposal moves forward to the design document stage it should address these points.\r\n\r\n\u003eIf the goal of this proposal is to make semver versions standard in the Go community then I think:\r\ntools support should come first. gofmt mentioned in the proposal is the excellent example why\r\nit is fairly easy to enforce the version format but it is much more difficult or even impossible to make people follow the rules behind it\r\n\r\nI disagree, as I mentioned about to @thockin this is the smallest possible proposal I can think of to make forward progress. Yes, larger proposals would be more comprehensive, but would take significantly longer to achieve consensus and would then be further delayed by a requirement to be scheduled into the Go release cycle -- do you really want to wait up to a year to see this implemented in a released version of Go ?\r\n\r\nThis proposal is the smallest I can make. It pushes all the questions of what versioning means to an accepted standard, semver, which is widely used across languages who we consider to be contemporaries (or competitors) to Go, and lets us benefit from their experiences rather than reinventing what would likely be a very similar wheel.\r\n\r\nIf you agree with that position, then this proposal boils down to a format for vcs tags that I believe can achieve consensus easily and can be of use immediately for all the tool makers, godoc.org maintainers, and operating system distros, in the Go ecosystem.\r\n\r\nThanks\r\n\r\nDave",
	"user": {
		"login": "davecheney",
		"id": 7171,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-08-27T02:36:12Z",
	"updated_at": "2015-08-27T02:36:12Z"
}
