{
	"id": 194108110,
	"body": "\u003e Does anything use this but XMPP?\r\n\r\nI know there are some video games that use it; eg. according to these [blog](https://metajack.im/2008/09/08/which-bosh-server-do-you-need/) [posts](https://metajack.im/2008/07/02/xmpp-is-better-with-bosh/ there is (was?) a Chess game using it at one point, but I'm having a hard time searching for \"things that aren't XMPP that use BOSH\". In general, it's mostly XMPP, both chat and internet-of-things devices that need to make it through most firewalls.\r\n\r\nI'm pretty sure I've read that some of the other large non-XMPP chat providers were using it, and I know that I've read about various mobile apps using it in environments where it's hard to keep persistant TCP connections open (for things that weren't XMPP), but I'm having trouble finding references for that.\r\n\r\nAlso, lots of sites provide long-polling APIs that don't use BOSH, but do their own non-standard implementations. BOSH can be thought of as a way of standardizing long-polling, so having an implementation might help make long-polling APIs developed with Go more consistant. I'll see what else I can find.\r\n\r\nTL;DR — It's definitely most popular in XMPP, but it's definitely used elsewhere, if sparingly.\r\n\r\n\u003e It might make more sense in /x/ if we had an XMPP implementation in /x/.\r\n\r\nI'd still love to have that one day and think XMPP is widely applicable outside the instant messaging space as a signaling layer, but that's a discussion for a future proposal.\r\n\r\n\u003e You would also have to make sure there are enough other people available to be reviewers if it lived in /x/.\r\n\r\nReviewers is always a tricky one; I'm not sure what to do about that. It seems like the same people who review websockets commits would potentially also be good candidates to review BOSH commits when / if they have the time?",
	"user": {
		"login": "SamWhited",
		"id": 512573,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-03-09T04:25:47Z",
	"updated_at": "2016-03-09T04:25:47Z"
}
