{
	"id": 142119280,
	"number": 14883,
	"state": "closed",
	"title": "proposal: add `Lookup` method to `reflect.StructTag`",
	"body": "I would like to propose the addition of another method to `reflect.StructTag`. The proposed change is very simple, and I'm happy to produce a design document and a PR. I have filed this issue to see if there is any likelihood of this change being accepted.\r\n\r\nThe `reflect.StructTag` currently has one method, `Get`, which makes it easy to extract the value for the associated key from the tag. What it does not do, however, is indicate if the key exists with an empty value.\r\n\r\nSo in the following example, the `Get` method will return the same value for the `db` tag assocated with the `Name` field as for the `db` tag associated with the `Address` field, but there is a difference in the meaning.\r\n```go\r\nstruct {\r\n    Name    string `db:\"\" json:\"-\"`\r\n    Address string  \r\n}\r\n```\r\n\r\nIt could be argued that this is a pretty simple function and should not be added to the Go standard library. I am suggesting that it should be added because any third-party implementation requires some duplication of the code for the `Get` method in the standard library. Duplicating the code from the Go standard library presents at least two challenges:\r\n* There is an ongoing maintenance overhead of tracking any future changes to the Go standard library. \r\n* The Go BSD license requires distributing the Go copyright notice and conditions with any redistribution of source code. Not a huge deal, but an inconvenience that can be omitted by adding `Lookup` to the standard libary. \r\n\r\nNote also that there was a similar addition in Go 1.5 in the `os` package, where the `LookupEnv` function was introduced to complement the `GetEnv` function.\r\n\r\n## Proposed New Method\r\n**func (StructTag) Lookup**\r\n```go\r\nfunc (tag StructTag) Lookup(key string) (string, bool)\r\n```\r\nLookup returns the value associated with key in the tag string. If the key is present in the tag the value (which may be empty) is returned and the boolean is true. Otherwise the returned value will be empty and the boolean is false. If the tag does not have the conventional format, the value returned by Lookup is unspecified.",
	"user": {
		"login": "jjeffery",
		"id": 458924,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		},
		{
			"name": "Proposal-Accepted"
		}
	],
	"assignee": {
		"login": "adg",
		"id": 8446613,
		"type": "User",
		"site_admin": false
	},
	"comments": 4,
	"closed_at": "2016-03-25T04:54:42Z",
	"created_at": "2016-03-20T01:48:06Z",
	"updated_at": "2016-03-25T04:54:42Z",
	"milestone": {
		"id": 1414133,
		"number": 31,
		"title": "Go1.7"
	}
}
