{
	"id": 54662209,
	"number": 9623,
	"state": "closed",
	"title": "cmd/gorename: unable to build",
	"body": "Hi\r\n\r\nI wanted to try the `gorename` utility but I can't `go get` it:\r\n\r\n```\r\n$ go get code.google.com/p/go.tools/cmd/gorename\r\n# code.google.com/p/go.tools/cmd/gorename\r\n../go/src/code.google.com/p/go.tools/cmd/gorename/main.go:55: undefined: rename.FromFlagUsage\r\n../go/src/code.google.com/p/go.tools/cmd/gorename/main.go:55: const initializer \"gorename: precise type-safe renaming of identifiers in Go source code.\\n\\nUsage:\\n\\n gorename (-from \u003cspec\u003e | -offset \u003cfile\u003e:#\u003cbyte-offset\u003e) -to \u003cname\u003e [-force]\\n\\nYou must specify the object (named entity) to rename using the -offset\\nor -from flag.  Exactly one must be specified.\\n\\nFlags:\\n\\n-offset    specifies the filename and byte offset of an identifier to rename.\\n           This form is intended for use by text editors.\\n\\n-from      specifies the object to rename using a query notation;\\n           This form is intended for interactive use at the command line.\\n\" + rename.FromFlagUsage + \"\\n\\n-to        the new name.\\n\\n-force     causes the renaming to proceed even if conflicts were reported.\\n           The resulting program may be ill-formed, or experience a change\\n           in behaviour.\\n\\n           WARNING: this flag may even cause the renaming tool to crash.\\n           (In due course this bug will be fixed by moving certain\\n           analyses into the type-checker.)\\n\\n-dryrun    causes the tool to report conflicts but not update any files.\\n\\n-v         enables verbose logging.\\n\\ngorename automatically computes the set of packages that might be\\naffected.  For a local renaming, this is just the package specified by\\n-from or -offset, but for a potentially exported name, gorename scans\\nthe workspace ($GOROOT and $GOPATH).\\n\\ngorename rejects renamings of concrete methods that would change the\\nassignability relation between types and interfaces.  If the interface\\nchange was intentional, initiate the renaming at the interface method.\\n\\ngorename rejects any renaming that would create a conflict at the point\\nof declaration, or a reference conflict (ambiguity or shadowing), or\\nanything else that could cause the resulting program not to compile.\\n\\n\\nExamples:\\n\\n% gorename -offset file.go:#123 -to foo\\n\\n  Rename the object whose identifier is at byte offset 123 within file file.go.\\n\\n% gorename -from '\\\"bytes\\\".Buffer.Len' -to Size\\n\\n  Rename the \\\"Len\\\" method of the *bytes.Buffer type to \\\"Size\\\".\\n\\n---- TODO ----\\n\\nCorrectness:\\n- handle dot imports correctly\\n- document limitations (reflection, 'implements' guesswork).\\n- sketch a proof of exhaustiveness.\\n\\nFeatures:\\n- support running on packages specified as *.go files on the command line\\n- support running on programs containing errors (loader.Config.AllowErrors)\\n- allow users to specify a scope other than \\\"global\\\" (to avoid being\\n  stuck by neglected packages in $GOPATH that don't build).\\n- support renaming the package clause (no object)\\n- support renaming an import path (no ident or object)\\n  (requires filesystem + SCM updates).\\n- detect and reject edits to autogenerated files (cgo, protobufs)\\n  and optionally $GOROOT packages.\\n- report all conflicts, or at least all qualitatively distinct ones.\\n  Sometimes we stop to avoid redundancy, but\\n  it may give a disproportionate sense of safety in -force mode.\\n- support renaming all instances of a pattern, e.g.\\n  all receiver vars of a given type,\\n  all local variables of a given type,\\n  all PkgNames for a given package.\\n- emit JSON output for other editors and tools.\\n\" is not a constant\r\n```\r\n\r\nMy Go runtime environment: `go version go1.4.1 darwin/amd64`. Let me know if you need me to be more specific.",
	"user": {
		"login": "falzm",
		"id": 1122379,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 2,
	"closed_at": "2015-01-17T14:20:53Z",
	"created_at": "2015-01-17T13:47:52Z",
	"updated_at": "2016-06-25T01:58:46Z"
}
