{
	"id": 51288862,
	"number": 8914,
	"state": "closed",
	"title": "os: make Rename atomic on Windows",
	"body": "by **MartyMacGyver**:\n\n\u003cpre\u003eAs described in bug 3366 (\u003ca href=\"https://golang.org/issue/3366)\"\u003ehttps://golang.org/issue/3366)\u003c/a\u003e the\nos.Rename() function doesn't work in Windows in a way that is consistent with other\nOSes. In Posix-compliant OSes, the os.Rename() function works properly (and atomically),\nincluding when replacing an existing file. In Windows this does not work correctly as\ndesigned and fails when replacing an existing file. Since it has been decided that this\nfunctionality for Windows will not be implemented in the existing os.Rename(), it is\ndesirable to have an equivalent os.Replace() function that works across platforms. In\nthe case of non-Windows platforms it would be a simple wrapper for os.Rename(), but in\nthe case of Windows it would call the proper OS-level APIs to perform the operation in\nan equivalent fashion.\n\nOther languages have encountered and successfully tackled this same problem in Windows.\nAs one example, the report of the same issue in Python led to a detailed discussion and\nultimately had a successful resolution (\u003ca href=\"http://bugs.python.org/issue8828)\"\u003ehttp://bugs.python.org/issue8828)\u003c/a\u003e. The\nworkaround used in other Go projects follows the same pattern - effectively creating an\nos.Replace() function for this circumstance, using the Windows MoveFileEx API for\nWindows platforms and falling through to os.Rename() for the others.\n\nSince os.Rename() cannot be enhanced to handle Windows cases in an equivalent fashion,\nan os.Replace() function that satisfies the same criteria would prevent developers from\nre-inventing the same wheel in very similar ways way simply to avoid the disjoint\nfunctionality in os.Rename() when it comes to this relatively common use case.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"comments": 10,
	"closed_at": "2015-11-24T19:10:37Z",
	"created_at": "2014-10-09T08:01:59Z",
	"updated_at": "2015-11-24T19:10:37Z",
	"milestone": {
		"id": 1096159,
		"number": 24,
		"title": "Go1.6"
	}
}
