{
	"id": 97542530,
	"number": 11890,
	"state": "open",
	"title": "runtime: Additional Allocator Metrics in `runtime.MemStats`",
	"body": "Hi, I am wondering if it would be amenable to include several additional core metrics in `runtime.MemStats`, namely the following measures:\r\n\r\n1. No. of spans pending being released by size class.\r\n\r\n    This helps server authors understand the discrepancy between reported\r\n    heap reservation/allocation versus process RSS.\r\n\r\n2. No. of live spans (with active allocations contained therein) by size class.\r\n\r\n    Essential corollary for no. 1.\r\n\r\n3. Measure of sum of span occupancy by size class.\r\n\r\n    This helps server and runtime authors understand level of span reuse\r\n    and divine potential problems with heap fragmentation viz-a-viz no. 2.\r\n\r\n4. Sum of span allocations by size class (not of inner object allocations).\r\n\r\n    This helps server authors understand the aggregate throughput of\r\n    memory flow in realtime, a measure of efficiency that is useful to\r\n    capture when comparing releases and automated canary tests.\r\n\r\n5. Sum of span releases by size class (not of inner object allocations).\r\n\r\n    Useful corollary for no. 4.\r\n\r\n6. Summary statistics about age for spans by size classes: min, median, average, max.\r\n\r\n    Throughput in no. 4 and no. 5 is useful, but this takes the level of detail to a\r\n    deeper level.\r\n\r\n7. Cumulative sums of individual allocations made for each span size class.\r\n\r\n    Useful throughput measure for individual allocations.\r\n\r\nThese would be inordinately beneficial in gross measurement of fleet memory allocator performance as well as offer server authors deeper telemetric insights into the lifecycles of their allocations.  pprof is great for one-off diagnosis but not real-time analytics of the fleet.\r\n\r\nI would be happy coming to compromise on these, especially to enhance the language and requirements as well as to possibly volunteer time in the implementation of these representations should we come to agreement.",
	"user": {
		"login": "matttproud",
		"id": 46149,
		"type": "User",
		"site_admin": false
	},
	"comments": 6,
	"created_at": "2015-07-27T19:55:33Z",
	"updated_at": "2015-12-03T11:52:17Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	}
}
