{
	"id": 145004960,
	"body": "I'm placing my answers to your questions about code gen + build here.\r\n\r\n\u003e what's the output of the gobind? (source code? compiled object or class files? archive?)\r\n\r\nThe outputs are still source files.\r\n\r\n\u003e where should the gobind output go (so, the following gomobile build command finds the output of previous gobind commands and IDEs build task)? Every IDE has different assumptions on source code layout, or default build framework.\r\n\r\nThis is an important question and one I didn't address in my comment. I don't think IDEs need to automatically know about the location of the source. The only thing that needs to know is the gomobile tool so that it can pick up these files for the build step. This can be achieved with a command line flag.\r\n\r\n\u003e Use of buildmode flag in gomobile build is interesting, and I want to hear more about how it connects the main package and the product of previous gobind+IDE runs\r\n\r\nIt can pick up the location of the files using a command line flag. The IDE will will pick the output of gomobile build in the same way it picks up the output of gomobile bind. The IDE can run `gomobile build` automatically (XCode Run Script Phase/Gradle plugin) whenever it builds the SDK app. However, the more I think about it this can be done in `gomobile bind` as well.\r\n\r\n\u003e I don't understand what prevents the use of go generate currently.\r\n\r\nNothing whatsoever :). However, my understanding is that go generate is intended to be used for pre-build steps such as code generation. Library authors can then commit generated source to their library source tree. It feels like a misuse of go generate to use it to generate a .framework or .aar. Those operations feel like they should be done by go build/gomobile build/Makefile/build.gradle.\r\n\r\nEDIT: I created https://github.com/golang/go/issues/12819 to track my main concerns about code generation in gobind. Most of what I would like can be achieved without separating the two phases.\r\n",
	"user": {
		"login": "sridharv",
		"id": 326998,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-10-02T12:34:58Z",
	"updated_at": "2015-10-02T12:52:05Z"
}
