{
	"id": 151753208,
	"body": "Sure, it seems the tool collapses categories with many items together to reduce the noise at the top level. So, if we do ```go doc syscall```, it collapses the long list of constants to be a single one-line entry ```const AF_ALG = 0x26 ...```. If a person wanted to know more about *all* the constants in that block, they can simply do ```go doc syscall AF_ALG``` and then it will proceed to print all the constants. I think what the doc tool does for constants and variable block is great. This issue that I've filed is about extending that philosophy to slices as well.\r\n\r\nI mentioned ```image/color/palette``` as an example of a library where printing all the contents is not necessary. Someone doing ```go doc image/color/palette``` probably only cares about what palettes exist and not what the *values* of the palette are. If they do care about the actual values, they can be more specific and ask for ```go doc image/color/palette Plan9```.\r\n\r\nAnother practical example (and this was my original motivation for this change) was using ```go doc -u``` in a package I'm working on to keep track of the different private methods that exist. The package I'm working on has quite a large number of look-up tables, and it's really distracting needing to ignore all of the LUTs in order to get to private methods I care about. Even within the standard library, you can see noisiness by doing ```go doc -u compress/flate``` and it used to be worse before a [large LUT was removed](https://github.com/golang/go/commit/5c78589b69c87f25a4792d9c8a1446294c07600e).\r\n\r\nFurthermore, this is more in line with what the help for the doc tool says (emphasis mine):\r\n\u003e Doc prints the documentation comments associated with the item identified by its\r\n\u003e arguments (a package, const, func, type, var, or method) followed by a **one-line**\r\n\u003e summary of each of the first-level items \"under\" that item (package-level\r\n\u003e declarations for a package, methods for a type, etc.).",
	"user": {
		"login": "dsnet",
		"id": 6354026,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-10-28T07:38:47Z",
	"updated_at": "2015-10-28T07:38:47Z"
}
