{
	"id": 162315045,
	"number": 16185,
	"state": "closed",
	"title": "proposal: golang.org/x/image/font/inconsolata package",
	"body": "The golang.org/x/image/font/... packages should provide a \"batteries included\" bitmap font, so that simple Go programs can draw some text easily without having to find (and depend on) both a \"third party\" font library (i.e. Go's freetype, which uses the Freetype license, so it can't be in the stdlib or golang.org/x) and third party font files (whose location and availability are OS-dependent at best).\r\n\r\nCurrently, that default font is based on the classic X11 fixed font, in the public domain. It's essentially a 1 bit per pixel font, even though Go's image.Alpha format for glyphs is 8bpp. It's also not the prettiest font.\r\n\r\nI propose to pre-render a bitmap version of the Inconsolata font, and provide it as a package of Go source code, that would work with standard Go tools like \"go get\". The package path would be golang.org/x/image/font/inconsolata. This would export two variables, which users would refer to as inconsolata.Regular8x16 and inconsolata.Bold8x16, which implement the font.Face interface from golang.org/x/image/font.\r\n\r\nThat Go source code version of the Inconsolata bitmap data would be licensed the same as the rest of the Go standard library: https://golang.org/LICENSE. This is a different license than the SIL Open Font License that Inconsolata was released under. However, the fonts are copyright Raph Levien (who is employed by Google) and Cyreal, both have signed the CLA, and both approve of this specific \"package inconsolata\" Go source code proposal.\r\n\r\nInconsolata's home page is at http://www.levien.com/type/myfonts/inconsolata.html\r\n",
	"user": {
		"login": "nigeltao",
		"id": 8565232,
		"type": "User",
		"site_admin": false
	},
	"comments": 18,
	"closed_at": "2016-06-30T01:20:15Z",
	"created_at": "2016-06-26T06:35:02Z",
	"updated_at": "2016-07-23T07:31:31Z",
	"reactions": {
		"total_count": 2,
		"+1": 2
	}
}
