{
	"id": 215381021,
	"body": "I just checked out your sample. Sorry I should have done that before.\n\nThe root cause is you are using go run, which does not support vendoring.\n\nI recommend you lay out your code in the prescribed package format as\ndocumented here https://golang.org/doc/code.html\n\nThen compile and run your program.\n\nOn Thu, Apr 28, 2016 at 8:29 PM, Dave Cheney \u003cdave@cheney.net\u003e wrote:\n\n\u003e You shouldn't need docker to compile your tests -- they may not pass, but\n\u003e you'll at least confirm that you can compile your code.\n\u003e\n\u003e On Thu, Apr 28, 2016 at 8:28 PM, Tit Petric \u003cnotifications@github.com\u003e\n\u003e wrote:\n\u003e\n\u003e\u003e I don't have an environment outside of docker where I can run the tests.\n\u003e\u003e If I get one, I'll post the results, and if you have one, please just stick\n\u003e\u003e the sources from the tgz into $GOPATH/src/app and run go run main.go to\n\u003e\u003e see if the error occurs with you.\n\u003e\u003e\n\u003e\u003e But, my sanity check here tells me that you shouldn't be so suspicious, go\n\u003e\u003e env reports /go (same as $GOPATH in bash), sources don't reference some\n\u003e\u003e /other or ../other locations. I might be quite new at this, but I'm\n\u003e\u003e pretty sure that nowhere in about 10-20 lines of code I'm going *outside*\n\u003e\u003e of GOPATH, and I'm not touching it in any way. The obvious question is\n\u003e\u003e \"what's the correct way to set up GOPATH?\" if the official docker image\n\u003e\u003e doesn't do this. Source Dockerfile is here, if you can spot the issue:\n\u003e\u003e https://github.com/docker-library/golang/blob/master/1.6/Dockerfile\n\u003e\u003e\n\u003e\u003e I'll attach my results if I can get my hands on on a local install of go\n\u003e\u003e somewhere.\n\u003e\u003e\n\u003e\u003e —\n\u003e\u003e You are receiving this because you were mentioned.\n\u003e\u003e Reply to this email directly or view it on GitHub\n\u003e\u003e \u003chttps://github.com/golang/go/issues/15478#issuecomment-215380064\u003e\n\u003e\u003e\n\u003e\n\u003e\n",
	"user": {
		"login": "davecheney",
		"id": 7171,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-04-28T10:33:11Z",
	"updated_at": "2016-04-28T10:33:11Z"
}
