{
	"id": 85361158,
	"body": "I lied. I can reproduce it here. I did git bisect and that is what I find:\r\n\r\nb115c35ee337ac6026539802d2ff085949dd1919 is the first bad commit\r\ncommit b115c35ee337ac6026539802d2ff085949dd1919\r\nAuthor: Russ Cox \u003crsc@golang.org\u003e\r\nDate:   Wed Mar 18 17:26:36 2015 -0400\r\n\r\n    cmd/internal/gc: move cgen, regalloc, et al to portable code\r\n\r\n    This CL moves the bulk of the code that has been copy-and-pasted\r\n    since the initial 386 port back into a shared place, cutting 5 copies to 1.\r\n\r\n    The motivation here is not cleanup per se but instead to reduce the\r\n    cost of introducing changes in shared concepts like regalloc or general\r\n    expression evaluation. For example, a change after this one will\r\n    implement x.(*T) without a call into the runtime. This CL makes that\r\n    followup work 5x easier.\r\n\r\n    The single copy still has more special cases for architecture details\r\n    than I'd like, but having them called out explicitly like this at least\r\n    opens the door to generalizing the conditions and smoothing out\r\n    the distinctions in the future.\r\n\r\n    This is a LARGE CL. I started by trying to pull in one function at a time\r\n    in a sequence of CLs and it became clear that everything was so\r\n    interrelated that it had to be moved as a whole. Apologies for the size.\r\n\r\n    It is not clear how many more releases this code will matter for;\r\n    eventually it will be replaced by Keith's SSA work. But as noted above,\r\n    the deduplication was necessary to reduce the cost of working on\r\n    the current code while we have it.\r\n\r\n    Passes tests on amd64, 386, arm, and ppc64le.\r\n    Can build arm64 binaries but not tested there.\r\n    Being able to build binaries means it is probably very close.\r\n\r\n    Change-Id: I735977f04c0614f80215fb12966dfe9bbd1f5861\r\n    Reviewed-on: https://go-review.googlesource.com/7853\r\n    Reviewed-by: Brad Fitzpatrick \u003cbradfitz@golang.org\u003e\r\n\r\nAlex",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-03-24T06:23:50Z",
	"updated_at": "2015-03-24T06:23:50Z"
}
