{
	"id": 146931348,
	"number": 15194,
	"state": "closed",
	"title": "crypto/x509: AuthorityKeyId on self-signed certificates",
	"body": "The crypto/x509 package is setting the AuthorityKeyId by default for all certificates including CA certificates. While this is not wrong according to RFC5280 section 4.2.1.1, it states that setting the authorityKeyIdentifier is optional for self-signed certificates.\r\n\r\n\u003e The keyIdentifier field of the authorityKeyIdentifier extension MUST\r\n\u003e    be included in all certificates generated by conforming CAs to\r\n\u003e    facilitate certification path construction.  **There is one exception;\r\n\u003e    where a CA distributes its public key in the form of a \"self-signed\"\r\n\u003e    certificate, the authority key identifier MAY be omitted.**  The\r\n\u003e    signature on a self-signed certificate is generated with the private\r\n\u003e    key associated with the certificate's subject public key.  (This\r\n\u003e    proves that the issuer possesses both the public and private keys.)\r\n\u003e    In this case, the subject and authority key identifiers would be\r\n\u003e    identical, but only the subject key identifier is needed for\r\n\u003e    certification path building.\r\n\u003e \r\n\r\nI would like to remove the AuthorityKeyId from self-signed certificates to save about 20+ bytes in these certificates which is useful in constraint environments.\r\n\r\nTo adopt this change a small change to the following condition is required:\r\nhttps://github.com/golang/go/blob/master/src/crypto/x509/x509.go#L1590\r\n\r\nI'm happy to submit this change if agreed that this is an improvement to Go.\r\n",
	"user": {
		"login": "vanbroup",
		"id": 722070,
		"type": "User",
		"site_admin": false
	},
	"assignee": {
		"login": "agl",
		"id": 21203,
		"type": "User",
		"site_admin": false
	},
	"comments": 2,
	"closed_at": "2016-04-14T16:52:10Z",
	"created_at": "2016-04-08T13:37:41Z",
	"updated_at": "2016-04-14T16:52:10Z",
	"milestone": {
		"id": 1055141,
		"number": 6,
		"title": "Unplanned"
	},
	"reactions": {
		"total_count": 2,
		"+1": 2
	}
}
