{
	"id": 133157727,
	"number": 14304,
	"state": "open",
	"title": "proposal: x/perf and x/perfdata: new subrepos",
	"body": "**I propose to rename the current x/benchmarks subrepo to x/perf** and then broaden its scope to include performance analysis tools such as the ones that Austin and I have developed over the past few years and keep in personal GitHub repos today. \r\n\r\nThe name x/benchmarks is too long and too specific: renaming it lets us correct both these problems, making it more reasonable to include general performance analysis tools, not just benchmarks. Of course, code for running and analyzing benchmarks, along with actual benchmarks, will still be a large part of the repository.\r\n\r\nThe specific initial structure I expect is:\r\n\r\n\tx/perf/\r\n\t    # benchmarks, each a standalone program writing standard benchmark output\r\n\t    benchmarks/\r\n\t        build\r\n\t        compile\r\n\t        garbage\r\n\t        json\r\n\t        http\r\n\t        ...\r\n\t        \r\n\t    # performance analysis commands\r\n\t    cmd/\r\n\t        benchstat   # currently rsc.io/benchstat\r\n\t        benchrun    # currently github.com/aclements/go-misc/benchmany run\r\n\t        benchplot   # currently github.com/aclements/go-misc/benchmany plot\r\n\t        benchlist   # currently github.com/aclements/go-misc/benchmany list\r\n\t        perf2pprof  # convert Linux perf format to Go pprof, currently unpublished\r\n\t        ...\r\n\r\n\t    bench           # package for reading standard benchmark files and benchmark databases \r\n\r\nMore benchmarks, comands, and packages would be added over time.\r\n\r\nThe change would be executed by creating a new x/perf repo, pushing the current x/benchmarks repo to it, and then moving files in the repository to reflect the new structure. Doing it this way preserves the change history (including commit hashes) for the existing benchmarks. \r\n\r\nWe could keep the x/benchmarks repo read-only for some transition period before deleting it, although I think very few people outside the core Go team refer to it.\r\n\r\nI do not intend to write a design doc in x/proposal about this. Instead, some version of this information will go into a README in the new repo.\r\n\r\n**I also propose to create a new x/perfdata repo** to hold performance data, the raw data that might drive a new Go performance dashboard. The idea behind putting the perfdata in its own repo is so that people working on or wanting to obtain the tools need not download all of our (potentially large) data, but people who do want to try a new analysis or create a new view of the data can get it all and experiment. \r\n\r\nIn fact, the x/perfdata repo is meant to be the defined interface between the related but very different jobs of collecting reliable benchmark data and performing useful analyses or creating useful presentations of that data. I the main reason the previous perf dashboard failed is that we did an OK job on data collection and a bad job on data presentation, and we didn't make the raw data available (it was stored in an App Engine datastore accessible only to the app developers). The proposed repo allows some people to work on collecting data and others (anyone!) to experiment with new ways to analyze or present it.\r\n\r\n/cc @aclements @dvyukov @RLH @randall77 @dr2chase ",
	"user": {
		"login": "rsc",
		"id": 104030,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		},
		{
			"name": "Proposal-Accepted"
		}
	],
	"comments": 5,
	"created_at": "2016-02-12T04:53:28Z",
	"updated_at": "2016-08-22T23:31:51Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
