{
	"id": 158639813,
	"body": "Neat. Note that you can also use x/text/internal/ucd to further simplify the code. It parses UCD files for you.\r\n\r\nI think It makes more sense for you to submit directly in golang.org/x/text directly so we can make use of the Gerrit code review etc.  Just specify in the package comments that the package is under full development and that the API may change.\r\n\r\nAs for the package name: the text repo has mostly adopted the convention of naming packages after functionality instead of standards.  Noticeable exceptions are the packages for handling data formats (cldr, ucd).  I agree secure.FreeForm is a bit confusing/misleading. Let's stick with precis for now and decide before the \"under construction label\" is removed. (Also precis is actually a word as well, related to text nonetheless, so this may be even more confusing).\r\n\r\nAs for naming, I find Enforce and PrepareString somewhat misleading names myself. Also, it is more likely that the reader of code understands Go convention than PRECIS convention. It should be clear in the documentation that the  Go names are related to respective PRECIS names.\r\n\r\nAlso, I'm not entirely agreeing with the standard. Valid/Prepare should not just return false if a string contains characters disallowed by the underlying Class, but also, in this case, for characters disallowed by a profile or even a transformation associated with a profile (normalization, case/width folding, etc. always succeed, but enforcing single script might not). So not following PRECIS convention with naming has the additional benefit that a PRECIS expert will read the documentation to see what the method does exactly. So using Go names is a double win. :)\r\n\r\nAs for Valid returning a bool: I think the error would be useful, but it is indeed more consistent to get a bool. Note that the user could always get the error from the Transform, although this would not be as efficient.\r\n",
	"user": {
		"login": "mpvl",
		"id": 6445383,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-11-21T13:18:12Z",
	"updated_at": "2015-11-21T13:18:12Z"
}
