{
	"id": 176517893,
	"number": 17082,
	"state": "open",
	"title": "Proposal: runtime: drop support for linux/armv5E?",
	"body": "Since the introduction of Linux/ARM support, the minimum required\r\nhardware to run Go with Linux was ARMv5E, e.g.ARM926.\r\n\r\nAt that time, this choice makes sense because ARM9 systems are\r\nstill around, and we even had an ARMv5E builder for some time.\r\n\r\nHowever, ARMv5E lacks some important atomic instruction support.\r\nLDREX/STREX is introduced in ARMv6 (ARM11), and\r\nLDREXB/STREXB, LDREXH/STREXH, LDREXD/STREXD are introduced\r\nin ARMv6K. Without these instructions, we resort to emulating the\r\nrequired 64-bit atomic operation using 57 spinlocks selected by address\r\n(which uses mod and is a slow operation on ARM) [see https://tip.golang.org/src/runtime/internal/atomic/atomic_arm.go]\r\n\r\nI don't know how many projects out there that still uses ARMv5E and\r\nGo, but I don't expect many. I propose to increase the minimum\r\narchitectural requirement to ARMv6 (and possibly ARMv6K), so that\r\nat least we can use LDREX/STREX, which should help a lot with the\r\nnew atomic-heavy runtime.\r\n\r\nTo summarize the benefits,\r\n1. if we raise requirement to ARMv6, then we can intrinsicify 32-bit atomics.\r\n2. if we raise requirement to ARMv6K, then in addition to 1, we no long can\r\nremove the emulated 64-bit atomics from runtime by using the native\r\nLDREXD/STREXD instructions, but also intrinsicify them in the compiler\r\nlike other ports.\r\n\r\nIf you still use Go on ARMv5E systems, please help by listing the processor\r\nmodel used. Thanks.\r\n\r\nPS: other supported OSes do require ARMv6K as only Linux provides\r\nrequired 64-bit cas kernel helper for sync/atomic. Another way to go\r\nis to modify the runtime/internal/atomic package to:\r\n1. use LDREXD/STREXD on non-linux,\r\n2. use kernel cas64 on linux.\r\nBut this solution will complicate maintaining the code and as we don't\r\nhave a real ARMv5E builder, I think the support is certainly going to\r\nbitrot.\r\n\r\nPS2: The core used by Raspberry Pi 1, ARM1176JZF-S, is ARMv6K,\r\nso this proposal won't affect Raspberry Pi 1, the most popular ARMv6\r\nsystems.",
	"user": {
		"login": "minux",
		"id": 135652,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		}
	],
	"comments": 13,
	"created_at": "2016-09-13T00:22:26Z",
	"updated_at": "2016-09-14T14:53:32Z",
	"milestone": {
		"id": 1709363,
		"number": 38,
		"title": "Go1.8"
	},
	"reactions": {
		"total_count": 1,
		"+1": 1
	}
}
