{
	"id": 245513230,
	"body": "\u003e And what about people writing in languages that are not, er, English? :P\r\n\r\nThat's a valid point, and I think it should be considered.\r\n\r\n\u003e We should use the same string that is recognized by GitHub.\r\n\r\nThe outcome _may_ happen to be a string that is recognized by GitHub with their current [code in linguist](https://github.com/github/linguist/blob/473282d/lib/linguist/generated.rb#L241), but I respectfully disagree with this being a _high priority criteria_ (if that's what was implied, I'm not sure).\r\n\r\nAs I mentioned in the proposal, what GitHub came to recognize as a Go generated file had a high degree of luck and variance in it (and circular arguments):\r\n\r\n\u003e This leads to circular arguments and PRs/CLs. For example, see the discussion and the change itself at https://go-review.googlesource.com/#/c/15073/. It started from https://github.com/github/linguist/blob/473282d/lib/linguist/generated.rb#L241, which led to CL 15073. That lead to https://github.com/shurcooL/vfsgen/commit/b2aab1c20b69a97790ee44d826c7f44baa852382 and https://github.com/shurcooL/go/commit/43b216689b91e7e2d2c6b7dd0971ad4625384a81. But the initial GitHub behavior came from protobuf disclaimers.\r\n\r\nSpecifically, see these two PRs that have shaped what GitHub recognizes today:\r\n\r\n1. https://github.com/github/linguist/pull/2152/files - Detect Go files generated by *Protocol Buffers*\r\n2. https://github.com/github/linguist/pull/2426/files - Detect Go files generated by *go-bindata*\r\n\r\nNotice the motivation of those PRs (first one was to detect protobuf generated files, and the second was modeled after the first to detect go-bindata output). Also notice how easy it was to get them merged in.\r\n\r\nNow, maybe we got lucky with the above sequence of events and what github recognizes today is a great format. But if not, I think it's a relatively low effort followup to submit a PR to GitHub's linguist – similar to those 2 PRs above – to make any necessary corrections after this proposal is resolved and Go has an officially recommended and recognized way to indicate that a file is generated.\r\n\r\nCompare that with the alternative of Go using a potentially suboptimal mechanism for many, many years to come.\r\n\r\n\u003e Seems like a reasonable way to address the problem that IDEs that depend on tools are too fussy about generated code.\r\n\u003e\r\n\u003e [**robpike**](https://github.com/robpike) self-assigned this [23 days ago](https://github.com/golang/go/issues/13560#event-756335681)\r\n\r\nI am very happy with that outcome and I trust whatever Rob Pike comes up with is going to be a great resolution for this issue.",
	"user": {
		"login": "shurcooL",
		"id": 1924134,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-08T07:12:42Z",
	"updated_at": "2016-09-08T07:28:45Z"
}
