{
	"id": 51282816,
	"number": 4910,
	"state": "closed",
	"title": "runtime: copy and expand stacks instead of splitting them",
	"body": "\u003cpre\u003eSeemingly innocuous changes in recursive functions increased or decreased benchmark time\ndramatically. Sometimes, benchmark time would increase 20%-100%, when we changed the\norder of initialization of variables or declared a temporary variable explicitly.\n\nFurther analysis showed that this was a side-effect of the segmented stacks splitting.\n\nDuring discussion, Russ mentioned that there was some work that could be done to try to\nalleviate this. \n\nFiling this issue to track it.\n\n========== Russ message from Google Groups discussion ==========\nI think there could be some work done on choosing how big\na stack to allocate, which would perhaps relieve some of the\ninner stack split checks.\n\nThere was some work at Berkeley a few years ago [1] that looked\nat doing analysis of the program's call graph to remove some\nstack split checks and to choose stack sizes, and I've been\nmeaning to look into whether we can do something smart like\nthat in Go's split stacks.  But ultimately if you end up triggering\na stack split in a tight loop you're not going to run as fast as\nif you don't.\n\nTail call optimization is not mandated by the spec, is not\npossible in functions with defer, and makes debugging harder.\nI'm glad that we don't have that in the 6g compiler.\n\nI've thought about runtime heuristics for stack sizes, but we\ndon't have enough information at stack split time to move\nthe stack, so by the time you realize 'it would be nice if the\ncurrent frame were bigger' it's too late.\n\nRuss\n\n[1] \u003ca href=\"http://capriccio.cs.berkeley.edu/pubs/capriccio-sosp-2003.pdf\"\u003ehttp://capriccio.cs.berkeley.edu/pubs/capriccio-sosp-2003.pdf\u003c/a\u003e\n==========\n\nMore Context is at: \n  \u003ca href=\"https://groups.google.com/d/msg/golang-dev/6Vs1sxmSSb0/CtgsMHzAgZwJ\"\u003ehttps://groups.google.com/d/msg/golang-dev/6Vs1sxmSSb0/CtgsMHzAgZwJ\u003c/a\u003e\n  \u003ca href=\"https://groups.google.com/d/msg/golang-dev/vxRuA-gbwdw/xiaDzM586VMJ\"\u003ehttps://groups.google.com/d/msg/golang-dev/vxRuA-gbwdw/xiaDzM586VMJ\u003c/a\u003e\u003c/pre\u003e",
	"user": {
		"login": "ugorji",
		"id": 1222082,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 6,
	"closed_at": "2015-01-06T16:29:39Z",
	"created_at": "2013-02-25T17:20:27Z",
	"updated_at": "2016-06-24T22:34:04Z"
}
