{
	"id": 66074553,
	"body": "\u003ca id=\"c2\"\u003e\u003c/a\u003eComment 2:\n\n\u003cpre\u003eCopy/paste of an internal G+ comment I got about this:\n\n-----------\n\nAs per these threads, it's not totally specified by HTTP itself:\n\u003ca href=\"http://lists.w3.org/Archives/Public/ietf-http-wg/2011AprJun/0489.html\"\u003ehttp://lists.w3.org/Archives/Public/ietf-http-wg/2011AprJun/0489.html\u003c/a\u003e\n\u003ca href=\"http://lists.w3.org/Archives/Public/ietf-http-wg/2011JulSep/0014.html\"\u003ehttp://lists.w3.org/Archives/Public/ietf-http-wg/2011JulSep/0014.html\u003c/a\u003e\n\nSee HTML which specifies some part of it:\n\u003ca href=\"http://www.whatwg.org/specs/web-apps/current-work/multipage/fetching-resources.html\"\u003ehttp://www.whatwg.org/specs/web-apps/current-work/multipage/fetching-resources.html\u003c/a\u003e\n\"\"\"\nFirst, apply any relevant requirements for redirects (such as showing any appropriate\nprompts). Then, redo main step, but using the target of the redirect as the resource to\nfetch, rather than the original resource. For HTTP requests, the new request must\ninclude the same headers as the original request, except for headers for which other\nrequirements are specified (such as the Host header). [HTTP]\n\"\"\"\n\nAs far as Chrome's HTTP stack, we only preserve embedder headers. Here's the algorithm:\n* Embedder (Chrome/WebKit) specifies \"extra\" request headers in the URL request. A URL\nrequest follows HTTP redirects, so since these are tied to the URL request, they are\nsent on all HTTP requests.\n* All other headers are generated internally during HTTP processing:\n  - At the HTTP transaction level (actually, in URLRequestHttpJob), we add some headers, like cookies.\n  - At the network transaction level, we generate the Host header and others. This is also the level at which we do authorization. We re-run the authorization algorithm there, which includes querying our auth cache and re-applying a token if applicable.﻿\u003c/pre\u003e",
	"user": {
		"login": "bradfitz",
		"id": 2621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-02-13T20:55:23Z",
	"updated_at": "2014-12-08T10:25:29Z"
}
