{
	"id": 59219334,
	"number": 10021,
	"state": "closed",
	"title": "community, collaboration: Go's official maintainers and library / web framework authors",
	"body": "Coming from the land of PHP, I have seen a lot of efforts from the community to fix / improve / push the development of its. Those efforts also lead to the tightly collaboration between language's designers / maintainers and lib / framework authors for future releases.\r\n\r\nSome PHP community's \"notable efforts\":\r\nhttp://www.php-fig.org/\r\nhttp://www.phptherightway.com/\r\nhttps://packagist.org/\r\nhttps://getcomposer.org/\r\nhttps://thephpleague.com/\r\n\r\nFortunately, Golang was started as a very modern and well-[designed/backed/advocated] programming language. But after trying a lot of web frameworks (last month), it seems that we are lacking well-defined standard or the \"right\" way to solve some common problems (web development? deployment?). Day by day, I have to seek for the \"fragmented\" knowledges which are shared by a lot of Gophers (thanks to their efforts). It's very time consuming and painful for those who aren't living near any Golang's \"hotspot\" communities like me.\r\n\r\n**I wonder is there any collaboration between Go's offficial maintainers and the library/framework authors? If you have been doing, it's very exciting to know.**\r\n\r\nAs an advocate of Go, I hope for a future that I could do anything with it on the server-side without considering about other languages and it's easier for those who don't have a solid Computer Science background to entry. In my point of view, there are many tasks/problems that beginners shouldn't try to solve themself, or there are many problems that we can solve without the overhead of understanding \"how's the very complex things at the low-level works\".\r\n\r\n**Anyway, if you don't see this as an issue of Go, just ignores it. Maybe, it's just my own problems :D**",
	"user": {
		"login": "redstrike",
		"id": 2168227,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 2,
	"closed_at": "2015-02-27T11:16:33Z",
	"created_at": "2015-02-27T10:39:37Z",
	"updated_at": "2016-06-25T02:02:09Z"
}
