{
	"id": 112840517,
	"number": 13021,
	"state": "closed",
	"title": "proposal: x/net/context: move to the standard library",
	"body": "The context package provides a standard interface for passing request-scoped values, deadlines, and cancelation information across package boundaries.  Examples of request-scoped values include authentication information, golang.org/x/net/trace.Traces,  and Dapper-like distributed tracing IDs.  Context is widely used: [godoc.org](https://godoc.org/golang.org/x/net/context) lists [1500+ imports](https://godoc.org/golang.org/x/net/context?importers).  Context is a critical element in RPC systems like Go-kit's [Endpoint](https://godoc.org/github.com/go-kit/kit/endpoint) interface and [gRPC Go](https://github.com/grpc/grpc-go).\r\n\r\nWe (@sajmani and @bradfitz) would like to incorporate Context into standard library packages (see list below).  Standard library packages cannot depend on external packages, so we propose moving the context package into the standard library as package \"context\".\r\n\r\nOne complication with moving this package is that interfaces that currently mention golang.org/x/net/context.Context will not be satisfied by implementations that use context.Context.  For example, gRPC service implementations will fail to compile if we change the Go protocol compiler to use context.Context.  We will need to provide some way to manage this transition.\r\n\r\nPotential uses of Context in the standard library:\r\n* Add Context to http.Request to support canceling HTTP requests and passing request-scoped values\r\n* Add Context to net.Dialer to support canceling Dial\r\n* Add Context to functions in database/sql and interfaces in database/sql/driver to support canceling database operations and passing request-scoped values\r\n* Generally, add Context to any function that supports cancelation and may be implemented using RPCs\r\n\r\n",
	"user": {
		"login": "Sajmani",
		"id": 9734877,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		}
	],
	"assignee": {
		"login": "Sajmani",
		"id": 9734877,
		"type": "User",
		"site_admin": false
	},
	"comments": 7,
	"closed_at": "2016-07-16T22:50:10Z",
	"created_at": "2015-10-22T16:25:28Z",
	"updated_at": "2016-07-16T22:50:10Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	},
	"reactions": {
		"total_count": 1,
		"+1": 1
	}
}
