{
	"id": 174395988,
	"number": 16941,
	"state": "closed",
	"title": "restful retorna 204 sin contenido en el body",
	"body": "Tengo el siguiente problema: Quiero procesar una función que retorne 204 en el código de estado HTTP y la función no finaliza nunca.\r\n\r\nEl problema, es que yo estoy retornando en la cabecera del mensaje, en el campo authorization, un token para que el cliente pueda procesar los futuros recursos rest.\r\n\r\nEste recurso, no necesita retornar absolutamente nada en el cuerpo del mensaje, pero sí necesito retornar en la cabecera una llave (un token).\r\nAl hacer esto, se queda colgado el servicio.\r\n\r\nLa referencia del código de estado 204 es clara, no debe retornar contenido en el cuerpo. Solo en el cuerpo. Pero sí es posible retornar información en campos de la cabecera del mensaje.\r\n\r\nEn C# puedo hacerlo. Puedo retornar 204 sin contenido en el cuerpo y con contenido en la cabecera.\r\n\r\nActualmente con golang, tengo que retornar un objeto de manera forzada que no me representa nada de valor, ya que estoy obligado a retornar 200 con algún valor en el cuerpo del mensaje.\r\n\r\nLa cuestión, es que yo tengo una función que se llama \"Retornar\", el cual me resuelve estas cuestiones de manera automática. La función es la siguiente:\r\n\r\n    // Responder el resultado de la consulta\r\n    // Retornar el resultado restful por HTTP\r\n    func Responder(w http.ResponseWriter, token string, respuesta interface{}) {\r\n\t    estadoHttp := Estado_200_Ok // int 200\r\n\r\n\t\t// Verificar Si el valor a retornar es de tipo recursos.Error\r\n\t\t// o es de un tipo de estructura del negocio.\r\n\t\terr, esError := respuesta.(*Error)\r\n\t\tif esError {\r\n\t\t\testadoHttp = err.EstadoHttp\r\n\t\t} else {\r\n\t\t\tif respuesta == nil {\r\n\t\t\t\testadoHttp = Estado_204_SinContenido // 204\r\n\t\t\t}\r\n\t\t}\r\n\r\n\t\t// Si el token tiene un valor, retornarlo en el campo\r\n\t\t// \"authorization\" del Header del mensaje.\r\n\t\tif token != \"\" {\r\n\t\t\tw.Header().Set(\"authorization\", token)\r\n\t\t}\r\n\r\n\t\t// Valores de retorno del mensaje por defecto:\r\n\t\t// Retorno en JSON y conjunto de caracteres UTF-8\r\n\t\tw.Header().Set(\"Content-Type\", \"application/json; charset=UTF-8\")\r\n\t\tw.Header().Set(\"Access-Control-Allow-Origin\", \"*\")\r\n\t\tw.WriteHeader(estadoHttp)\r\n\r\n\t\t// Escribir en el body siempre y cuando no sea vacío\r\n\t\tif respuesta != nil {\r\n\t\t\tif err := json.NewEncoder(w).Encode(respuesta); err != nil {\r\n\t\t\t\tpanic(err)\r\n\t\t\t}\r\n\t\t}\r\n    }\r\n\r\nMuchísimas gracias, les envío un muy fuerte abrazo.\r\nAdoro golang, me encanta. Para mi es como volver a desarrollar en C, es como volver a mis 18 años.\r\n\r\nFabián Alejandro Pallares\r\nBuenos Aires, Argentina\r\n+54 11 5753-5678\r\n\r\nPlease answer these questions before submitting your issue. Thanks!\r\n\r\n### What version of Go are you using (`go version`)?\r\n1.6.3\r\n\r\n### What operating system and processor architecture are you using (`go env`)?\r\nWindows / Linux (Servidores Ubuntu y Centos)\r\n\r\n### What did you do?\r\nIf possible, provide a recipe for reproducing the error.\r\nA complete runnable program is good.\r\nA link on play.golang.org is best.\r\n\r\nSoy un desarrollador.\r\n\r\n### What did you expect to see?\r\nEspero que la respuesta de un servicio rest cuyo código de estado es 204, finalice normalmente.\r\n\r\n### What did you see instead?\r\nCuando realizo pruebas, la petición se queda colgada. Nunca finaliza de procesar la función.\r\n\r\n",
	"user": {
		"login": "fabianpallares",
		"id": 5326640,
		"type": "User",
		"site_admin": false
	},
	"comments": 6,
	"closed_at": "2016-08-31T22:48:32Z",
	"created_at": "2016-08-31T22:38:50Z",
	"updated_at": "2016-09-03T03:04:07Z"
}
