{
	"id": 149988880,
	"number": 15398,
	"state": "open",
	"title": "proposal: add tag support when declaring types and functions/methods",
	"body": "Currently tags are only supported on struct fields, which is somewhat limiting. This proposition is to add tag support when defining types ~~and functions/methods~~.\r\n\r\nWhen declaring a type, a tag may optionally be specified after the type itself:\r\n```\r\nTypeSpec     = identifier Type [ Tag ] .\r\n```\r\n\r\n~~As for functions and methods, the signature may hold the tag:~~\r\n\r\n\r\nAs it is necessary to somehow get these tags with reflection, and the only proper place is to add a Tag method to the reflect.Type interface, this unfortunately pushes the proposal to 2.0 land (unless reflect.Type is somehow not covered by the compatibility promise). The Tag method of the Type interface should return a type similar to StructTag (or StructTag, renamed to Tag for 2.0). The ast package must also be extended to support reading these tags, to be useful for code generator tools and the like.\r\n\r\nSince struct tags are heavily used in go already, adding them for other types will not introduce confusion. Even more, they could solve a lot of current problems. For example, quite a few code generator tools currently rely on comments to find out what they need to do. With this addition,  they could use the tags directly, which is more idiomatic. Marshaler libraries (such as json) can use it to get extra information about what they need to do. That will also cover #15314 and #15230 (which gave rise to the idea of this proposal in the first place), without the need to add more specialized functions/methods. ~~A final example for functions and methods is a common case with web frameworks that have to restrict certain handlers to authenticated users only.  Such a case may be solved by using tags on these functions and methods, with the underlying framework, or http router, or middleware using the information to decide what to do.~~",
	"user": {
		"login": "urandom",
		"id": 7908,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "LanguageChange"
		},
		{
			"name": "Proposal"
		}
	],
	"comments": 5,
	"created_at": "2016-04-21T07:19:11Z",
	"updated_at": "2016-08-29T23:13:30Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	},
	"reactions": {
		"total_count": 2,
		"-1": 2
	}
}
