{
	"id": 142014379,
	"number": 14873,
	"state": "open",
	"title": "proposal: add new ioctl's and refactor existing ioctl's for solaris in x/sys/unix",
	"body": "I propose adding 4 additional ioctl functions for solaris:\r\n\r\n    IoctlGetUint\r\n    IoctlSetUint\r\n    IoctlGetString\r\n    IoctlSetString\r\n\r\nIn addition, I propose modifying the existing IoctlGetInt function to support passing in a nil pointer for the ioctl arg parameter.  In the case of IoctlGetInt and IoctlGetUint, if arg is nil, the return value is the same as the return value from the underlying ioctl function.  If the arg pointer is not nil, then the return value is also written into the memory location pointed to by arg.\r\n\r\nTo support the functionality of IoctlGetInt and IoctlGetUint, we need to change the underlying ioctl function from the current definition:\r\n\r\n    //sys   ioctl(fd int, req int, arg uintptr) (err error)\r\n\r\nto\r\n\r\n    //sys   ioctl(fd int, req int, arg uintptr) (n int, err error)\r\n\r\nThe existing IoctlGet and IoctlSet functions would also need to be modified to use the updated ioctl function.\r\n\r\nTo summarize, the existing IoctlGetInt function would change from:\r\n\r\n    func IoctlGetInt(fd int, req int) (int, error)\r\n\r\nto\r\n\r\n    func IoctlGetInt(fd int, req int, value *int) (int, error)\r\n\r\nAnd the following 4 functions would be added:\r\n\r\n    func IoctlGetUint(fd int, req int, value *uint) (uint, error)\r\n    func IoctlSetUint(fd int, req int, value uint) (err error)\r\n    func IoctlGetString(fd int, req int) (string, error)\r\n    func IoctlSetString(fd int, req int, value string) (err error)\r\n",
	"user": {
		"login": "kim-racktop",
		"id": 14223489,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "OS-Solaris"
		},
		{
			"name": "Proposal"
		}
	],
	"comments": 2,
	"created_at": "2016-03-19T01:33:57Z",
	"updated_at": "2016-03-22T00:32:15Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
