{
	"id": 156219840,
	"body": "The main complaint with the vendor folder I've heard is that it isn't a workspace solution like wgo or gb.\r\n\r\nThat aside, without the vendor folder people will do one of:\r\n\r\n a. alter GOPATH\r\n b. alter the import statements\r\n c. alter the packages in GOPATH\r\n\r\nThis is proven with years of history. Option (a) is equivalent to the vendor folder that is a single level (no sub-vendoring). Option (b) is equivalent to vendor folder without the rewrites. Option (c) requires a unique GOPATH per project and the a step to workspaces.\r\n\r\nHistorically when you ran \"go get\" on a package that used (a) it didn't break because you weren't compiling the package as the author intended. Historically (b) has the same issue that you bring up as the vendor folder. Lastly, both of these were done in often incompatible methods making creating tools hard and made forming developer expectations difficult.\r\n\r\nThe vendor folder will fix a huge number of issues seen in the wild of medium to large repositories. Support for it can't come soon enough.\r\n\r\nIf this causes a build issue, file a local or upstream bug. The vendor folder doesn't introduce this issue, it just makes it more visible. In other words, it makes it easy to vendor stuff in a standard way. This is really good.\r\n\r\nAside from the individuals I've met who want workspaces, most people I've met are excited about the vendor folder. The largest issue I've encountered isn't technical, it is education. Most people aren't aware of the concepts and different tools available to them. I believe the issue you present is an issue, but one resolved through education; I don't see a technical workaround. Every example that has been given that I've seen is manufactured in some way or another. Yes, I will happen. But it will be a bug and it can be resolved.\r\n",
	"user": {
		"login": "kardianos",
		"id": 755121,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-11-12T20:07:01Z",
	"updated_at": "2015-11-12T20:07:27Z"
}
