{
	"id": 123039898,
	"number": 13687,
	"state": "closed",
	"title": "bots: improve handling of PRs and gopher-bot response",
	"body": "*(Per Brad Fitzgerald's prompting to write up my idea into an issue in https://github.com/golang/go/issues/13665)*\r\n\r\nEven though it is generally well understood in the contributing community for `golang/go` that Pull Requests aren't accepted, I think there is still room for improvement to the automatic response to any PR that might be submitted to the project and related repos managed directly by the Go team. There are several reasons for this, but I would especially highlight the fact that related repositories (e.g.` golang/net`, `golang/blog`) *do not* have the open PR \"The Go Project does not use pull requests\" as is present in `golang/go`; also, realistically, is everybody (especially if they are well intentioned but relatively inexperienced with GitHub) going to read the contribution guidelines? No, they are not; and yet, they might have something to offer that isn't appropriate for them to go through the Gerrit process (which is even harder to quickly get into that GitHub).\r\n\r\nI agree that automatically going from a PR =\u003e Gerrit is too much to expect, nor would it be appropriate. The systems are not 1-1. Instead, I propose an in-between solution: PR =\u003e New Issue in the repo. In the automatic response generated by the gopher-bot, in addition to the current boilerplate, **politely apologise that the project doesn't use PRs** (*because ultimately it's more important to make people feel glad for trying to help than to risk putting them off)*, inform them about Gerrit, and **offer a link to process their PR into a New Issue** if they would like. Where the issue  template cites the line numbers affected, with the changes in code blocks, the PR comment above, and the PR comment used as the Issue subject header. This prepared New Issue is then left for the user to modify at will and then submit if desired.",
	"user": {
		"login": "benjamin-rood",
		"id": 10102132,
		"type": "User",
		"site_admin": false
	},
	"assignee": {
		"login": "adg",
		"id": 8446613,
		"type": "User",
		"site_admin": false
	},
	"comments": 5,
	"closed_at": "2016-02-02T00:00:46Z",
	"created_at": "2015-12-18T22:55:46Z",
	"updated_at": "2016-02-02T00:43:15Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
