{
	"id": 166070184,
	"body": "Let me put it this way: It’s certainly not rude… but it is also immediately discarding of the work someone put in with kind intentions (it’s best to just assume that)… *to the point of being able to be read as completely dismissive.*\r\n\r\nImagine if you purely went out of your way to just be helpful, weren’t a super fast programmer, and even something little (to the likes of you guys) actually involved a commitment of someone’s time which they had no motive to do except just to be a decent person, and they felt good about being a nice and helpful. And then, in return for that, what do they get? The effort they put in just got shitcanned. Surely you can see that might be *frustrating, and frustration must be one of the* a priori *reasons for a human being to be rubbed the wrong way, let alone feeling disregarded and your effort immediately dismissed.*\r\n\r\nMy suggestion:\r\n\r\n\u003eHi, Gopher-Bot here! Thanks for the PR!\r\n\r\n\u003eThe golang/go project (and its related repositories) don’t use GitHub’s Pull Requests, unfortunately! So we can’t accept your contribution this way.\r\n\r\n\u003eWe instead use a code review system called Gerrit.\r\n\u003eYou can find the details in our Contribution Guidelines: https://golang.org/doc/contribute.html \u003chttps://golang.org/doc/contribute.html\u003e\r\n\r\n\u003eThe good news is that I’ve been sent to help guide your contribution and direct it into an appropriate channel.\r\n\r\n\u003eWe have two options from here: \r\n\r\n\u003eWe can raise your PR as an issue: I can help convert your PR into a New Issue on the GitHub repository (link)\r\n\u003eI can help you getting started with Gerrit: (some text) (links)\r\n\r\n\u003eI'm going to close this Pull Request now.\r\n\u003eIf you’re familiar with Gerrit already, please consider sending this change directly: (link to the Gerrit for the appropriate equivalent for the repo the PR was directed for – it’s not unreasonable to provide an autogen link based on the PR)\r\n\r\n\u003eThanks,\r\n\r\n\u003eGopher-Bot \u0026 The Go Team\r\n\r\n\r\nIt never hurts to be extra friendly and helpful. You never know the impression of Go, the Go Team, and Google at large that someone might get from any communication. It’s obvious nobody intended to be anything other than polite with the current response, but I’m living proof that it can be improved. Especially in my case, when I was just pointing out a broken/outdated link to something on **Google Store**. That had nothing to do with wanting to contribute to any repository, just to aid a massive global corporation to fix something dumb, so that fellow gophers who desperately want their plush toys aren’t let down (someone was looking for a working link on the general channel of gophers.slack.com, that's how this all got started). I hope, also, that you can see the context of how/why someone might have done something doesn’t always fit into the package or from the approach you might have preconceived. \r\n\r\nHopefully that helps flesh out my suggestion for ya, thanks for listening. \r\n\r\np.s. nobody said go from diff =\u003e Gerrit change. In fact, I explicitly said that was too much for anybody to expect.",
	"user": {
		"login": "benjamin-rood",
		"id": 10102132,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-20T06:27:09Z",
	"updated_at": "2015-12-20T06:27:39Z"
}
