{
	"id": 66049556,
	"body": "\u003ca id=\"c11\"\u003e\u003c/a\u003eComment 11:\n\n\u003cpre\u003eSince this is something that's been bugging me lately too, I thought I'd add a few\nrandom thoughts I had that don't seem to have been mentioned:\n\nAllowing conversions from slices to array-pointers means pointers can now refer to\npartially overlapping objects.  I don't believe that's currently possible in the\nlanguage.  Slices can already overlap though, so it's not a big change overall.\n\nLike #8 says, []T is sort-of an interface type for *[N]T, so type assertions are\narguably suitable syntax.  Except that cap(x.(*[N]T)) might give a different value than\ncap(x), which isn't true for other interfaces/implementor-type relations.  Seems like an\nopen question whether this inconsistency is worth accepting into the language, and\nreally since there's already a way to convert a *[N]T into a []T, just the ability to\nturn a []T into a *[N]T is the relevant missing feature.\n\nIt would be nice if an expression like x[e1:e2] could actually have a static type of\n*[e2-e1]T (assuming e1 and e2 are constant expressions), then you could write something\nlike *dst[16:24] = *src[136:144] and the compiler can verify that the array bounds match\nup.  Unfortunately, the expression can't actually be x[e1:e2] since existing code might\nrely on cap(x[e1:e2]) == cap(x)-e1, and that would be a backwards incompatible change. \nThe x.[e1:e2] syntax suggested originally would solve this issue.\n\nIf you want a range like x.[n:n+4], instead of requiring the language to recognize this\npattern somehow, x[n:].[:4] is equivalent and has static indices at the expense of\nclunkier notation.  A short-hand notation like x.[n:+4] might be nice to indicate that 4\nis a length not an end position, but not strictly necessary and complicates the\nlanguage.  (Also +4 here is technically ambiguous here whether it's length 4 or end\nposition \"+4\", so again some new notation would be necessary.)\u003c/pre\u003e",
	"user": {
		"login": "mdempsky",
		"id": 38349,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-01-29T20:04:32Z",
	"updated_at": "2014-12-08T10:04:26Z"
}
