{
	"id": 66084792,
	"body": "\u003ca id=\"c9\"\u003e\u003c/a\u003eComment 9 by **norman.yarvin**:\n\n\u003cpre\u003eMy proposal, at\n\n\u003ca href=\"https://docs.google.com/document/d/1xHyOK3hSxwMtyMH-pbXSXxo7Td9A_Teoj6cbr9ECeLM/edit?pli=1#\"\u003ehttps://docs.google.com/document/d/1xHyOK3hSxwMtyMH-pbXSXxo7Td9A_Teoj6cbr9ECeLM/edit?pli=1#\u003c/a\u003e\n\nhas now reached a reasonably mature state.  I'd appreciate if people had a look at it. \nIt's a rather long proposal, but that's because this is not a small addition to the\nlanguage and I've tried to be thorough.  The proposal is purely about the basics of\nmultidimensional slices; math operations on whole slices are not part of it.  (It does\nnot preclude later adding them, but does not set up a situation where they'd be\nnecessary, either.)\n\nAs regards comments that people have made so far on the document, please keep in mind\nthat most of them were made against earlier versions, in which some things were not\nexplained as well.  Thus if any appear to be foolish that should not be held against the\ncommenter, or at least not too much.  (Though some comments have been marked as\nresolved, I haven't marked them that way just because I disagree and have improved my\nexplanation, as that seems too dictatorial; I figure people can retire their own\ncomments if their objections have truly been addressed.)\n\nAs a personal comment, it is rather rare to have an opportunity to add a major feature\nto a language so cleanly.  Usually one either has to break compatibility or introduce\nsome serious ugliness or severe compromise.  But here it's almost like Go was designed\nfor this feature to just be plugged in and almost seamlessly fill a gap in its\ncapabilities.  Or so I believe; go ahead, hammer on the proposal and prove me wrong.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-10-03T06:51:23Z",
	"updated_at": "2014-12-08T10:34:33Z"
}
