{
	"id": 51284020,
	"number": 5682,
	"state": "closed",
	"title": "Spec clarification on named vs. unnamed types",
	"body": "\u003cpre\u003eThere has been some confusion over the meaning of named vs. unnamed types. I for one was\nconfused about \u0026quot;float64\u0026quot; being a named type, and upon learning that, was\nconfused about what unnamed types are. It's obvious that anything to which a programmer\ngives a name is a named type, but I don't think it's obvious that the predefined types\nare named types.\n\nThe only place I see in the spec that talks about it is the following line:\n\n\u0026quot;Named instances of the boolean, numeric, and string types are predeclared.\nComposite types—array, struct, pointer, function, interface, slice, map, and channel\ntypes—may be constructed using type literals.\u0026quot;\n\nWith careful reading, this does say that float64 is a named type, but I think it could\nbe improved by saying something like \u0026quot;All of the predeclared boolean, numeric and\nstring types are named types.\u0026quot; There is no confusion if a \u0026quot;named\ninstance\u0026quot; is the same as a \u0026quot;named type\u0026quot;, and has a side bonus of someone\ndoing a find for \u0026quot;named type\u0026quot; would now easily find this line.\n\nSecondly, this definition says nothing explicit about what an unnamed type is. It would\nbe nice if this was changed to explicitly state what are unnamed types.\n\nWhile on the one hand I can see the argument \u0026quot;clearly []string is not a named type,\nno one gave it a name\u0026quot;, at the same time no Go programmer gave float64 a name\neither. To me at least, the fact that\n\ntype Myfloat float64\n\nis not assignable to a float64, while \n\ntype Myfloatslice []float64\n\nis assignable to a []float64 is surprising, and I would appreciate further clarification\nin the spec.\u003c/pre\u003e",
	"user": {
		"login": "btracey",
		"id": 3680859,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 6,
	"closed_at": "2014-12-08T10:31:00Z",
	"created_at": "2013-06-11T18:21:11Z",
	"updated_at": "2016-06-24T22:42:25Z"
}
