{
	"id": 51283893,
	"number": 5604,
	"state": "closed",
	"title": "spec: Receive operator: slightly confusing wording about receive from closed channel",
	"body": "by **ej@evanjones.ca**:\n\n\u003cpre\u003eNitpick, feel free to ignore. I found the following two sentences confusing. At first\nglance, I thought they even contradicted each other. From\n\u003ca href=\"http://golang.org/ref/spec#Receive_operator\"\u003ehttp://golang.org/ref/spec#Receive_operator\u003c/a\u003e:\n\n\u0026quot;Receiving from a closed channel always succeeds, immediately returning the element\ntype's zero value.\u0026quot;\n\n... later in the same section, about the two value form:\n\n\u0026quot;yields an additional result of type bool reporting whether the communication\nsucceeded.\u0026quot;\n\nWhen I first read this, I thought \u0026quot;Wait, so ok is true if I receive from a closed\nchannel?\u0026quot; The following sentence makes it clear:\n\nThe value of ok is true if the value received was delivered by a successful send\noperation to the channel, or false if it is a zero value generated because the channel\nis closed and empty.\n\n\nMy confusion is due to the \u0026quot;overloaded\u0026quot; use of the word \u0026quot;succeeded\u0026quot;.\nIn the first sentence, I believe it means \u0026quot;the operation doesn't panic.\u0026quot; In\nthe second sentence, it means \u0026quot;the *communication* succeeded\u0026quot;, meaning witha\nsender.\n\n\nSuggested fix: Remove the word \u0026quot;succeeds\u0026quot; from the first sentence, so it reads:\n\n\u0026quot;Receiving from a closed channel always immediately returns the element type's zero\nvalue.\u0026quot;\n\n\nThis removes any possible confusion between \u0026quot;receiving from a closed channel\u0026quot;\nand \u0026quot;communication succeeded.\u0026quot;\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "griesemer",
		"id": 8528975,
		"type": "User",
		"site_admin": false
	},
	"comments": 3,
	"closed_at": "2014-12-08T10:30:29Z",
	"created_at": "2013-05-31T14:15:19Z",
	"updated_at": "2016-06-24T22:41:35Z"
}
