{
	"id": 66073787,
	"body": "\u003ca id=\"c2\"\u003e\u003c/a\u003eComment 2:\n\n\u003cpre\u003ehtdesign,\n \nI think that your example is too general to be able to measure performance properly.\n\nFirstly, your program relies on many computers (other then yours) to do its job: dns\nservers, http servers, routers. What happens if some of this parts are slow? How would\nthat affect performance of your program? Also your OS needs to juggle all these\nconnections, so it might not allow your program to do too many things at the same time.\n\nSecondly, using http.Get could be quite expensive. It will do redirects to other hosts,\nif required. It will employ compression / decompression. And so on. You need to be clear\nabout all these details.\n\nTo demonstrate, I created this program \u003ca href=\"http://play.golang.org/p/UhspRh9th7\"\u003ehttp://play.golang.org/p/UhspRh9th7\u003c/a\u003e. It is\nsimilar to yours, but it:\n1) separates success and failures - total time will be affected (sometimes a lot), if\nyou have to wait for the other party and no answer incoming;\n2) demonstrates performance difference between address lookup, connect/disconnect, and\nhttp get - more involved you get, slower it gets - it is not so much harder for your\nprogram, but more for parties it is talking to;\n3) provides some measurable stats;\n\nRunning my program against your file produces this output for me:\n\nlookup: successes: (count=772 time=1.5s), failures: (count=228 time=18.546875s)\nconnect: successes: (count=748 time=53.90625s), failures: (count=252 time=1m10.828125s)\nget: successes: (count=739 time=1m9.609375s), failures: (count=261 time=1m13.21875s)\n\nLookups are quite fast - all successful ones are done in 1.5s, while failures took much\nlonger 18s, but still not bad.\nConnects are much slower then lookups - 53s for successes and 1m10s for failures.\nGets are the slowest (remember these could be redirected, so they might visit multiple\nhosts for each line in your file, send data back and forward, compress / decompress that\ndata), but still reasonable - 1m9s for successes and 1m13s for failures.\n\nI hope my findings will help you narrow down your problems.\n\nAlex\u003c/pre\u003e",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-01-29T06:33:06Z",
	"updated_at": "2014-12-08T10:24:47Z"
}
