{
	"id": 100188435,
	"number": 12101,
	"state": "closed",
	"title": "proposal: x/sys: move crypto/terminal to sys repository",
	"body": "I would like to propose the addition of a set of functions and supporting data types to support getting / setting terminal window size across platforms.\r\n\r\nThis would also likely require the addition of something like this to x/sys:\r\n\r\n```\r\nfunc GetWindowSize(fd int) (winsize *Winsize, err error) {}\r\nfunc SetWindowSize(fd int, ws *Winsize) (err error) {}\r\ntype Winsize struct {\r\n    Row    uint16\r\n    Col    uint16\r\n    Xpixel uint16\r\n    Ypixel uint16\r\n}\r\n```\r\n\r\nOn Linux, OS X, etc. this is done via syscalls using ioctl(), etc.  On Windows, this is done possibly via GetConsoleScreenBufferInfo and SetConsoleWindowInfo.  On Solaris, this is done via libc.ioctl().\r\n\r\nDocker (pkg/term/*) and other Go-based projects like to retrieve or set this information, it would be helpful if this was abstracted away for various projects as can be seen in a simple github search of Go source files:\r\n\r\nhttps://github.com/search?utf8=%E2%9C%93\u0026q=%22TIOCGWINSZ%22+extension%3Ago\u0026type=Code\u0026ref=advsearch\u0026l=\r\n\r\nI am willing to provide the implementation and tests for Solaris, and Linux, and I can attempt one for Windows.\r\n\r\nI have not proposed an addition before to any of the Go packages or tools, so please forgive me if I have not adhered to the correct process ( I'm attempting to follow https://github.com/golang/proposal#readme ).\r\n\r\nI don't know if the sys package is the most appropriate place for this or not; I'm just trying to figure out how to avoid the current situation of duplicating terminal information code across various Go projects in the community leading to them not working as expected or being unsupported on some platforms.",
	"user": {
		"login": "binarycrusader",
		"id": 541114,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		},
		{
			"name": "Proposal-Declined"
		}
	],
	"comments": 16,
	"closed_at": "2015-10-30T15:27:12Z",
	"created_at": "2015-08-10T23:06:00Z",
	"updated_at": "2015-10-30T15:27:13Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	}
}
