{
	"id": 165628844,
	"body": "I’m confused, so somebody actually did take my request as a suggestion, and submitted it on Gerrit? See, If I had just been told what you actually did, which was exactly the right thing by the way, thank you, then it would have been fine. \n\nI suggest in the future, it would be better to say something like: \n“We don’t take PR’s, but this is such a tiny thing that does need to be fixed so I have gone ahead and done a Gerrit submission for you – thanks for raising for bringing this to our attention. If you are interested in contributing to etc etc use Gerrit etc etc boilerplate boilerplate”\n\nBecause, behind the scenes, that is what was happening! And that’s great. So, it seems like gopher bot just auto-responded and closed it like he should, but Brad Fitzpatrick had a quick peek at the PR I did and saw it was just a straight bug and just went about solving the problem. \n\nAnother (and ideal, although much more work involved for you guys) would be for gopher-bot to also provide a link to convert the PR into an ISSUE, so then one could just modify it to suit. That would be the ideal solution.\n\nThanks for getting in contact with me directly about this, Ian.\n\nBest,\n\nBen\n\nP.S. I love Go.\n\n\n\n\u003e On 18/12/2015, at 1:54 PM, Ian Lance Taylor \u003cnotifications@github.com\u003e wrote:\n\u003e \n\u003e Thanks for the note. This was just fixed by https://golang.org/cl/18020 \u003chttps://golang.org/cl/18020\u003e .\n\u003e \n\u003e I'm sorry that the rejection of the pull request rubbed you the wrong way. We have good reasons for requiring Gerrit, which have been hashed out a few times on the mailing list. Given that we don't accept pull requests, it seems better to let people know that, rather than just ignore them. If you have any suggestions for better phrasing for the automated message, I would very much appreciate it. Thanks.\n\u003e \n\u003e —\n\u003e Reply to this email directly or view it on GitHub \u003chttps://github.com/golang/go/issues/13665#issuecomment-165627021\u003e.\n\u003e \n\n",
	"user": {
		"login": "benjamin-rood",
		"id": 10102132,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-18T01:05:44Z",
	"updated_at": "2015-12-18T01:05:44Z"
}
