{
	"id": 247232929,
	"body": "\u003e So we indeed would need a separate function to canonize paths which is documented to also convert Windows short filenames to long filenames.\r\n\r\nWhy would you need such function?\r\n\r\nYou can use os.SameFile to test if 2 files are the same. You can even use filepath.EvalSymlinks to convert real file paths in different format to the same string. For example this https://play.golang.org/p/1FnLrOOXoq outputs:\r\n```\r\nC:\\Documents and Settings\\brainman\\.gitconfig\r\nC:\\Documents and Settings\\brainman\\.gitconfig\r\nC:\\Documents and Settings\\brainman\\.gitconfig\r\nC:\\Documents and Settings\\brainman\\.gitconfig\r\nC:\\Documents and Settings\\brainman\\.gitconfig\r\nC:\\Documents and Settings\\brainman\\.gitconfig\r\n```\r\non my computer.\r\n\r\nfilepath.EvalSymlinks started as \"canonical\" way to express file path https://codereview.appspot.com/5713043/#msg5 And we tried to keep filepath.EvalSymlinks working this way. But I don't think there is any definition of \"canonical\" in Windows API. There is no Windows API that would provide that functionality. What we do in filepath.EvalSymlinks is mish and mash.\r\n\r\n\u003e Something in golang.org/x/sys/windows perhaps?\r\n\r\nLets see what exactly @sschuberth wants.\r\n\r\n\u003e We do have path/filepath.ToSlash which is half of the story.\r\n\r\nfilepath.ToSlash just converts \\ into / in a string. filepath.EvalSymlinks works on real files / directories and use Windows help to discover \"real\" file names. As you can see from https://play.golang.org/p/1FnLrOOXoq Windows accepts many different ways to name a file, and filepath.EvalSymlinks converts all different variations into a single form.\r\n\r\n\u003e ... what's the definition for a canonical path? Every Clean'ed and\r\n\u003e EvalSymlink'ed path is as canonical as any others.\r\n\r\nI agree. Putting the word \"canonical\" in the documentation might just confuse things even more.\r\n\r\nMaybe we should let Russ decide wha to do here. He started it https://codereview.appspot.com/5713043/#msg5 :-)\r\n\r\nAlex",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-15T04:38:39Z",
	"updated_at": "2016-09-15T04:38:39Z"
}
