{
	"id": 66053281,
	"body": "\u003ca id=\"c3\"\u003e\u003c/a\u003eComment 3:\n\n\u003cpre\u003egoinstall is not working, as far as I'm concerned, on Windows yet - it needs some bits\nof unix environment outside of Go (make and others), I don't think we can expect all\nWindows developer to have those.\n\nOn the other hand, if you're prepared to install some unix utils (I use mingw + msys)\nyou should be able to make goinstall work one way or the other. For example, I run:\n\ngoinstall -v \"go-idn.googlecode.com/hg/src/idna\"\n\nat msys prompt, and it managed to download the package, but failed to execute gomake.\nSure enough current gomake doesn't have .exe or .bat extension (see windows version of\nexec.LookPath() for details), so I have created new file $GOROOT/bin/gomake.bat with\nthis inside:\n\nc:\\msys\\1.0\\bin\\make.exe %1 %2 %3 %4 %5 %6 %7 %8 %9\n\nas being suggested by someone earlier (I don't remember who, probably Wei). Now if I run\ngoinstall, it will run to successful completion.\n\nOn the other hand, if I run goinstall right from windows prompt, it downloads the\npackage, starts building and fails with\n\n/bin/sh: uname: command not found\n/bin/sh: tr: command not found\n/bin/sh: sed: command not found\n/bin/sh: uname: command not found\n/bin/sh: sed: command not found\n\nand others, which could, probably, be solved by setting my PATH right. That's where\nthings are with goinstall.\n\nOn the other hand, I don't see any \"access denied\" messages, so, perhaps, there is\nsomething else wrong in there, but I can't reproduce it.\n\nAnswering your last question: I use linux/386 (real PC, not VM) to develop: I build\nlinux/386 version of all tools and packages, then build windows/386 version of packages,\nthen I can just build linux or windows version of my program. Of course I need Windows\nto run it. Rarely I use mingw + msys on Windows just to make sure that all Go code still\nbuilds there. I find native linux environment much faster (then mingw + msys), also it\ncomes with everything I can think of, not just bare minimum.\n\nAlex\u003c/pre\u003e",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2010-11-22T04:29:22Z",
	"updated_at": "2014-12-08T10:07:35Z"
}
