{
	"id": 182895690,
	"number": 17437,
	"state": "closed",
	"title": "x/tools/cmd/goimports: adds import colliding with package-level variable",
	"body": "Please answer these questions before submitting your issue. Thanks!\r\n\r\n### What version of Go are you using (`go version`)?\r\n`go 1.7.1`\r\n\r\n### What operating system and processor architecture are you using (`go env`)?\r\n\r\n`linux/amd64`, `darwin/amd64`\r\n\r\n### What did you do?\r\n(A complete program exhibiting the behavior described blow is available at https://github.com/ChimeraCoder/goimports-log-bug/commits/master. The first commit demonstrates a working program, and the second commit captures the effects of `goimports`.)\r\n\r\nThe `logrus` package (https://github.com/Sirupsen/logrus) provides a logger whose methods are superset of the functions from the stdlib `log` package. So, in theory, `var log = logrus.New()` at the package level should be a drop-in replacement for the `log` package - and this *is* true for the file in which that package-level variable `log` is defined.\r\n\r\nHowever, `goimports` seems to ignore this for other files in the same package, instead adding `import \"log\"` in those files. Not only does this not have the desired effect (using the `logrus` package), but it turns a working build into a broken one:\r\n\r\n```\r\n./helpers.go:3: log redeclared in this block\r\n        previous declaration at ./main.go:7\r\n```\r\n\r\n\r\n### What did you expect to see?\r\n\r\nIdeally, `goimports` could check before adding an import to see if it collides with an existing package-level identifier. (In this case, the identifier it collides with already provides the methods that were missing anyway).\r\n\r\nThough more broadly, this is the first time that I can remember in which running `goimports` breaks an otherwise-working build. (I'm not sure if this is explicitly an invariant promised by goimports, but it's certainly been a safe assumption most of the time!).\r\n\r\n### What did you see instead?\r\n\r\n```\r\n./helpers.go:3: log redeclared in this block\r\n        previous declaration at ./main.go:7\r\n```",
	"user": {
		"login": "ChimeraCoder",
		"id": 376414,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "WaitingForInfo"
		}
	],
	"comments": 2,
	"closed_at": "2016-10-16T18:21:38Z",
	"created_at": "2016-10-13T20:42:56Z",
	"updated_at": "2016-10-16T18:21:38Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
