{
	"id": 163040067,
	"number": 16217,
	"state": "closed",
	"title": "Weird Behavior on Single Computer",
	"body": "Please answer these questions before submitting your issue. Thanks!\r\n\r\n1. What version of Go are you using (`go version`)?\r\n\r\ngo version go1.6.2 windows/386\r\n\r\n2. What operating system and processor architecture are you using (`go env`)?\r\n\r\nset GOARCH=386\r\nset GOBIN=\r\nset GOEXE=.exe\r\nset GOHOSTARCH=386\r\nset GOHOSTOS=windows\r\nset GOOS=windows\r\nset GOPATH=C:\\Gocode\r\nset GORACE=\r\nset GOROOT=C:\\Go\r\nset GOTOOLDIR=C:\\Go\\pkg\\tool\\windows_386\r\nset GO15VENDOREXPERIMENT=1\r\nset CC=gcc\r\nset GOGCCFLAGS=-m32 -mthreads -fmessage-length=0\r\nset CXX=g++\r\nset CGO_ENABLED=1\r\n\r\n3. What did you do?\r\nIf possible, provide a recipe for reproducing the error.\r\nA complete runnable program is good.\r\nA link on play.golang.org is best.\r\n\r\nSo I was developing and testing out essentially my first \"real\" go application here:\r\nhttps://code.imperial.edu/online-services/go-user-client-info\r\n\r\nOver the weekend I was working from home on my laptop (which is running Windows 10 64-bit and the same version of Go) and everything was working fine with the page being served when running the executable generated after running \"go build main.go\".\r\n\r\nBy fine, I mean that I was able to see the CSS being served and presented for the HTML page correctly.\r\n\r\nContrast this when running the same code from my work PC (which is the machine I generated the 'go env' info above). Essentially, I wanted to continue the work I had started over the weekend. So after updating my local copy of the repository and running \"go build main.go\" I started it up to test.\r\n\r\nHere on my work PC it does not serve the CSS files correctly (they get interpreted as text/plain files in Chrome, Internet Explorer or Firefox so the browser doesn't appear to be the culprit).\r\n\r\nI've also tested taking the same folder containing all of the project files I'm trying from my work PC and copying them to a different machine here in our environment...when I start it up on the other machine it works correctly (so this rules out there being an issue with the 32-bit version of the EXE, which was one potential thought). The other PC I tried it on was a 64-bit machine though, so I need to try it from another 32-bit machine as well just to be doubly-sure that's not the potential issue.\r\n\r\nIf I try and go to the URLs directly I can access the files when the server is running...but I'm just not sure why it's showing them incorrectly as text/plain in one case, and showing them correctly as text/css when running it on other machines.\r\n\r\n4. What did you expect to see?\r\n\r\nI expected the CSS files to get served correctly on any machine I run the code on since that's one of the benefits of Go :-).\r\n\r\n5. What did you see instead?\r\n\r\nInstead, currently on my local PC it's not serving the CSS files correctly, even though the same exact code was used to generate the executable running in two different locations (and it works when running it from one machine, but not the other).\r\n\r\nI'll see if I can run a few more tests and report back what I learn.\r\n\r\nI'm not sure if the issue is a newbie mistake that I made in the code since I am just starting out, but it definitely feels weird the way things are currently behaving.\r\n",
	"user": {
		"login": "orware",
		"id": 931650,
		"type": "User",
		"site_admin": false
	},
	"comments": 1,
	"closed_at": "2016-06-29T22:22:48Z",
	"created_at": "2016-06-29T22:19:19Z",
	"updated_at": "2016-06-29T22:22:48Z"
}
