{
	"id": 250235030,
	"body": "\u003e  disagree. I spent a significant amount of my time, over a number of months, on design and code reviews for golang.org/x/mobile/audio.\r\n\r\nThe mobile package is planned and executed by this team as an experiment. The entire thing should have never been under /x. As this proposal calls out, there are a few packages under this category and should have been bootstrapped elsewhere, e.g. how bradfitz bootstrapped http2 outside of the tree.\r\n\r\n\u003e sure, that's a benefit for you, but it is a cost for the Go approvers.\r\n\r\nI thought this discussion already acknowledged the bandwidth issue. What @adg asks for is how others are affected by such a policy and it is very critical to understand what a proper solution to community-driven packages might look like.\r\n\r\nI mentioned \"being able to work under an x allows me to reach out to the go approvers\", because it is a necessity. If people were able to escalate a couple of API sanity questions to a group of people they trust, they wouldn't care where they bootstrap or maintain their packages. This is an actual requirement, please don't dismiss it by repeating what we already know.\r\n\r\nAnd that's not a benefit for me. It is a benefit for the language to allow different people collaborate on a medium and escalate things about API review.\r\n\r\nadg mentions \"/x\" being prestigious but I disagree. In my unique experience, /x is a very invisible point. There is no true benefit someone is contributing a package to /x if they don't care about the quality or design feedback.\r\n\r\nBefore I finish, I want to say I really appreciate what @ianlancetaylor and @griesemer suggests. We may need a successor plan or strategy and think about the indicator of quality. The ideal location where these packages bootstrapped or maintained might not be /x, but organizing the distributed effort towards enhancing the Go library-space should be a critical project on its own.",
	"user": {
		"login": "rakyll",
		"id": 108380,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-28T17:19:18Z",
	"updated_at": "2016-09-28T17:19:18Z"
}
