{
	"id": 91278509,
	"number": 11420,
	"state": "open",
	"title": "x/image/draw: color space-correct interpolation",
	"body": "The BiLinear and CatmullRom interpolators assume the luminance of the source image's color space is linear. But the vast majority of images are in the sRGB color space, which has a highly non-linear luminance curve. As a result, scaled images can look quite different from the source image.\r\n\r\nFor example, on a reasonably calibrated monitor (and at 100% scaling in the browser), the left and right columns of the following image have the same average luminance:\r\n![gamma_colors](https://cloud.githubusercontent.com/assets/2688315/8380142/33ea0b6e-1bf2-11e5-960d-76fe4f536448.png)\r\nBut scaling this down by a factor of 2 using x/image/draw yields the following:\r\n![out](https://cloud.githubusercontent.com/assets/2688315/8380186/706440f0-1bf2-11e5-98ed-c1d863fac813.png)\r\nHere, the two columns appear very different.\r\n\r\nFor an in-depth (possibly too in-depth) discussion of this problem and many test images, including the one I used above, see http://www.4p8.com/eric.brasseur/gamma.html. My test program is here: https://gist.github.com/aclements/599107a2e3f187f8a2c0.\r\n\r\nA lot of software (including browsers) gets this wrong, and that's really unfortunate. It would be fantastic if Go software using x/image got this right out of the box.\r\n\r\nProbably the best solution to this would be to thread color space information throughout the image library. At the other extreme, given the general recommendation to assume sRGB in the absence of other information (since virtually every image created in the past two decades is sRGB), it may make sense to simply assume sRGB when interpolating. We could also do the latter first and then later add more complete color space support, with the default being sRGB. Another option is to add this information to the x/image/draw.Options structure, though I fear that may interfere with later adding proper color space support to image.\r\n\r\n/cc @nigeltao. (We discussed this a few weeks ago in person, but I figured I should open an issue so it doesn't get lost.)",
	"user": {
		"login": "aclements",
		"id": 2688315,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Suggested"
		}
	],
	"comments": 1,
	"created_at": "2015-06-26T15:24:00Z",
	"updated_at": "2015-07-11T12:13:49Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
