{
	"id": 120454463,
	"number": 13483,
	"state": "closed",
	"title": "proposal: Support checking out a commit with `go get`",
	"body": "I've seen many projects being worked on to support vendoring in go projects, as well as the official go \"vendor\" directory experiment.\r\n\r\nAll of these solutions require that the project using them keep a copy of all dependencies within their repository, and all of them seem rather complicated.\r\n\r\nI feel that this could be a lot more simple if the `go get` tool supported checking out specific changesets. That way you could simply have a \"manifest\" file (similar to Godeps.json) in your repo like this:\r\n\r\n```\r\ngithub.com/dependency/one 1a1a1a1a1a1a1a1a1a1a\r\ngithub.com/dependency/two 2b2b2b2b2b2b2b2b2b2b\r\ngithub.com/dependency/three v0.2.1\r\n```\r\n\r\nThen _all_ a management tool would need to do is run:\r\n\r\n```\r\ngo get github.com/dependency/one 1a1a1a1a1a1a1a1a1a1a\r\ngo get github.com/dependency/two 2b2b2b2b2b2b2b2b2b2b\r\ngo get github.com/dependency/three v0.2.1\r\n```\r\n\r\nAnd then the builder will have the dependencies checked out in their regular GOPATH, no need to vendor all of the source code within their repository.\r\n\r\nOnce the correct changesets are checked out, the builder does not have to worry about using any outside tools to build their project, just the standard go tools.\r\n\r\nThis was inspired by how Android projects manage their dependencies: http://developer.android.com/guide/topics/manifest/manifest-intro.html. In android projects, repositories contain no dependencies other than the manifest.xml file, which simply identifies the repos and changesets to check out.\r\n\r\nTo me, this seems like a natural thing for `go get` to do, since currently the two options are either: (1) checkout HEAD/tip (go get -u), or (2) checkout without paying attention to the revision (go get).",
	"user": {
		"login": "sparrc",
		"id": 7155926,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		},
		{
			"name": "Proposal-Declined"
		}
	],
	"comments": 2,
	"closed_at": "2016-08-15T23:19:24Z",
	"created_at": "2015-12-04T18:03:49Z",
	"updated_at": "2016-08-15T23:19:44Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	}
}
