{
	"id": 51277906,
	"number": 1512,
	"state": "closed",
	"title": "golang.org website errors when changing the examples on firefox",
	"body": "by **kikito**:\n\n\u003cpre\u003eThis is not really a go! language bug, but a problem on its website. Updating with hg\nwould make no difference since I'm not actually using the language at all.\n\nWhat steps will reproduce the problem?\n1. Go to golang.org using Firefox (I'm using Firefox 3.6 over Ubuntu, but I doubt that\nmatters)\n2. Choose one example from the drop-down at the bottom of the page (It reads\n\u0026quot;Hello, Word!\u0026quot; by default)\n\nWhat is the expected output?\n\nThe expected output is the result of computing the selected example. If I choose\n\u0026quot;Fibonacci Closure\u0026quot;, for example, I should see a Fibonacci Closure of some\nsort.\n\n\nWhat do you see instead?\n\nOn the div on top of the drop-down list, I see the text [object XMLDocument]\n\nA new div appears after the drop-down list with the messages:\n\nprog.go:1: package statement must be first\nprog.go:1: syntax error: unexpected name, expecting ]\n\nThis happens with all the examples. The \u0026quot;Hello World\u0026quot; one only works when the\npage is first loaded. If I choose another example (and see errors) and then move back to\n\u0026quot;Hello World\u0026quot;, I get the same error messages.\n\nWhich compiler are you using (5g, 6g, 8g, gccgo)?\n\nNo idea, whatever the web server is using.\n\nWhich operating system are you using?\nI'm in Ubuntu Maverick, but I doubt that will be pertinent for this issue.\n\nWhich revision are you using?  (hg identify)\nI can't access your web server so I have no idea.\n\n\nPlease provide any additional information below.\nI've tried it under Chrome and it seems to work. Could be a firefox-only thing.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "adg",
		"id": 8446613,
		"type": "User",
		"site_admin": false
	},
	"comments": 4,
	"closed_at": "2014-12-08T10:08:39Z",
	"created_at": "2011-02-14T14:22:20Z",
	"updated_at": "2016-06-24T19:25:17Z"
}
