{
	"id": 66048685,
	"body": "\u003ca id=\"c5\"\u003e\u003c/a\u003eComment 5 by **per.arneng**:\n\n\u003cpre\u003e\u003e The ms.net example does not have specific sections for parameter and return values.\n\nIf you click any method you have a page dedicated to that method that shows syntax\nand under that you can see parameters and return values. Each exception is also\ndocumented. There is also example code on how to use each method. The .NET framework\nis probably the best documented API in the world ( And i am a linux guy :-) )\n\n\u003e My own opinion is that separate parameter and return value pieces just encourage \n\u003e long-winded documentation.  \n\nI think that the most important information is the parameters, return values and any\nexceptions. It is usually possible to understand what the method does by just looking\nat the name so then it is good to also see if anything special is to be taken in to\nconsideration for the parameters and return values.\n\nAnother advantage of have special handling for documentation of parameters and return\nvalues is that IDE's can parse that documentation and show it to you live as you are\nwriting code that calls you method for the specific parameter you are typing at the\nmoment. Eclipse is doing this with the Java doc.\n\n\u003e For me at least godoc is working great as is.\n\nMost system's programming people today are Java developers (JEE) and they are used to\nthis kind of documentation. I think that this is not an extremely important thing to\nhave but it would probably make the transition for a Java developer in to Go much\neasier. \n\nLearning a new language goes pretty fast since it is often just smaller syntax\ndifference for the same kinds of features but it is the API that takes time to learn.\n\nDoxygen is a another documentation generator with support for alot of languages:\n\u003ca href=\"http://www.stack.nl/~dimitri/doxygen/\"\u003ehttp://www.stack.nl/~dimitri/doxygen/\u003c/a\u003e\nSample:\n\u003ca href=\"http://dbus.freedesktop.org/doc/api/html/group__DBusHashTable.html#gfde7b61c232d93e5120bc183e1721e73\"\u003ehttp://dbus.freedesktop.org/doc/api/html/group__DBusHashTable.html#gfde7b61c232d93e5120bc183e1721e73\u003c/a\u003e\n\nMaybe this is a project for Google's summer of code?\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2010-01-18T21:33:16Z",
	"updated_at": "2014-12-08T10:03:45Z"
}
