{
	"id": 133548544,
	"number": 14324,
	"state": "closed",
	"title": "runtime/pprof: no samples in profile output",
	"body": "Running on Ubuntu 15.10 x64, on an Intel Haswell i7-4790. I have seen identical behaviour with go 1.5.1 as provided by Ubuntu's repositories and go 1.5.3 as downloaded from https://golang.org/.\r\n\r\nI was trying to profile one of my programs, but I was getting weirdly empty profiles (*not* empty 0-byte files, but syntactically complete pprof files containing no useful samples). I googled around a bunch and eliminated a bunch of common causes before reporting:\r\n\r\nThe sample app I am profiling is https://gist.github.com/eapache/580b7dbd8800fe9a3234. It runs for ~40 seconds on my machine with no sleeps and only minimal printing to standard output, which should be more than enough to generate samples. I know that the CPU-bound string building dummy code is being run and not optimized out, because I can see it getting slower as the string size grows.\r\n\r\nIt is running to completion and `StopCPUProfile()` is getting called. If I interrupt it or remove that, I get a 0-byte profile file instead, which makes sense.\r\n\r\nI am not running on OSX or any platform which is known to have profiling problems as far as I have been able to determine.\r\n\r\nWhen inspecting the profile file with `pprof` I get no errors, but useless output like the following:\r\n```\r\n(pprof) top10\r\n39.78s of 39.78s total (  100%)\r\n      flat  flat%   sum%        cum   cum%\r\n    39.78s   100%   100%     39.78s   100%  \r\n```\r\n\r\nMy first instinct was that I was running without debug symbols for some reason, but I still get correct backtraces if I put a `panic` in somewhere. I'm really not sure what's going on here. I'm happy to try patches, upload the profile file, or whatever else you might need to debug this.",
	"user": {
		"login": "eapache",
		"id": 1706826,
		"type": "User",
		"site_admin": false
	},
	"comments": 9,
	"closed_at": "2016-02-15T00:58:52Z",
	"created_at": "2016-02-14T15:41:48Z",
	"updated_at": "2016-02-15T01:24:04Z"
}
