{
	"id": 51277566,
	"number": 1264,
	"state": "closed",
	"title": "cgo produces conflicting type definitions for C types in different files",
	"body": "by **awpritchard**:\n\n\u003cpre\u003eBefore filing a bug, please check whether it has been fixed since\nthe latest release: run \u0026quot;hg pull -u\u0026quot; and retry what you did to\nreproduce the problem.  Thanks.\n\nWhat steps will reproduce the problem?\n1. Apply the patch attached as \u0026quot;patch\u0026quot; to an empty directory (creates 1.go,\n2.go, Makefile)\n2. run 'make'\n\n-OR-\n\n1. Create two cgo source files and refer to one C struct in both files, and one C struct\nwhose name is alphabetically before the previous C struct, in only one of the files.\n2. Create the standard Makefile for this situation, with Make.inc, Make.pkg, and\nCGOFILES=\n3. run 'make'\n\nWhat is the expected output?\nThe package compiles correctly and without warnings.\n\nWhat do you see instead?\ncgo emits a warning about inconsistent definitions for the struct included in both cgo\nfiles (in this case, 'XRectangle')\n\nWhich compiler are you using (5g, 6g, 8g, gccgo)?\n6g\n\nWhich operating system are you using?\nlinux\n\nWhich revision are you using?  (hg identify)\n3e8c5af7bb1a tip\n\nPlease provide any additional information below.\nOne way I can see this being solved is by identifying the _Ctype_struct___* definitions\nby a hash of their C declarations, such that structs originating from the same C source\nwill be given the same name, regardless of the presence of other structs in the file,\nand the warning will not be generated.  I have attached a patch (\u0026quot;cgo.patch\u0026quot;)\nwith a naive implementation of this suggestion using the crypto/md5 package.  This\nresolves the issue in my minimal example as well as in the actual package I originally\nencountered the problem in, but may have performance issues compared to the original\nimplementation, as it calculates a cryptographic hash of every struct name used.\u003c/pre\u003e\n\n\n\n\n\nAttachments:\n\n1. \u003ca href=\"https://storage.googleapis.com/go-attachment/1264/0/patch\"\u003epatch\u003c/a\u003e (779 bytes)\n1. \u003ca href=\"https://storage.googleapis.com/go-attachment/1264/0/cgo.patch\"\u003ecgo.patch\u003c/a\u003e (642 bytes)",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 4,
	"closed_at": "2014-12-08T10:07:33Z",
	"created_at": "2010-11-10T04:27:15Z",
	"updated_at": "2016-06-24T19:22:10Z"
}
