{
	"id": 51280423,
	"number": 3329,
	"state": "closed",
	"title": "cmd/ld: support grsec kernels",
	"body": "\u003cpre\u003eFrom danderson@, regarding weekly.2012-03-13 (Go 1 RC1):\n\n\u0026quot;\u0026quot;\u0026quot;\nThis version of Go does not work on a subset of Linux kernels. Right off the bat I'd\nlike to say that I don't think this should hold up Go 1.0 . I would like to see a fix in\nGo 1.0.1 or Go 1.1.0, and I have a patch to offer. But for the initial release, it's\nmost definitely inconsequential.\n\nLinux kernels with the grsecurity.net hardening patch enforce write-xor-execute on\nmemory pages. Specifically, mmap() and mprotect() calls that attempt to make pages\nwrite+execute will fail unless the binary is marked as needing the W^X defense disabled.\nThis of course makes the runtime crash on startup, as it is dependent on W+X.\n\nIt's still possible to run Go binaries compiled on a different machine, by using the\n`paxctl` tool to tag the binary as needing W+X memory. However, unless the Go toolchain\ncan produce binaries tagged in this way by itself, the vanilla source tarball cannot be\nbuilt/used on machines with this kernel patch.\n\nI have a patch for Go's linkers that adds the appropriate ELF program header to Go\nbinaries. The header maps no additional memory into the runtime, it's used only for its\nflags (similar to PT_GNU_STACK). The patch is around 5 lines (times five to put it in\n[568]l). Once Go 1.0 gets out there, I'll send a code review with the change needed to\nget the toolchain working on grsec machines. Obviously I'll leave it to you folks to\ndecide whether it's worth supporting or not, as grsecurity users are a minority, and a\nworkaround exists for deploying on such machines, even if you can't compile on them\ndirectly.\n\nThanks for what's shaping up to be a great Go 1.0!\n- Dave\n\u0026quot;\u0026quot;\u0026quot;\n\nKeywords: grsec grsecurity\u003c/pre\u003e",
	"user": {
		"login": "bradfitz",
		"id": 2621,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 2,
	"closed_at": "2014-12-08T10:17:17Z",
	"created_at": "2012-03-15T22:25:37Z",
	"updated_at": "2016-06-24T22:15:36Z"
}
