{
	"id": 66094819,
	"body": "\u003ca id=\"c8\"\u003e\u003c/a\u003eComment 8:\n\n\u003cpre\u003esaar@countersoft.com,\n\nThank you for the program. Your program is similar to mine in #6. And your program\nsucceeds on my computer (windows/386). But it does fails on windows/amd64 (I didn't\nthink to try it there before) with \"CryptAcquireContext: Invalid Signature.\". So I can\nreproduce your issue on windows/amd64.\n\nUnfortunately, I don't see what we can do here. You suggest to leave SYSTEMROOT variable\nalone. But what about other variables? What else can break when some environmental\nvariable  is missing? We would have to document that behaviour (not \"clearing\"\nSYSTEMROOT in os.Clearenv on windows). We would need some \"official\" recommendation to\nleave SYSTEMROOT alone. I haven't found any. Have you? Starting new process without\nSYSTEMROOT listed would have similar effect. Should we prohibit that too, and silently\nadd SYSTEMROOT variable?\n\nI think there are too many questions with your suggestion. I think most sensible thing\nis to leave everything as is, and rely on us programmes doing our job properly.\n\n\u003e May 15 (4 days ago) Project Member #1 dave@cheney.net\n\u003e ... \n\u003e 2. Rather than not clearing %SYSTEMROOT%, maybe we can fix rand.Read on _windows to\nstore the the environment variables it needs in another place. Maybe, i'm not sure. On\nunix os.ClearEnv() clears a *copy* of the environment variables, the original ones exist\nin their original location, but are ofcourse inaccessible to Go code.\n\nsyscall.Clearenv does not clear process environment. But it has this comment \"//\nTODO(bradfitz): pass through to C\". So I think it is something that still to happen (if\nanyone cares about it). So I think windows version is more correct here. Mind you\nwindows syscall.Clearenv is actually setting all vars to blank, instead of actually\ndeleting them.\n\nLeaving issue closed until I hear better suggestions.\n\nAlex\u003c/pre\u003e\n\n\n\n_Status changed to **Unfortunate**._",
	"user": {
		"login": "alexbrainman",
		"id": 9796621,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-05-20T04:38:34Z",
	"updated_at": "2014-12-08T10:44:22Z"
}
