{
	"id": 246035544,
	"body": "@luxas Yes, at least it doesn't panic in `init`'s. Hyperkube (I assume it is `k8s.io/kubernetes/cmd/hyperkube`) also doesn't panic,\r\n```\r\n$ ./hyperkube \r\nError: No server specified\r\n\r\nThis is an all-in-one binary that can run any of the various Kubernetes servers.\r\n\r\nUsage\r\n\r\n  hyperkube \u003cserver\u003e [flags]\r\n\r\nServers\r\n\r\n  kubectl\r\n    Kubernetes command line client\r\n\r\n  apiserver\r\n    The main API entrypoint and interface to the storage system. The API server\r\n    is also the focal point for all authorization decisions.\r\n\r\n  controller-manager\r\n    A server that runs a set of active components. This includes replication\r\n    controllers, service endpoints and nodes.\r\n\r\n  scheduler\r\n    Implements a Kubernetes scheduler. This will assign pods to kubelets based\r\n    on capacity and constraints.\r\n\r\n  kubelet\r\n    The kubelet binary is responsible for maintaining a set of containers on a\r\n\r\n      particular node. It syncs data from a variety of sources including a\r\n      Kubernetes API server, an etcd cluster, HTTP endpoint or local file. It then\r\n      queries Docker to see what is currently running.  It synchronizes the\r\n      configuration data, with the running set of containers by starting or stopping\r\n      Docker containers.\r\n  proxy\r\n    The Kubernetes proxy server is responsible for taking traffic directed at\r\n\r\n      services and forwarding it to the appropriate pods. It generally runs on\r\n      nodes next to the Kubelet and proxies traffic from local pods to remote pods.\r\n      It is also used when handling incoming external traffic.\r\n  federation-apiserver\r\n    The API entrypoint for the federation control plane\r\n\r\n  federation-controller-manager\r\n    Controller manager for federation control plane. Manages federation service\r\n    endpoints and controllers\r\n\r\nCall 'hyperkube --make-symlinks' to create symlinks for each server in the local directory.\r\nCall 'hyperkube \u003cserver\u003e --help' for help on a specific server.\r\n```\r\n(same output as on AMD64)\r\n\r\nI believe the CL should apply to Go 1.7. There is currently a trybot failure, but it seems to happen only with SSA, so it might be an SSA bug :(\r\n",
	"user": {
		"login": "cherrymui",
		"id": 14119929,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-09-09T20:48:49Z",
	"updated_at": "2016-09-09T20:48:49Z"
}
