{
	"id": 168066297,
	"body": "@goinggo \r\n\r\nMy Amazon analogy clearly missed its mark, but that's OK; it's a flimsy analogy, and chasing it down would be counterproductive. So, dropping it.\r\n\r\n\u003e This is a question of code ownership to me.\r\n\r\nAbsolutely, entirely agreed.\r\n\r\n\u003e I must own all the code I use\r\n\r\nFor sure. This is a necessary precondition for reproducible builds.\r\n\r\n\u003e  and only use the code I need.\r\n\r\n*I assume \"use\" here means \"have available in the source tree,\" because...what else could it mean?*\r\n\r\nWhy?\r\n\r\nBefore compiling a project, do you delete the entire contents of your `GOPATH`, except for the transitive closure of imported packages from the `main` package you're compiling? If not, then you are 'using' more code than you need, which means this is not actually a \"must.\" The compiler doesn't care - why do you?\r\n\r\nI think you're conflating a correctness issue with a performance issue. Sure, I get that it feels nice and parsimonious to build a source tree with strictly only the packages that the compiler will use...but *the compiler already does exactly this.* Compilation will be negligibly faster (if at all), and the produced binary will not be any more efficient.\r\n\r\nAll you're saving is some disk space, and maybe some network time. It is not worth making a base language/tooling architecture-level change in to optimize those things when there are less drastic means available, *especially* when that change would preclude or complicate other approaches. \r\n\r\n\u003e The version being applied to the box does not negate that the version can be applied to an individual package in the box.\r\n\r\nThis explicitly blows past the \"level confusion\" issue that's been mentioned several times. So, I'll put it a different way: when all you have is an immutable commit-hash backed, (Go) package-level perspective on dependencies, how do you address [the diamond dependency problem?](http://www.well-typed.com/blog/2008/04/the-dreaded-diamond-dependency-problem/)\r\n",
	"user": {
		"login": "sdboyer",
		"id": 21599,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-30T20:09:54Z",
	"updated_at": "2015-12-31T00:09:52Z"
}
