{
	"id": 168127911,
	"body": "\u003e I know version ranges are something myself and others wouldn't want to use.\r\n\r\nAnd that's fine. The typical approach to a manifest admits the specification of a tight revision - i.e., immutable commit hash - as well as a floating value (a branch) or a should-be-immutable-but-could-float value (a tag), or ranges composed thereof.\r\n\r\nHowever, this proposal can't admit ranges. And, if you name a branch/tag, then it can't guarantee reproducible builds, because there's nowhere to store the actual, immutable commit ID that those were resolved to.\r\n\r\n\u003e However, what I'm asking for is consensus on what might amount to a lock file.\r\n\r\nI get that - and I do apologize to the extent that I've derailed the discussion from specifically that.\r\n\r\nSo, to the point: I can't support the proposal, because\r\n\r\n* I don't believe lock files should exist without manifests, or manifests without lockfiles. Both are necessary but individually insufficient. Consequently, lockfiles without manifests should be considered harmful. The piece I'm working on will explain why in detail, but briefly: manifests describe user intent, and lockfiles the result of processing that intent. Conflating these two has nasty UX and correctness implications.\r\n* Being that I view lockfiles as a machine-generated thing, having a 'comment' field doesn't make sense.\r\n* Package management should be a completely isolated \"phase 0\" of compilation. To have the 'tree' property in the spec file would necessarily muddy the waters between compilation and package management (as the compiler, via `go/build`, would necessarily have to change its behavior based on that flag)\r\n* A sorta-shared, sorta-not lockfile where different package managers can add their own fields would create unmanageable implementation complexity. See, for example, Ruby, where the most that rbenv, rvm, rbfu, and chruby have been able to share is a [.ruby-version file](https://gist.github.com/fnichol/1912050)",
	"user": {
		"login": "sdboyer",
		"id": 21599,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-31T05:37:01Z",
	"updated_at": "2015-12-31T05:56:30Z"
}
