{
	"id": 168840737,
	"body": "\u003e Yes, the version number gives you a clue / hint wrt compatibility, but that's it.\r\n\r\nYep, that's all they do. Wanting any more from them [is a poor expectation in the first place](https://news.ycombinator.com/item?id=8155601).\r\n\r\nThat does not make them unuseful. It just means that instead being a tool for the machine to use in making a final decision about what works, they're a tool to help you go through the process of figuring out what works.\r\n\r\n\u003e you would pick a version to record+copy\r\n\r\nAny proposed solution, including one with version ranges, still requires you to make such a choice. The only difference is that, when version ranges are permitted, the machine can *help* you with that choice; it needn't just make it for you and pretend everything is fine.\r\n\r\nThat choice is hard. It will always be hard. The real benefit of the ranges is the additional *information* such ranges can express when you're dependent on a library (or two, or three) where one of these situations arises. If all they have is the commit id that they're pinned to, you (typically) have no idea *why* they're pinned to that version, and so have to go in and understand their code well enough to figure out whether or not you can move them to a different version.\r\n\r\nIf, however, they can specify a version range, then you're taking advantage of the fact that their knowledge \u003e your knowledge when it comes to their library. Again, these are difficult decisions - I can't understand why you'd want *less* information on hand to resolve them. Sure, it's possible that the lib author did a bad job and put in an unhelpful or incorrect version range, but: \r\n\r\n* It's still probably faster to figure that out and go from there than it is to go in blind with only the commit, and\r\n* Once you figure out a saner range for them to use, you can send a PR to fix their poor choice. And then, the open source cherubim break out into song, as you'll have done some work that potentially helps someone *else* when they're in this same difficult situation in the future.",
	"user": {
		"login": "sdboyer",
		"id": 21599,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-01-04T23:12:09Z",
	"updated_at": "2016-01-05T03:18:56Z"
}
