{
	"id": 167680848,
	"body": "@mattfarina \r\n\r\n**End Goal:** A tool provided with the vendor spec file should be able to fetch all packages at a given revision from their original repository (if available).\r\n\r\nThis would enable standard user tooling for fetching remote packages at a given revision. This also enables machine analysis of dependencies across the board, such as looking for vulnerable revisions (dvcs hashes) and mapping dependency usages.\r\n\r\n...\r\n\r\nRevision Time: I've worked on projects that are 15+ years old. Code bases sometimes lose touch with original source and sometimes I just want to know what year or decade it is from.\r\n\r\nComment: JSON sucks, but is simple and well supported. If you want to write down a comment, with a tool or by hand, put that human note there. By itself JSON doesn't support // comments, so turn in to fields.\r\n\r\nAs per the spec, all unrecognized fields are required to be persisted by other tools modifying a file. In other words, extensions are expected.\r\n\r\n...\r\n\r\nWhile I don't want to quibble with words, it is called the \"vendor specification\" because it is specifying vendor package revisions. It isn't called a package specification because it knows nothing about the package it is used in.\r\n\r\nYou are correct. The vendor-spec file lives in the vendor folder and talks about the vendor packages. If you want a package meta-data file it should live in a package directory and tell you about the package folder it is in.\r\n\r\nThe goal is to write down what revisions is in the vendor folder. What you call a lock file. If the source of the package isn't from the the \"go get\" location, then it provides the `origin` to write down which location it does come from. (Useful if a package has a modified package from another location, like `github.com/microsoft/azure/go/vendor/crypto/tls`). By default it (currently) works at the package level unless you specify the proposed `\"tree\": true` parameter.\r\n",
	"user": {
		"login": "kardianos",
		"id": 755121,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-12-28T23:53:46Z",
	"updated_at": "2015-12-28T23:53:46Z"
}
