{
	"id": 97303443,
	"number": 11871,
	"state": "closed",
	"title": "math/rand: Deterministic random by default is dangerous",
	"body": "Go's standard library is generally considered to have great security-focused defaults (like net/http validating certificates out of the box). In many cases, the default behaviour goes out of the way to prevent the programmer from employing bad practices (such as relying on map key ordering). I believe that the default behavior of math/rand can be improved to better represent these ideals.\r\n\r\nThere have already been incidents where people didn't realize that math/rand was deterministic by default ([example](https://github.com/golang/go/issues/4509)), and even in security-related applications ([example](https://groups.google.com/forum/#!topic/golang-nuts/c0cSejwRro8/discussion)). Additionally, tutorials tend to forego mentioning this potentially-catastrophic default ([example](https://gobyexample.com/random-numbers)).\r\n\r\nI want to acknowledge that the stdlib documentation mentions this behavior in the second paragraph.\r\n\r\n\u003e Random numbers are generated by a Source. Top-level functions, such as Float64 and Int, use a default shared Source that produces a deterministic sequence of values each time a program is run. Use the Seed function to initialize the default Source if different behavior is required for each run.\r\n\r\nUnfortunately, merely documenting dangerous default behaviour has not proven to be sufficient. Also worth pointing out that the math/rand docs don't mention crypto/rand (this should be fixed too).\r\n\r\nTo resolve this, I propose that the top-level math/rand functions be seeded by crypto/rand's Reader by default.\r\n\r\nContext: PHP's mt_rand was recently torn down for generating only odd numbers when the max value given was too big (a reasonably easy mistake to make; [HN thread](https://news.ycombinator.com/item?id=9941364)). Some Twitter discussions started by @richo pointed out that default-deterministic random is a similarly easy mistake to make.",
	"user": {
		"login": "shazow",
		"id": 6292,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Documentation"
		},
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 27,
	"closed_at": "2015-07-31T07:59:02Z",
	"created_at": "2015-07-26T09:44:25Z",
	"updated_at": "2016-08-05T16:11:16Z",
	"milestone": {
		"id": 905105,
		"number": 1,
		"title": "Go1.5"
	}
}
