{
	"id": 51288164,
	"number": 8419,
	"state": "closed",
	"title": "x/talks/present: Default font size is too small for talks presented via projector",
	"body": "by **kburkeorg**:\n\n\u003cpre\u003eAt the Go SF meetup today, two presenters used the go-talks format, and their slides\nwere unreadable. Ten or twelve lines of text on a projector are too small to be read at\na distance of thirty feet.\n\nI acknowledge this is a difficult problem, because a slide framework doesn't know\nwhether people are consuming it from far away or on their laptops.\n\nFurthermore, I acknowledge that increasing the font size decreases the amount of space\navailable for slide content and thus the complexity of idea that a single slide can\nrepresent. For a fuller discussion of the tradeoffs here, read \u0026quot;Powerpoint:\nPitching out Corrupts Within\u0026quot; by Edward Tufte.\n\nWhat steps reproduce the problem?\n\n1. Create a slide using the go.tools/present template, for example,\n\u003ca href=\"http://go-talks.appspot.com/github.com/kisom/gosf201407/crypto.slide#10\"\u003ehttp://go-talks.appspot.com/github.com/kisom/gosf201407/crypto.slide#10\u003c/a\u003e\n2. Project the slide's contents onto a screen with a projector. Stand thirty or fifty\nfeet away and attempt to read the words on the slide. Ask a 50 or 60 year old to do the\nsame.\n\nWhat happened?\n\nIt was very difficult to read the words\n\nWhat should have happened instead?\n\nThe template should provide some sort of \u0026quot;Projector\u0026quot; mode which boosts the\ntext, or have an increased default font size.\n\nPlease provide any additional information below.\n\nZooming in on slides does not increase the text size inside the window - instead, the\nmiddle of the slide takes up more of the browser window. The text in the slide should\nincrease in size without the slide background moving.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"assignee": {
		"login": "adg",
		"id": 8446613,
		"type": "User",
		"site_admin": false
	},
	"comments": 2,
	"closed_at": "2015-08-27T01:39:56Z",
	"created_at": "2014-07-24T06:58:22Z",
	"updated_at": "2016-09-04T20:46:59Z",
	"milestone": {
		"id": 1067491,
		"number": 22,
		"title": "Unreleased"
	}
}
