{
	"id": 66099907,
	"body": "\u003ca id=\"c7\"\u003e\u003c/a\u003eComment 7:\n\n\u003cpre\u003eThe CL only hides the 6c generated warnings for files that are entirely generated by\nSWIG.  There is absolutely no user written code in these files.  If you take a look, you\nwill see that the files are nothing but variable declarations.  So there is really no\ncost to hiding the warnings, as there is absolutely nothing that the user can do to fix\nthem.\n\nYes, at some point SWIG needs to stop supporting old versions of Go.  In fact SWIG no\nlonger works with Go 1.0.3.  And, yes, exposing the version in runtime.h is probably a\ngood idea.  But SWIG should support old versions of Go as long as possible.  Go 1.1 is\nnot all that old--it came out less than two years ago.  There are certainly systems\nstill running it.  The usual SWIG philosophy is to support old versions for as long as\npossible; for example, current SWIG supports very old versions of Python.\n\nThe version of SWIG that Go requires and the version of Go that SWIG requires are two\nentirely different things.  We don't want to force the two independent projects to move\nforward in lockstep.  In particular it would be nice if new versions of Go did not\nrequire a new version of SWIG.  Unfortunately the significant changes in Go 1.4 for\nsupporting an improved GC did not permit supporting old versions of SWIG.\n\nThe truth is that I made a mistake in the original SWIG port: I had SWIG replicate the\noperations of cgo, rather than having SWIG invoke cgo.  This was an understandable\nmistake since the SWIG support was written before the go tool existed.  However, it\nwould be better if SWIG generated input for cgo, so that cgo could take responsibility\nfor the Go/C interface.  This would in essence mean that SWIG would generate a C\ninterface for C++ code.  Unfortunately this is of course a significant change and I\ndon't anticipate having any time to work on it.\u003c/pre\u003e",
	"user": {
		"login": "ianlancetaylor",
		"id": 3194333,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-11-07T16:17:26Z",
	"updated_at": "2014-12-08T10:49:43Z"
}
