{
	"id": 51283368,
	"number": 5260,
	"state": "closed",
	"title": "go test: Unicode (UTF-8) BOM in middle of file",
	"body": "\u003cpre\u003eThe go test command should not fail. The go fmt, go build, and go run commands succeed.\n\n$ go fmt bom.go \u0026amp;\u0026amp; go build bom.go \u0026amp;\u0026amp; go run bom.go\nbom\n$ go test\n# testmain\n/tmp/go-build891955923/it/bom/_test/_testmain.go:9: Unicode (UTF-8) BOM in middle of file\nFAIL\tit/bom [build failed]\n$ cat bom.go\npackage main\n\nconst BOM = string('\\uFEFF')\n\nfunc main() { println(\u0026quot;bom\u0026quot;) }\n$ cat bom_test.go\npackage main\n\nimport \u0026quot;testing\u0026quot;\n\nfunc TestBOM(t *testing.T) {\n}\n$ \n\nGo program source code is not prohibited from containing U+FEFF in the middle of a file.\nIt's a protocol supporting its use as a BOM.\n\u003ca href=\"http://tip.golang.org/ref/spec#Source_code_representation\"\u003ehttp://tip.golang.org/ref/spec#Source_code_representation\u003c/a\u003e\n\nQ: What should I do with U+FEFF in the middle of a file?\n\u003ca href=\"http://www.unicode.org/faq/utf_bom.html#bom6\"\u003ehttp://www.unicode.org/faq/utf_bom.html#bom6\u003c/a\u003e\n\nA: In the absence of a protocol supporting its use as a BOM and when not at the\nbeginning of a text stream, U+FEFF should normally not occur. For backwards\ncompatibility it should be treated as ZERO WIDTH NON-BREAKING SPACE (ZWNBSP), and is\nthen part of the content of the file or string. The use of U+2060 WORD JOINER is\nstrongly preferred over ZWNBSP for expressing word joining semantics since it cannot be\nconfused with a BOM. When designing a markup language or data protocol, the use of\nU+FEFF can be restricted to that of Byte Order Mark. In that case, any U+FEFF occurring\nin the middle of a file can be treated as an unsupported character. A: In the absence of\na protocol supporting its use as a BOM and when not at the beginning of a text stream,\nU+FEFF should normally not occur. For backwards compatibility it should be treated as\nZERO WIDTH NON-BREAKING SPACE (ZWNBSP), and is then part of the content of the file or\nstring. The use of U+2060 WORD JOINER is strongly preferred over ZWNBSP for expressing\nword joining semantics since it cannot be confused with a BOM. When designing a markup\nlanguage or data protocol, the use of U+FEFF can be restricted to that of Byte Order\nMark. In that case, any U+FEFF occurring in the middle of a file can be treated as an\nunsupported character.\u003c/pre\u003e",
	"user": {
		"login": "peterGo",
		"id": 4561296,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "FrozenDueToAge"
		}
	],
	"comments": 11,
	"closed_at": "2014-12-08T10:28:19Z",
	"created_at": "2013-04-10T14:44:28Z",
	"updated_at": "2016-06-24T22:37:47Z"
}
