{
	"id": 109095715,
	"body": "I would like to propose this issue is re-opened.\r\n\r\nI am using Go in an existing system where there are an existing set of certs that are already used for client authentication.  Because of live upgrade considerations generating new certs is difficult and the existing certs do not specify EKU.  From my reading of the standard the way we are currently using the certificates is compliant.  One option I have to fit within this system is to patch the libraries which I'd rather not do. I'll try the @agl RequireAnyClientCert proposal above as well.  If that works then this isn't as critical for me...\r\n\r\nFrom RFC3280:\r\n\u003e This extension MAY, at the option of the certificate issuer, be either critical or non-critical. If the extension is present, then the certificate MUST only be used for one of the purposes indicated.\r\n\r\nRFC5280:\r\n\u003e If the extension is present, then the certificate MUST only be used for one of the purposes indicated.\r\n\r\nIf I'm reading it correctly, the existing code (ftls/handshake_server.go) appears to treat a missing EKU the same as if the EKU is specified without the client auth usage but as far I can tell there's no real justification in the standard for doing this?\r\n\r\n```go\r\nok := false\r\nfor _, ku := range certs[0].ExtKeyUsage {\r\n    if ku == x509.ExtKeyUsageClientAuth {\r\n        ok = true\r\n\tbreak\r\n   }\r\n}\r\n```\r\n\r\nFurther reference:\r\nhttp://tools.ietf.org/html/rfc5280#section-4.2.1.12\r\nhttp://blogs.msdn.com/b/kaushal/archive/2012/02/18/client-certificates-v-s-server-certificates.aspx\r\nhttp://security.stackexchange.com/questions/68491/recommended-key-usage-for-a-client-certificate\r\n\r\nI'd be happy to propose a patch if there's agreement there is an issue.  Either changing the default behaviour or providing some way of overriding could solve my problem.  Any other suggestions would be appreciated.\r\n",
	"user": {
		"login": "GuySirton",
		"id": 4914433,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-06-04T23:47:12Z",
	"updated_at": "2015-06-04T23:47:12Z"
}
