{
	"id": 66081120,
	"body": "\u003ca id=\"c6\"\u003e\u003c/a\u003eComment 6:\n\n\u003cpre\u003eThanks for looking at this. You're right, after all there doesn't seem to be anything\nspecifically wrong with cmd/go. (It was one symptom, not the cause; it just took me a\nwhile to figure that out.) Sorry for the confusion.\n\nThe problem / symptom that was related to cmd/go is what I refer to as (S2) above in #4:\n(S2) When invoking batch files with exec.Start, the first cmd.exe found in cwd / PATH is\nused instead of %ComSpec%\nMore specifically, the problem was that go get was trying to invoke \"cmd /C hg\" using an\narbitrary cmd.exe in the PATH instead of %ComSpec%. I think invoking an arbitrary\ncmd.exe in cwd or on the PATH can in the better case cause a great deal of confusion,\nand in the worse case serious security issues.\n\nAnd another problem / symptom that I think is related to this is:\n(S1) exec.Start doesn't work with program paths found by exec.LookPath with non-standard\nfile extensions (e.g. .PY)\n\nMy interpretation is that there is an issue with how processes are invoked for\nnon-binary executables. The docs for CreateProcess [0] state that the command\ninterpreter with parameter \"/C\" should be specified when invoking batch files, but this\ndoesn't happen in the most common flow from exec.Command -\u003e exec.Start -\u003e\nsyscall.StartProcess. It appears that CreateProcess includes a flaky workaround for this\ncase, which can end up invoking an arbitrary cmd.exe instead of %ComSpec%, triggering\n(S2).\n\n[0] \u003ca href=\"http://msdn.microsoft.com/en-us/library/windows/desktop/ms682425.aspx\"\u003ehttp://msdn.microsoft.com/en-us/library/windows/desktop/ms682425.aspx\u003c/a\u003e\n\nIn addition, CreateProcess doesn't support other types of executables (e.g. .PY) that\nmay be specified with PATHEXT and file type association, so even though exec.Command\n\"finds\" the command, exec.Start fails to run it. This again is another case when\nexec.Command -\u003e exec.Start -\u003e syscall.StartProcess attempts an unsupported kind of\ninvocation using CreateProcess (except that CreateProcess doesn't even have a flaky\nworkaround for this one).\n\nI think for non-binary executables the command interpreter (%ComSpec%) should be\nexplicitly specified when invoking CreateProcess. This could be added to one of\nsyscall.StartProcess, os/exec.Start, or os/exec.Command (but the latter won't fix\nprograms that create exec.Cmd directly).\u003c/pre\u003e",
	"user": {
		"login": "speter",
		"id": 450945,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-06-23T11:23:32Z",
	"updated_at": "2014-12-08T10:31:14Z"
}
