{
	"id": 175281139,
	"number": 17004,
	"state": "closed",
	"title": "Compiler still allows unused variables to pass by!",
	"body": "Please answer these questions before submitting your issue. Thanks!\r\n\r\n### What version of Go are you using (`go version`)?\r\n1.7\r\n\r\n### What operating system and processor architecture are you using (`go env`)?\r\nUbuntu 16.04 on AMD64 architecture.\r\n\r\n### What did you do?\r\nSince warnings are errors, people use a workaround to fool the compiler. They assign a variable or function result to the blank identifier (underscore), which fools the compiler into thinking that var is used.\r\n\r\n### What did you expect to see?\r\nI expected compiler to stop and say that variable is still unused, because assigning to blank identifier does nothing.\r\n\r\n### What did you see instead?\r\nCompiler successfully compiled the file.\r\n\r\n\r\n### Solution\r\n\r\n1. Treat the assignment of variables to blank identifier as if the var is still unused. This will make the compiler stop and report error, which is consistent with golang philosophy so far.\r\n\r\n2. Or a better solution, don't report an error when a variable is not used. Report a warning. And don't treat warnings as errors. \r\n\r\nTrue, warnings should be very visible, in BOLD ORANGE font. Not only during compilation, but in runtime the app should say \"THIS APP IS UNFINISHED AND CONTAINS WARNINGS AND POSSIBLE BUGS\". So that whoever releases such an app to production has to explain himself.\r\n\r\nBUT, during debugging and experimenting it's a complete waste of time to constantly comment and uncomment code, or delete vars which will be required just a few seconds later. This completely kills the joy of working and experimenting in golang.\r\n\r\nIf you ever see a laboratory or workshop where everything is nice and tidy, and every tool is at the right place, then either the shop is closed, or it's a place full of dull people which will never make something new, good and innovative.",
	"user": {
		"login": "zexerlang",
		"id": 19150849,
		"type": "User",
		"site_admin": false
	},
	"comments": 1,
	"closed_at": "2016-09-06T17:15:04Z",
	"created_at": "2016-09-06T15:42:53Z",
	"updated_at": "2016-09-06T17:15:04Z",
	"reactions": {
		"total_count": 1,
		"-1": 1
	}
}
