{
	"id": 159634196,
	"number": 16033,
	"state": "open",
	"title": "proposal: adjustments to identifiers and export rules",
	"body": "The current export rule says, in brief, a variable is exported if its first character is an upper-case letter. This means that there is no way to have an exported identifier that is a word in a non-alphabetic language such as Japanese or Chinese.\r\n\r\nI propose we specify the rule the other way around:\r\n\r\nA variable is not exported if its first character is a lower-case letter or underscore.\r\n\r\nThis makes that a name like 日本語 would be exported; to avoid export call it _日本語.\r\n\r\nThe change is pretty minor and will have almost no effect on existing programs I know of, but will cause programs using Han identifiers to export previously unexported identifiers. I don't know of any, but the point that it is impossible to have an exported non-alphabetic identifier has been made many times, always (to me at least) by people who speak alphabetic languages.\r\n\r\nStill, this would fix that problem simply, if it needs fixing.\r\n\r\nOn a related note, some writing systems - Devanagari is one (see #5167) require combining characters. The current identifier rules forbid combining characters; perhaps that should be relaxed, although that will require a canonicalization rule for combining characters. Unicode does have a definition for identifiers (http://unicode.org/reports/tr31/); perhaps Go should use it. Note that the addition of combining characters, allied with the export proposal above, would make it possible to export Devanagari identifiers.\r\n\r\n",
	"user": {
		"login": "robpike",
		"id": 4324516,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Go2"
		},
		{
			"name": "LanguageChange"
		}
	],
	"comments": 1,
	"created_at": "2016-06-10T13:23:53Z",
	"updated_at": "2016-07-29T20:17:09Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	},
	"reactions": {
		"total_count": 7,
		"+1": 6,
		"heart": 1
	}
}
