{
	"id": 232523035,
	"body": "I'm in favor of the original walk up until you find `src` proposal or walk up to the highest level `src` dir. \r\n\r\nAs someone who works with a unique GOPATH per project with each project vendoring its dependancies -- I really like the gb model of auto detection of the GOPATH based on which project path you are in. Its just like git and it best matches the workflow I see developers use day to day which is switching between git repos that are all fully self contained gopaths in essence (or a project in gb terms).\r\n\r\nI commonly see people work around existing gopaths by including `build.sh`scripts that set the gopath to avoid the developer being required to set their environment when moving between git repos. In this development model it is expected that if you want to develop the project, you clone the repo with git. If you are consuming the project you are importing it with a vendor tool to an existing repo. Without the repo including the build script then every time I move between git repos I would have to change my GOPATH env again.\r\n\r\nWith this proposal someone who normally uses something like git clone goes from doing:\r\n`git clone https://github.com/coreos/mantle`\r\n`cd mantle`\r\n(now one can call `./build` or other bash scripts to work on the repo and create a gopath)\r\nTo doing:\r\n`git clone https://github.com/coreos/mantle mantle/src/github.com/coreos/mantle`\r\n`cd mantle/src`\r\nAnd now I am in the gopath and can execute any go commands requiring the path to be setup correctly. In the first example things like `go list` still don't work out of the box whereas with the proposal you have a properly setup go path and can make better use of go tooling.\r\n\r\nBasically, for this work style, this proposal would eliminate a lot of bash glue in the example repo above as long as the new git command make sense to developers. Also, its not like this proposal stops people from using the old clone style and bash scripts.\r\n\r\nI understand there are different working styles to consider here, I just wanted to chime in that for the work style I commonly see I am in favor of the original proposal.\r\n",
	"user": {
		"login": "pbx0",
		"id": 10945781,
		"type": "User",
		"site_admin": false
	},
	"reactions": {
		"total_count": 1,
		"+1": 1
	},
	"created_at": "2016-07-14T00:13:50Z",
	"updated_at": "2016-07-14T00:54:48Z"
}
