{
	"id": 93049449,
	"body": "Ok, I'll try to explain more clearly...\r\n\r\nThe starting path (C:\\Users\\username\\AppData\\Local) contains the ntfs junction \"Application Data\" which points to the starting path again (loop/recursion).\r\n\r\nWhen the program gets to the ntfs junction it walks into it and begins looping/recursion. It then creates about one path error for every file in the starting path, which is about 14000 path errors.\r\n\r\nExample output:\r\n\r\n    GetFileAttributesEx C:\\Users\\userName\\AppData\\Local\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\SuperCollider\\Help\\BrokenLink.html: The system can not find the path specified.\r\n    GetFileAttributesEx C:\\Users\\userName\\AppData\\Local\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\SuperCollider\\Help\\Browse.html: The system can not find the path specified.\r\n    GetFileAttributesEx C:\\Users\\userName\\AppData\\Local\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\Application Data\\SuperCollider\\Help\\Classes: The system can not find the path specified.\r\n\r\nI expected Walk to skip the ntfs junction (\"Application Data\") and go on with the next real directory, avoiding many path errors because it does so for symbolic links.\r\nAccoording to https://github.com/golang/go/issues/4759#issuecomment-66074349 Walk avoids following symbolic links by design to avoid looping. It would be consistent if Walk would avoid following ntfs junctions for the same reasons.",
	"user": {
		"login": "ClusterCat",
		"id": 11902995,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2015-04-14T20:23:52Z",
	"updated_at": "2015-04-14T20:29:46Z"
}
