{
	"id": 66091181,
	"body": "\u003ca id=\"c21\"\u003e\u003c/a\u003eComment 21 by **czarek.tomczak**:\n\n\u003cpre\u003eI had a comment on this from the Marshall Greenblatt, the author of Chromium Embedded\nFramework:\n\n\u003e Attempting to reserve almost 1/2 of available memory on a 32-bit system\n\u003e is bound to fail a lot. Address space becomes more fragmented as time \n\u003e goes on. I doubt any system that's been used for a few hours/days will \n\u003e succeed with this allocation.\n\n------\n\nIt worked fine on a clean XP SP3 machine. The problems started after installing Windows\nUpdates. Sounds to me that one of these updates installed some security feature called\n\"ASLR\" - Address space layout randomization. That's why libcef.dll is loaded in the\nmiddle of large memory block.\n\nThis was a case where only one single application was running on this machine, with lots\nof free memory. And it failed. I don't think that fixing libcef.dll allocation place is\ngoing to fix the issue. There may be other applications running on this system, and its\nlibraries may also be put in some random locations, so the memory gets fragmented. If it\nfails when there is only one application running and the system was started only a\nminute ago, then I don't see no way of this memory feature of Go to prevail on average\nusage scenarios.\n\nI just started thinking more about it today. If I open multiple browser tabs in my\napplication, it may result in about 10 processes running (that's number of Chrome\nbrowser proccesses on my machine currently - an average browser usage). To make this\nhappen in Go, it would be required to create 10x continous memory blocks each of 736 MB,\nso in total almost 7.36 GB memory required by a single application. Is this correct?\n\nSo the only solution is to modify Go runtime and recompile from sources? Is it easy? How\nwill it affect Go if I change the memory reserved to for example 100MB?\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-02-13T10:03:15Z",
	"updated_at": "2014-12-08T10:40:34Z"
}
