{
	"id": 120147416,
	"number": 13463,
	"state": "open",
	"title": "proposal: runtime: additional memory profiler report modes",
	"body": "Memory profiler reports heap contents at the end of one of the previous GCs. This makes profiles \"stable\" in the sense that it does not dependent on exact point in time it is queried (just after GC, just before GC, somewhere in the middle). It makes sense. However, we see periodic confusion caused by the fact that actual memory consumption is actually 2x of what's reported. The meaning of the reported numbers is not obvious, it is reasonable to assume that if a tool says X MB, then memory consumption should be ~X MB.\r\n\r\nWhile what we report is a useful view of reality, it is not the only view possible and maybe it should not be the default view. I think that all of the following views are useful:\r\n - heap contents at the end of GC cycle (what we report now); shows more-of-less persistent data in heap and allows to understand why my heap is that large\r\n - heap contents at the _beginning_ of GC cycle (total memory consumption should be GOGC times larger than the prvious one); allows to understand memory consumption of the program and shows kind of worst case view of heap; this view can also be appealing to developers with C/C++ background\r\n - difference between the previous two modes (what was collected during a GC cycle); allows to understand why GCs are happening so frequently and optimize performance (identify transient allocs)\r\n\r\nAlso, if you are presented with several options, it forces you to ask yourself a question regarding the difference between these options. If you understand the difference, you interpret the data correctly.\r\n\r\nThe proposal is to add these additional modes to memory profiler. Exact set of modes and the default mode is discussable. Degenerate case would be just to switch the default.\r\n\r\nFrom implementation point of view, I think all proposed modes are easy to implement in the current phased design.",
	"user": {
		"login": "dvyukov",
		"id": 1095328,
		"type": "User",
		"site_admin": false
	},
	"labels": [
		{
			"name": "Proposal"
		}
	],
	"comments": 14,
	"created_at": "2015-12-03T11:12:44Z",
	"updated_at": "2016-07-26T01:33:11Z",
	"milestone": {
		"id": 1373555,
		"number": 30,
		"title": "Proposal"
	}
}
