{
	"id": 66087978,
	"body": "\u003ca id=\"c2\"\u003e\u003c/a\u003eComment 2:\n\n\u003cpre\u003eSorry for the long delay. Work got in the way of writing a comparison between Go and\nPython.\n\nI hate two test scenarios- The first is a 1GB file of data from /dev/zero, bzip\ncompressed. The second is a 1GB file of data from /dev/urandom also bzip compressed. \n\nThe first should be a best case performance since all of the data is RLE encoded and the\ncompressed file is a few hundred bytes. The second case should be a worst-case scenario\nwhere the data is not generally compressible and the compressed file is larger than the\nsource.\n\nResults:\nDecompressing /home/tcameron/tmp/decompress/zeros.data.bz2\nGo 1.1 Decompress time: 3.212 sec\nPy 2.7 Decompress time: 3.070 sec\n\nDecompressing /home/tcameron/tmp/decompress/random.data.bz2\nGo 1.1 Decompress time: 528.765 sec\nPy 2.7 Decompress time: 104.724 sec\n\nLet's call the zeros.dat.bz2 test even. Milliseconds for this file do not really\ninterest me. It is worth noting that Python's version is faster...but by less than a\nquarter of a second. This could be down to lots of things and I'm not necessarily\ninterested in tracking them down.\n\nThe random.dat.bz2 test is much more enlightening. Slower by a factor of \u003e5 is\nsurprising to me, and it equates to roughly 1.9MB/sec. I understand there hasn't been\nmuch effort to optimize the bzip library for speed, so I figured my real-world\nexperience could be used to help the project in some way.\n\nMy actual use case of this is a syslog file parser, which I've been writing to replace a\nPython script I previously wrote and to drive the lessons of Go into my brain. I see\nvery similar results with text file processing, but since I can not offer the text files\nthemselves for others to test with, I've tried something a bit more reproducible.\n\nThese tests are being performed on a Lenovo T430 with an SSD, Intel Core i5-3320M CPU @\n2.60GHz, and 8GB RAM while plugged into an AC power source. The Operating System is\nUbuntu 13.10 with Kernel 3.11.0-13-generic, x86_64 architecture.\n\nTo review the source of each test application, please review my Github repos:\n\u003ca href=\"https://github.com/tomc603/pycompresstest\"\u003ehttps://github.com/tomc603/pycompresstest\u003c/a\u003e\n\u003ca href=\"https://github.com/tomc603/gocompresstest\"\u003ehttps://github.com/tomc603/gocompresstest\u003c/a\u003e\u003c/pre\u003e",
	"user": {
		"login": "tomc603",
		"id": 5369163,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2013-11-25T21:39:34Z",
	"updated_at": "2014-12-08T10:37:31Z"
}
