{
	"id": 214779759,
	"body": "\u003e This has been an issue since 1.5 and has been ignored since then (it has always been \"we will address in release N+1\").  Kicking the can down the road has proven to not be helpful. \r\n\r\n@pborman to be a bit mean, that's what they do with generics for the last 6 years, no? Not to mention other issues (multiple package coverage, etc...) I don't want to go there but this is not a technical argument for a good implementation of a solution imho.\r\n\r\n\u003e They can provide the minimal [...] Or they can provide more useful information [...]\r\n\r\nSo why not force those who want this feature to do proper documentation / packaging for it? @rsc says that it's ok to make it painful for end-users, why not make it painful (and get real value of it) for producers as well?\r\n\r\n\u003e Adding checksums is interesting, but in this case I would venture to say that versioning is more useful as it will immediately tell you which version is more up to date.\r\n\r\nWe don't want to have `go get` aware on versioning so why would binary only packages be different? Also checksums provide a different functionality than versioning.\r\n\r\n\u003e I really thank Russ for doing this as I have been one of those affected by the deteriorating \"support\" for binary only packages (as a consumer, not a producer). \r\n\r\nI too am grateful for his work and all the other contributors to the Go ecosystem, don't get me wrong. But like I've stated, this feels bad. I agree with what @robpike suggested to flag it as experimental. Meanwhile we could still discuss about this, no?\r\n\r\nI feel I don't stress enough for this. I'm not against the idea of having this implemented, not even a bit. I'm against the idea of rushing it to get in for 1.7 just because it's something people are doing today. Vendoring has more problems and I can argue that it's a problem for more people than binary-only packages are. I don't want to force this comparison anymore but this doesn't sound inline with the Go vision of offering pragmatic solutions for problems people have.\r\n\r\nI've raised a few points to at least have a decent discussion on how to solve them and, if solutions are found then I don't see any problem for getting this into 1.7.",
	"user": {
		"login": "dlsniper",
		"id": 607868,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-04-26T15:17:25Z",
	"updated_at": "2016-04-26T15:17:25Z"
}
