{
	"id": 214797099,
	"body": "I don't think anyone has said \"no, it should not be marked experimental\".\nThat is a fine idea.  One really nice thing about the solution is that if\nyou don't need binary-only packages then you will not notice this at all.\nIf you do need binary-only packages, you will be very grateful that this is\npart of 1.7.  This will also make Go more appealing for commercial\nproducts.  The GNU C compiler was going nowhere fast (in the commercial\nworld) until RMS relented and introduced the LGPL.\n\nOn Tue, Apr 26, 2016 at 8:18 AM, Florin Pățan \u003cnotifications@github.com\u003e\nwrote:\n\n\u003e This has been an issue since 1.5 and has been ignored since then (it has\n\u003e always been \"we will address in release N+1\"). Kicking the can down the\n\u003e road has proven to not be helpful.\n\u003e\n\u003e @pborman \u003chttps://github.com/pborman\u003e to be a bit mean, that's what they\n\u003e do with generics for the last 6 years, no? Not to mention other issues\n\u003e (multiple package coverage, etc...) I don't want to go there but this is\n\u003e not a technical argument for a good implementation of a solution imho.\n\u003e\n\nAt least generics work as well today as they did in 1.4.2 and 1.0 :-)  I\ncan't really say that about binary only package releases.\n\nThe reason this is being \"rushed\" into 1.7 is because it was not done for\n1.6 after 1.5 broken the existing recipes, and people are being held back\nto 1.4.2.  This is something I have had discussions about with various\nmembers of the Go team since 1.5.  There have been issues filed about it.\n\nIt seems you are saying that Russ did not go far enough and those questions\n(how to make go get work, how does IntelliJ work with it, what about\nvendoring) must be answered before anything goes in.  I disagree, I think\nRuss took the appropriate minimal solution for 1.7.  All those other things\ncan be discussed and addressed once we have more experience.  I don't think\nit would be possible to get a good answer for vendoring at this point as\nthe vendoring we have already has enough questions.  I can see an easy\npossible answer to vendoring, but it assumes that binary-only packages are\nfreely redistributable, but I don't think that will be the case.  You are\ncorrect that that vendoring needs more thought.\n\nSo, by all means, let's mark it experimental, let's have more discussions\nand debates, but let's *not* let those things from precluding this common\nsense minimal solution for 1.7.  Right now it feels that the discussion has\nbeen how to put up roadblocks to getting this minimal solution into 1.7.\n\n    -Paul\n",
	"user": {
		"login": "pborman",
		"id": 5115933,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2016-04-26T16:11:17Z",
	"updated_at": "2016-04-26T16:11:17Z"
}
