{
	"id": 66090769,
	"body": "\u003ca id=\"c33\"\u003e\u003c/a\u003eComment 33:\n\n\u003cpre\u003e\u003e\u003e But there are three signals that the Go runtime must catch itself in order to\ncorrectly implement the Go language spec: SIGSEGV, SIGBUS, SIGFPE. \n\u003e\n\u003e And thus SIGCHLD which is the signal we receive here must make the program crash?\n\u003e\n\u003e Also, please point me to where in the language spec these requirements are mentioned\nas I'm having trouble locating them.\n\nYou know, I'm actually trying to help here.  I started out by saying \"If somebody can\npropose how to fix this, that would be great.\"  Then I explained the problem as\naccurately as I can.  Throwing your hands up in the air and implying that things should\nbe other than as they are may make you feel better but it does not advance us toward a\nsolution.\n\nTo answer your questions: obviously SIGCHLD should not make the program crash.  Crashing\nthe program is not the intent.  The language spec requirements on the three signals I\nmentioned can be found at \u003ca href=\"http://golang.org/ref/spec#Arithmetic_operators\"\u003ehttp://golang.org/ref/spec#Arithmetic_operators\u003c/a\u003e and\n\u003ca href=\"http://golang.org/ref/spec#Address_operators\"\u003ehttp://golang.org/ref/spec#Address_operators\u003c/a\u003e.  Look for the reference to a run-time\npanic.  In order to implement those language requirements efficiently, the current\nimplementation relies on catching the signals I mentioned.\n\n\n\u003e\u003e As an aside, why would a C library disable the signal alternate stack?  What kind of\nsense does that make?  If the library is expected to be called by other programs, it\nsure seems like a bug in the library.\n\u003e\n\u003e Is that what it does though? I think it calls setjmp which in turn calls sigaltstack.\n\nIn that case setjmp is the C library function in question.  In GNU glibc setjmp does not\ncall sigaltstack; why would it?  I agree that your backtrace appears to show setjmp\ncalling sigaltstack, but I don't understand why it would do so.  The point of the setjmp\nfunction has nothing to do with sigaltstack.\n\nI found one possible source of the Darwin setjmp function at\n\u003ca href=\"http://www.opensource.apple.com/source/Libc/Libc-825.40.1/x86_64/sys/_setjmp.s\"\u003ehttp://www.opensource.apple.com/source/Libc/Libc-825.40.1/x86_64/sys/_setjmp.s\u003c/a\u003e , but it\ndoes not call sigaltstack.  You showed the first four instructions of setjmp in comment\n#20; it might be interesting to see the whole function.\u003c/pre\u003e",
	"user": {
		"login": "ianlancetaylor",
		"id": 3194333,
		"type": "User",
		"site_admin": false
	},
	"created_at": "2014-04-04T13:47:09Z",
	"updated_at": "2014-12-08T10:40:09Z"
}
