{
	"id": 173687899,
	"number": 16912,
	"state": "open",
	"title": "text/template: Template redefinition is not documented.",
	"body": "I believe it may be an issue that template redefinition is not documented.\r\n\r\nI only know it's possible to do so because [Go 1.6 release notes](https://golang.org/doc/go1.6#template) mentioned it:\r\n\r\n\u003e Second, the new {{block}} action, combined with _allowing redefinition of named templates_, provides a ...\r\n\r\n(Emphasis mine.)\r\n\r\nHowever, when I read documentation for text/template package, it does not seem to say that it's possible to redefine templates. It mentions this ability in passing, as part of [documenting the block action](https://golang.org/pkg/text/template/#hdr-Actions):\r\n\r\n\u003e The typical use is to define a set of root templates that are\r\n\u003e then customized by redefining the block templates within.\r\n\r\nHowever, it does not explicitly say anywhere that \"it's possible to redefine a named template\", nor does it discuss any limitations in doing so.\r\n\r\nThis may be an issue that can be resolved with a single sentence like \"It's possible to redefine a template by defining it again.\"\r\n\r\nThis may also be a non-issue if we consider that the ability to redefine templates can be understood to be implicit (i.e., if template redefinition is not explicitly said to be disallowed, then it must be allowed).\r\n\r\nRelated to https://github.com/golang/go/issues/3812 and CL that implements this https://go-review.googlesource.com/#/c/14005/. Its commit message did document this:\r\n\r\n\u003e Templates may now be redefined,\r\n\u003e but in the html/template package they may only be redefined before\r\n\u003e the template is executed (and therefore escaped).\r\n\r\n\u003e The intention is that such inline templates can be redefined by\r\n\u003e subsequent template definitions, permitting a kind of template\r\n\u003e \"inheritance\" or \"overlay\". (See the example for details.)\r\n\r\nI think mentioning that in the text/template docs would potentially resolve this issue, if it's an issue.",
	"user": {
		"login": "shurcooL",
		"id": 1924134,
		"type": "User",
		"site_admin": false
	},
	"comments": 1,
	"created_at": "2016-08-29T03:05:29Z",
	"updated_at": "2016-09-06T20:03:31Z",
	"milestone": {
		"id": 1709363,
		"number": 38,
		"title": "Go1.8"
	}
}
