{
	"id": 51282999,
	"number": 5022,
	"state": "closed",
	"title": "net/http: allow control of case of header key",
	"body": "by **tyson@stovepipestudios.com**:\n\n\u003cpre\u003ehttp.Header.Add() changes the case of the given header key, which causes\nproblems. See: \u003ca href=\"http://play.golang.org/p/ci5_qeAYRh\"\u003ehttp://play.golang.org/p/ci5_qeAYRh\u003c/a\u003e\n\nI'm on MacOS X 10.8.2 using Go 1.0.3, but this issue applies to all platforms\nand current versions of Go.\n\nI understand that this was done intentionally. The comment above the\nhttp.Request.Header declaration says:\n\n    // HTTP defines that header names are case-insensitive.\n    // The request parser implements this by canonicalizing the\n    // name, making the first character and any characters\n    // following a hyphen uppercase and the rest lowercase.\n\nIt's likely referring to section 3.4.7 of RFC 822, which says:\n\n    When matching any other syntactic unit, case is to be ignored.\n    For  example, the field-names \u0026quot;From\u0026quot;, \u0026quot;FROM\u0026quot;, \u0026quot;from\u0026quot;, and even\n    \u0026quot;FroM\u0026quot; are semantically equal and should all be treated ident-\n    ically.\n\n    When generating these units, any mix of upper and  lower  case\n    alphabetic  characters  may  be  used.  The case shown in this\n    specification is suggested for message-creating processes.\n\nIn an ideal world, all servers / remote APIs would respect this guideline when\nparsing and handling HTTP headers. However, they don't, which can cause grief\nfor users of the http package. I spent a fair amount of time myself trying to\nfigure out why a particular API endpoint wasn't finding and accepting my\nauthentication header.\n\nIt's for this reason that I believe that http.Header.Add() should not change\nheader key casing *because* the RFC says that casing isn't important. If casing\nisn't important, there's no reason to change it, anyways, and users can ensure\nthat their headers will be handled properly in cases when the remote service\ndoesn't respect the guideline.\u003c/pre\u003e",
	"user": {
		"login": "gopherbot",
		"id": 8566911,
		"type": "User",
		"site_admin": false
	},
	"assignee": {
		"login": "bradfitz",
		"id": 2621,
		"type": "User",
		"site_admin": false
	},
	"comments": 20,
	"closed_at": "2014-12-08T10:26:49Z",
	"created_at": "2013-03-10T04:52:29Z",
	"updated_at": "2016-02-19T16:19:04Z"
}
